calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/analyzer.1m
'\"macro stdmacro
.TH ANALYZER 1M local "Silicon Graphics, Inc."
.SH NAME
analyzer \- capture and decode network traffic
.SH SYNOPSIS
.B /usr/sbin/analyzer
.RB [ \-b\0 \f2buffer\fP]
.RB [ \-c\0 \f2count\fP]
.RB [ \-i\0 \f2interface\fP]
.RB [ \-l\0 \f2length\fP]
.RB [ \-p\0 \f2protopts\fP]
.RB [ \-q\0 \f2limit\fP]
.RB [ \-t\0 \f2interval\fP]
.RB [ \-u\0 \f2controlsFile\fP]
.RB [ \-ry ]
.RI [ filter ]
.SH DESCRIPTION
\f2Analyzer\fP is a protocol analyzer with a graphical user interface.  It has
the ability to capture packets from the network or from a previously saved
file, match them against a filter expression, and decode the matched packets.
.P
\f2Analyzer\fP uses \f2snoopd\fP to capture network traffic.
In order to subscribe to \f2snoopd\fP, the user must be authorized.
See \f2snoopd\fP(1M) and the \f2NetVisualyzer User's Guide\fP for details.
Executing \f2analyzer\fP as super-user bypasses \f2snoopd\fP.
.P
.SS Options
.P
.TP 16
\-b \f2buffer\fP
Set the capture buffer size to 
.I buffer
packets.
.TP 16
\-c \f2count\fP
Stop capturing after receiving
.I count
packets that match
.IR filter .
.TP 16
\-i \f2interface\fP
Snoop on the network associated with
.IR interface .
By default, \f2analyzer\fP captures packets from a host's primary interface.
.I Interface
may name a network interface, a host that addresses a configured interface,
an interface on a host (\f2host\fP\|:\|\f2ifname\fP) running \f2snoopd\fP,
or a tracefile created by \f2analyzer\fP's \f2Save\fP button or
.IR netsnoop 's
.BR \-o
option.
Invoke
.IR netstat (1M)
with the
.B \-i
option to list configured interfaces and their hostnames.
.TP 16
\-l \f2length\fP
Set the length in bytes of packet data to capture.
By default, \f2analyzer\fP captures all bytes of packet data.
.TP 16
\-p \f2protopts\fP
Set protocol options.
Each option in the comma-separated
.I protopts
list has one of these forms:
.sp .5
.nf
.IR protocol.option
.IR protocol.\f3\s-1no\s0\fPoption
.IR protocol.option=value
.fi
.sp .5
Use \f3\s-1netsnoop \-L\s0\fP \f2protocol\fP to list a protocol's options.
.TP 16
\-q \f2limit\fP
Reserve
.I limit
bytes for packet buffering in the kernel input queue for \f2analyzer\fP.
The default reservation is 60000 bytes.
.TP 16
\-r
Decode received sequence numbers rather than numbers rewritten to count
only matches against
.I filter
and reception gaps.
.TP 16
\-t \f2interval\fP
Capture for
.I interval
seconds.
This option may be used with
.B \-c
to capture at most
.I count
packets in a given
.IR interval .
.TP 16
\-u \f2controls file\fP
Read
.IR controls
.IR file
to be used in the capture window. If this option is not given, the
default file \f2~/.analyzerrc\fP is used if it exist, otherwise
the file \f2/usr/lib/X11/app-defaults/Analyzer\fP is used.
.TP 16
\-y
Consult the NIS name service when translating numbers to names.
By default, \f2analyzer\fP uses local databases such as
.I /etc/hosts
and
.IR /etc/services .
.P
.SS Operation
.P
When \f2analyzer\fP is started, a main window appears followed by the capture
window.  The capture window consists of entries fields to set up capture
parameters.  Captured packets are displayed in the data viewing area of the
main window.  The viewing area is divided into three panes.  The top
pane contains a summary of the captured packets, the middle pane contains
a detailed decoding of the selected packet, and the bottom pane contains
hexadecimal and ASCII dumps of the selected packet.
.P
The menu bar in the main window has four
choices: \f3File\fP, \f3Capture\fP, \f3Tools\fP, and \f3Help\fP.
Use the left mouse button to select and a pulldown menu appears.
The functions include save to snoop file, save to text file,
save current configuration, display capture window, start other
NetVisualyzer tools, display help, and quit.
.P
.SS Resources
.TP 16
\f3controlsFile\fP
Same as \f3\-u\fP command line option.
.TP 16
\f3useyp\fP
Same as \f3\-y\fP command line option.
.TP 16
\f3summaryBackgroundColor\fP
Summary pane background color.
.TP 16
\f3detailBackgroundColor\fP
Detail pane background color.
.TP 16
\f3hexdumpBackgroundColor\fP
Hex Dump pane background color.
.TP 16
\f3summaryForegroundColor\fP
Summary pane foreground color.
.TP 16
\f3detailForegroundColor\fP
Detail pane foreground color.
.TP 16
\f3hexdumpForegroundColor\fP
Hex Dump pane foreground color.
.TP 16
\f3captureBackgroundColor\fP
Capture window background color.
.TP 16
\f3saveTextBackgroundColor\fP
Save to text file window background color.
.P
.ne 20
.SH FILES
.nf
/usr/sbin/analyzer                      Executable
$HOME/.analyzerrc                       Configuration file
/usr/lib/X11/app-defaults/Analyzer      Resource file
/usr/lib/HelpCards/Analyzer.*.help      Help file
/usr/lib/HelpCards/Analyzer.*.helpfile  Text Base Help file
.fi
.SH SEE ALSO
netsnoop(1M), netlook(1M), netgraph(1M), nettop(1M), netvis(1M),
snoopd(1M), snoop(7P), \f2NetVisualyzer User's Guide\fP.
.\".so /pubs/tools/origin.sgi
