calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/browser.1m
'\"macro stdmacro
.TH BROWSER 1M local "Silicon Graphics, Inc."
.SH NAME
browser \- browse the MIB for a node
.SH SYNOPSIS
.B browser
.RB [ \-n\0 \f2node_name\fP]
.RB [ \-c\0 \f2community\fP]
.RB [ \-r\0 \f2retries\fP]
.RB [ \-t\0 \f2timeout_interval\fP]

.SH DESCRIPTION
\f2Browser\fP
is a tool that enables you to browse the SNMP Information Tree for a node.
The SNMP Information Tree is built by reading the MIBs that are present 
in the directory \f3 /usr/lib/netvis/mibs\fP.
The Browser has a MIB compiler that compiles these mib's and generates the
SNMP Information Tree. The User Interface for the Browser is generated
using this Information Tree. Please refer to the NetVisualyzer User's Guide
appendix E for the information on how to add a MIB for the Browser view.
.P
\f3Browser\fP is a query based application that lets you get and set the
attributes of a MIB for a device. The main window "Netvis MIB Browser"
prompts you for the Node that you wish to "Browse" on, the Community
Name that agent is looking for, the timeout interval for each query and
the the number of retries before the Browser times out. By default,
the host name on which the Browser was invoked is put in the text field
next to the Node. Edit this text field and put the name of the node that
you wish to Browse. Also enter the Timeout interval and Number of retries
and the Community Name. The defaults for  Community Name is "public",
Timeout Interval is 5 (seconds) and Number of retries is 3.
.P
The \f3mib-2\fP, \f3enterprises\fP and \f3experimental\fP buttons in the main window
provide the starting points for browsing the SNMP Information Tree. If
a button is "grayed" out, then the corresponding subtree is empty.

The \f3variable\fP button brings up a window which lets you enter the 
OID (Object Identifier ) or the name of the object that you want to
get or set. This window provides a way for browsing on an object or
a part of the MIB that has not been compiled and hence not in the view of the
Browser. For example, if a Cabletron MIB is not included in the
/usr/lib/netvis/mibs directory and you want to look at the object
"deviceMMACType" defined in the Cabletron MIB, you will have to enter
the OID for this object, which is 1.3.6.1.4.1.52.1.2.1.1. You can perform
one of the three operations on that object by pressing the \f3get\fP 
\f3getnext\fP or \f3set\fP button. The value retrieved for the get will be displayed in the
\f3value\fP field. For the \f3set\fP operations, enter the value 
you want to set in the value field and then press the set button.
.P
You can navigate from the main window by pressing the left mouse button
on the \f3Navigate\fP menu and dragging down. Choices are selected as you
move the cursor on top of them, and if they have a rollover menu, it appears
automatically. When there is no rollover menu, it brings you to a subtree that
has the objects that you can perform get or set. In the top portion of this 
window, you see the name of this subtree along with its OID. The scroll
window shows the objects in this subtree. To do a \f3get\fP, go in the \f3Edit\fP
menu and press get. The Browser does a get query on this group of objects
and displays their instances that it got back from the agent.
To \f3set\fP the objects, edit the text fields next to the objects and
go in the \f3Edit\fP menu and press set.

.SS Options
.TP 16
\f3\-n \f2node_name\fP
The name or the IP address of the node that you wish to browse.
.TP 16
\f3\-c \f2community\fP
Community Name.
.TP 16
\f3\-r \f2retries\fP
The number of retries for the query.
.TP 16
\f3\-t \f2timeout_interval\fP
Timeout interval in seconds for each try of the query.
.P
.SS Resources
.TP 16
\f3node\fP
Node whose SNMP information will be browsed.
.TP 16
\f3community\fP
Community string.
.TP 16
\f3retries\fP
Number of retries for each SNMP request.
.TP 16
\f3timeout\fP
Timeout for each SNMP request try.
.P
.SH FILES
.nf
/usr/sbin/browser                     Executable
/usr/lib/netvis/mibs                  MIBs directory
/usr/lib/X11/app-defaults/Browser     Resource file
/usr/lib/HelpCards/Browser.*.help     Help File
/usr/lib/HelpCards/Browser.*.helpfile Text Base Help File
.fi
.SH SEE ALSO
analyzer(1M), netsnoop(1M), netlook(1M), netgraph(1M), nettop(1M),
netvis(1M), snoopd(1M), snoop(7P), snmpd(1M),
\f2NetVisualyzer User's Guide\f1.

.* .SH AUTHOR
.* Charuhas Ghatge
.\"so /pubs/tools/origin.sgi
