calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/netfilters.1m
'\"macro stdmacro
.TH NETFILTERS 1M local "Silicon Graphics, Inc."
.SH NAME
netfilters \- maintain a database of NetVis filters
.SH SYNOPSIS
.B /usr/sbin/netfilters\fP
[\f3\-h\fP]
[\f3\-f\fP \f2filter_file\fP]

.SH DESCRIPTION
\f2Netfilters\fP
gives you a graphical interface to a filter database. You can display,
add, remove, and edit filters through the interface. Additionally each
\f3NetVisualyzer\f1 application that uses filters has a \f2NetFilters\f1
button. When invoked through this button, double clicking on a
\f2Netfilters\f1 filter places that filter into the filter field of the
application that invoked it.
.P
The installation of \f3NetVisualyzer\f1 includes the file
\f2/usr/lib/netvis/Filters\f1 which is an initial set of useful filters.
.P
.SS Display
.P

The main window contains the list of filters each with its corresponding
comment text and a single line for filter and comment entry fields. A
single click on a filter copies it into the entry field for editing. A
double click on a filter copies it into the entry field for editing
already highlighted. The \f3Edit\f1 menu then alllows you to add,
remove, or replace the filter.
.P
When you select a filter containing a variable, those with a token beginning
with a '$',  the \f3Edit\f1 menu also contains a \f3Specify Variable\f1
selection.
.P 
.SS Options
.P
\f3\-h\fP
Print a summary of the available options.
.P
\f3\-f \f2filterFile\fP
What file you want to use as your database.
.P
.SS Resources
.P
.TP 16
\f3filterFile\fP
Same as \f3\-f\fP command line option.
.P
.SH FILES
.nf
/usr/sbin/netfilters			Executable
$HOME/Filters					User Default filter database
/usr/lib/netvis/Filters			System default filter database
/usr/lib/X11/app-defaults/NetFilters	Resource file
/usr/lib/HelpCards/NetFilters.*.help     Help File
/usr/lib/HelpCards/NetFilters.*.helpfile Text Base Help File
.fi
.SH SEE ALSO
analyzer(1M), browser(1M), netgraph(1M),
netlook(1M), nettop(1M), netvis(1M), snoop(7P), snoopd(1M),
\f2NetVisualyzer User's Guide\fP
.* .SH AUTHOR
.* Vic Mitnick
.\"so /pubs/tools/origin.sgi
