calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/netgraph.1m
'\"macro stdmacro
.TH NETGRAPH 1M local "Silicon Graphics, Inc."
.SH NAME
netgraph \- display strip charts of network traffic
.SH SYNOPSIS
.B netgraph
.RB [ \-h]
.RB [ \-M]
.RB [ \-P]
.RB [ \-S]
.RB [ \-arsn ]
.RB [ \-u\0 \f2controls_file\fP]
.RB [ \-i\0 \f2interface\fP]
.RB [ \-t\0 \f2time_interval\fP]
.RB [ \-T\0 \f2time_period\fP]
.RB [ \-U\0 \f2update_time\fP]
.RB [ \-A\0 \f2average_period\fP]
.RB [ \-o\0 \f2history_output_file\fP]
.RB [ \-O]
.RB [ \-l\0 \f2alarm_log_file\fP]
.RB [ \-y]
[\f2filter\fP]

.SH DESCRIPTION
\f2Netgraph\fP
is a graphical tool that draws real-time strip charts of network traffic based
on user-specified traffic filters.
\f2Netgraph\fP can also save its data to a history file, and play it back
at a later time.
.P
The following types of graphs are available for each filter expression:
packets per second, bytes per second,
percentage of total packets, percentage of total bytes,
percentage of network bandwidth, or percentage of a specific number of
bytes or packets per second.
The percentage of network bandwidth means the amount
of traffic as a percentage of the theoretical capacity of the network media.
For each graph, the user can request to be notified via an alarm
when the graph's value goes above or below specified levels.
.P
\f2Netgraph\fP consults a controls file to
determine which strips to display.  The default file is\f2 .netgraph\fP.
If the controls file does not exist, \f2NetGraph\fP displays a default strip,
showing the total number of packets per second.
.P
In order to run \f2NetGraph\fP, the user must be authorized via the
file\f2 /usr/etc/rpc.snoopd.auth\fP.
.SS Options
.TP 16
\f3\-h\fP
Print a summary of the available options.
.TP 16
\f3\-M\fP
Keep the vertical scale of all strips at the maximum value they
attain.  The default is to rescale the strips when \f2NetGraph\fP
deems it appropriate.
.TP 16
\f3\-P\fP
Lock all percentage strips to a vertical scale of 0 to 100.  By
default, these strips scale like all the others.
.TP 16
\f3\-S\fP
Synchronize the vertical scale for all similar strips.  The
default is to scale each chart individually.
.TP 16
\f3\-a\fP
Display a time legend below the strip charts, showing the absolute time of
day of the start and end of the displayed samples.
Note that
\f3\-a\fP, \f3\-r\fP, \f3\-s\fP and \f3\-n\fP
are mutually exclusive options.
If more than one is specified, the last one will take effect.
.TP 16
\f3\-r\fP
Display a time legend below the strip charts, showing the time of the 
samples in the strip charts relative to the current time.
.TP 16
\f3\-s\fP
Display a scrolling time legend below the strip charts, showing the
absolute time of day. This is the default.
.TP 16
\f3\-n\fP
Do not display a time legend below the strip charts.
.TP 16
\f3\-u \f2controls_file\fP
Read \f2controls_file\fP to indicate which strips to
display.  If the file name is ``\-'', then the standard input is read.
If this option is not specified, \f2NetGraph\fP looks for the
file\f2 .netgraphrc\fP in the current directory.
If that doesn't exist, it then looks for \f2.netgraphrc\fP in the user's
home directory.
If neither file exists, \f2NetGraph\fP runs with one default strip,
showing the total packets per second.
For compatability with previous releases, \f3\-D\fP is also accepted in place
of \f3\-f\fP.
.TP 16
\f3\-i \f2interface\fP
Snoop on the network associated with \f2interface\fP.
By default, \f2NetGraph\fP captures packets from the local NetVisualyzer
Display or Data Station's primary network interface.
\f2Interface\fP
may name a network interface or a NetVisualyzer Station
that addresses a configured interface.
Invoke \f2netstat (1M)\fP with the \f3\-i\fP
option to list configured interfaces.
Note that the interface can be on the local NetVisualyzer Station
or a remote NetVisualyzer Station.
Additionally, if \f2interface\fP is the name of a history file,
\f2NetGraph\fP will replay the data in the file rather than displaying
live network traffic.
.TP 16
\f3\-t \f2time_interval\fP
Set the sampling interval, in seconds, to \f2time_interval\fP.
The resolution for this and the other time parameters is one-tenth of
a second; .1, 0.1, 1, and 1.0 are all examples of valid values,
meaning one-tenth of a second, one-tenth of a second,
one second and one second, respectively.
The default is one second.
.TP 16
\f3\-T \f2time_period\fP
Set the period of the strip charts, in seconds, to \f2time_period\fP.
The period is the time it takes for a single reading to move off the chart.
The default is one minute.
.TP 16
\f3\-U \f2update_time\fP
Set the update time, in seconds, to \f2update_time\fP.
This is how often the strip charts will be redrawn to reflect new data.
If a small sampling interval is used, updating at a slower rate (a larger
interval) will help keep the strip charts from falling behind real time.
The default is the same as the time_interval; that is, redraw the graphs
at each sampling interval.
.TP 16
\f3\-A \f2average_period\fP
Use \f2average_period\fP as the length of time over which to calculate
moving averages for each strip chart. If this value is zero, no
averages will be calculated or displayed.
.TP 16
\f3\-o \f2history_output_file\fP
Record \f2NetGraph\fP's data to \f2history_output_file\fP, so that
the historical data can be played back later.
.TP 16
\f3\-O \fP
Output textual data to standard output while \f2NetGraph\fP is running.
Must only be used if \f3\-o\fP is also specified.
.TP 16
\f3\-l \f2alarm_log_file\fP
Log alarm information to \f2alarm_log_file\fP rather than printing it
on standard output.
.TP 16
\f3\-y\fP
Use NIS maps when available.  By default, \f2NetGraph\fP disables
NIS and uses the local files, such as \f1/etc/ethers\fP.  This option,
together with the \f3hostresorder\fP resource,
control how address translation is performed in \f2NetGraph\fP.
.P
A filter expression may also be given to \f2NetGraph\fP on the command line.
This will cause \f2NetGraph\fP to ignore any graph specifications
in the controls file, and just display a single graph showing packets
per second matching the specified filter.
.P
Options may be specified on the command line or in the controls file.
Options on the command line override those in the controls file, if any. 
.SS Controls File
A valid controls file consists of blank lines, comments lines beginning with
the character ``#'',
option lines beginning with ``option'',
and graph specification lines.
.P
Option lines consist of the keyword ``option'',
followed by \f2NetGraph\fP options, in the same
format that is used on the command line.
If used, option lines must all come before any graph specification lines.
.P
Graph specification lines describe the graph strips that will be drawn.
Their format is:
.P
.I filter_expression  [graph_type]  [base_rate]  [color_index]  [graph_style]
.fi
.P
where \f2filter_expression\fP
is a \f2netsnoop\fP(1M) filter expression defining which traffic to graph;
\f2graph_type\fP is one of ``packets'' (the default), ``bytes'',
``%packets'', ``%bytes'', ``%npackets'', ``%nbytes'',
``%ether'', ``%fddi'', or ``%tokenring'';
\f2base_rate\fP is the number of bytes per second or packets per second
to use as a base for a ``percent of N bytes'' or ``percent of N packets''
type of graph;
\f2color_index\fP is a the color map index to use for the strip
(the default is 4, which is blue);
and \f2graph_style\fP is one of ``bar'' (the default), or ``line''.
The filter expression must always be specified, and
\f2base_rate\fP must be specified if and only if
\f2graph_type\fP is ``%npackets'' or ``%nbytes''. 
All other fields of the graph specification are optional.
.P
The controls file may be created with a text editor, or by running
\f2NetGraph\fP and then saving the configuration to a file.
While \f2NetGraph\fP is running, a pull-down menu can be used to change what
strip charts are displayed.

.SS Operation
Once started, \f2NetGraph\fP can run indefinitely without any
user interaction, but there are a number of commands available to
the user via pull-down menus. These include saving the current
configuration, adding or deleting strip charts, editing the specifications
of existing strip charts, and starting other NetVisualyzer tools.

.SS Resources
.TP 16
\f3controlsFile\fP
Same as \f3\-u\fP command line option.
.TP 16
\f3useyp\fP
Same as \f3\-y\fP command line option.
.TP 16
\f3hostresorder\fP
Defines the ordering of address translation services used by \f2NetGraph\fP.
By default, this is set to "local".  The format of this string is a keyword
separated by white space.  Currently accepted keywords are: "nis" for Sun's
network information service, "bind" for BIND, and "local" for local files such
as /etc/hosts.  See \f2resolver\fP(4) for more information on the format and
operation.
.TP 16
\f3editControlBackgroundColor\fP
Background color of the Edit Control Panel.
.TP 16
\f3paramControlBackgroundColor\fP
Background color of the Parameters Control Panel.
.TP 16
\f3alarmColor\fP
Background color of a graph strip when an alarm has gone off.
.TP 16
\f3selectColor\fP
Background color for a graph strip that is selected.
.TP 16
\f3stripBackgroundIndexColor\fP
GL colormap index for the background color of the graphs themselves.
.TP 16
\f3stripScaleIndexColor\fP
GL colormap index for the horizontal scale lines in the graphs.
.TP 16
\f3scrollingTimeIndexColor\fP
GL colormap index for the scrolling time legend.

.SH BUGS
The numbers will get less accurate if the total number of samples (the period
divided by the sampling interval times the number of strips) becomes too large.
History playback is slow if the history file is very large.
.SH FILES
.nf
$HOME/.netgraphrc       User controls file
/usr/lib/HelpCards/NetGraph.*.help  Help file
/usr/sbin/netgraph      Executable
.fi
.SH SEE ALSO
analyzer(1M), netlook(1M), nettop(1M), netvis(1M),
snoopd(1M), snoop(7P), \f2NetVisualyzer User's Guide\f1.

.* .SH AUTHOR
.* Victor Mitnick
.\"so /pubs/tools/origin.sgi
