calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/netlook.1m
'\"macro stdmacro
.TH NETLOOK 1M local "Silicon Graphics, Inc."
.SH NAME
netlook \- graphically display network traffic
.SH SYNOPSIS
\f3netlook\fP [\f3\-f\fP \f2networksfile\fP] [\f3\-i\fP \f2datastation\fP]
[\f3\-u\fP \f2controlsfile\fP] [\f3\-y\fP] [\f2filter\fP]
.SH DESCRIPTION
\f2NetLook\fP provides visual feedback on the state of the network.  It
dynamically builds a network map as it observes network traffic and connects
nodes that are communicating with lines whose color represents a metric of the
amount of traffic between those nodes.
.P
\f2NetLook\fP uses \f2snoopd\fP(1M) to capture network traffic.  In order
to subscribe to \f2snoopd\fP, the user must be authorized.  See
\f2snoopd\fP(1M) and the \f2NetVisualyzer User's Guide\fP for details.
.P
.SS NetLook Files
.P
\f2NetLook\fP saves the network configuration to data files.  By default,
the file \f2$HOME/network.data\fP is used.  This file defines the networks
and nodes that \f2NetLook\fP displays in the viewing area of its main
window and is read when \f2NetLook\fP is started.
.P
\f2NetLook\fP also saves the state of the user interface control panels.
By default, the file \f2$HOME/.netlookrc\fP is used.  This file is
read on startup to configure the user interface to the saved state.
.P
.SS Command Line Options
.TP 18
\f3\-f\fP \f2networksfile\fP
On startup, read from the NetLook Network Data File \f2networksfile\fP.
By default, the file \f2$HOME/network.data\fP is used.
.TP 18
\f3\-i\fP \f2datastation\fP
On startup, start capturing data from \f2datastation\fP.  Data Stations
listed in controls file will not be started when this option is used.
.TP 18
\f3\-u\fP \f2controlsfile\fP
On startup, read from the NetLook Controls File \f2controlsfile\fP.
By default, the file \f2$HOME/.netlookrc\fP is used.
.TP 18
\f3\-y\fP
Use NIS maps when available.  By default, \f2NetLook\fP disables
NIS and uses the local files, such as \f2/etc/ethers\fP.  This option,
together with the \f3hostresorder\fP resource,
control how address translation is performed in \f2NetLook\fP.
.P
A filter expression may also be given to \f2NetLook\fP on the command line.
Filter expressions are used to limit the captured network packets only to
those which match the expression.
.P
.SS Resources
.TP 18
\f3networksFile\fP
Same as \f3\-f\fP command line option.
.TP 18
\f3controlsFile\fP
Same as \f3\-u\fP command line option.
.TP 18
\f3useyp\fP
Same as \f3\-y\fP command line option.
.TP 18
\f3buffer\fP
Specify the number of packets for \f2snoopd\fP to buffer and compress into
a single reply to \f2NetLook\fP.  In most cases, the default of 60 packets
should be used.  If monitoring is being performed over a low speed SLIP line,
then a smaller value may provide better response.
.TP 18
\f3interval\fP
Specify the maximum time in tenths of a second for \f2snoopd\fP to wait
before forwarding an incomplete data block back to \f2NetLook\fP.
In most cases, the default of 50 (5 seconds) should be used.
.TP 18
\f3hostresorder\fP
Defines the ordering of address translation services used by \f2NetLook\fP.
By default, this is set to "local".  The format of this string is a keyword
separated by white space.  Currently accepted keywords are: "nis" for Sun's
network information service, "bind" for BIND, and "local" for local files such
as /etc/hosts.  See \f2resolver\fP(4) for more information on the format and
operation.
.TP 18
\f3sendDetectEvents\fP
Controls if \f2NetLook\fP sends events for all new nodes and new networks
detected.  By default, this is set to "False" due to the decrease in
performance when many new nodes are being detected.
.TP 18
\f3pingCommand\fP
Command to be run for ping action.
.TP 18
\f3traceRouteCommand\fP
Command to be run for trace route action.
.TP 18
\f3mapBackgroundColor\fP
Color index value to use in the main window for the background of the viewing
area.
.TP 18
\f3viewboxColor\fP
Color index value to use in the Map Control Panel for the box defining the
viewing area.
.TP 18
\f3selectColor\fP
Color index value to use for selected objects.
.TP 18
\f3adjustColor\fP
Color index value to use for objects the are being adjusted or moved.
.TP 18
\f3activeNetworkColor\fP
Color index value to use for networks that have traffic.
.TP 18
\f3inactiveNetworkColor\fP
Color index value to use for networks that do not have traffic.
.TP 18
\f3standardNodeColor\fP
Color index value to use for standard nodes.
.TP 18
\f3activeDataStationColor\fP
Color index value to use for nodes which are Data Stations that are snooping
traffic for this instance of \f2NetLook\fP.
.TP 18
\f3NISMasterColor\fP
Color index value to use for nodes which are NIS master servers.
.TP 18
\f3NISSlaveColor\fP
Color index value to use for nodes which are NIS slave servers.
.TP 18
\f3gatewayColor\fP
Color index value to use for nodes which are gateways to other networks.
.P
.SH FILES
.nf
/usr/NetVis/bin/netlook			Executable
/usr/NetVis/app-defaults/NetLook	Resource file
/usr/NetVis/HelpCards/netlook.*.help	Help cards
$HOME/.netlookrc			Default NetLook Controls File
$HOME/network.data			Default NetLook Network Data File
.fi
.SH SEE ALSO
analyzer(1M), netgraph(1M), nettop(1M), netvis(1M), snoop(7P), snoopd(1M),
\f2NetVisualyzer User's Guide\fP
.* .SH AUTHOR
.* Ronald Jacoby
.\"so /pubs/tools/origin.sgi
