calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/nettop.1m
'\"macro stdmacro
.TH NETTOP 1M local "Silicon Graphics, Inc."
.SH NAME
nettop \- display a three-dimensional graph of network traffic
.SH SYNOPSIS
\f3/usr/sbin/nettop\fP
[\f3\-h\fP]
[\f3\-u\fP \f2controlsfile \fP]
[\f3\-i\fP \f2interface \fP]
[\f3\-t\fP \f2data_update_time \fP]
[\f3\-T\fP \f2node_update_time \fP]
[\f3\-s\fP \f2number_sources \fP]
[\f3\-d\fP \f2number_destinations\fP]
[\f3\-I\fP \f2interpolation_percentage \fP]
[\f3\-S\fP \f2scale_recalc_time \fP]
[\f3\-y\fP] 
[\f3\-O\fP] 
[\f2filter\fP]

.SH DESCRIPTION
\f2Nettop\fP
presents 3D graphs of network traffic.
It can show the top sources and destinations of traffic on the network,
or it can show the sources and destinations of your choice. It can also 
show the traffic on nodes, each with its filter.
.P
\f2NetTop\fP uses \f2snoopd\fP to capture network traffic.
In order to subscribe to \f2snoopd\fP, the user must be authorized.
See \f2snoopd\fP(1M) and the \f2NetVisualyzer User's Guide\fP for details.
.P
.SS Options
.P
.TP 16
\f3\-h \fP
Produce a summary of the available options.
.TP 16
\f3\-u \f2controlsfile\fP
On startup, read from the NetTop Controls File \f2controlsfile\fP.
By default, the file \f2$HOME/.nettoprc\fP is used.
.TP 16
\f3\-i \f2interface\fP
Snoop on the network associated with
.IR interface.
By default, \f2NetTop\fP snoops on the hosts's primary interface.
.I Interface
may name a network interface, a host that addresses a configured interface or
an interface on a host (\f2host\fP:\|\f2ifname\fP) running \f2snoopd\fP. 
Invoke
.IR netstat(1M)
with the 
.B \-i
option to list configured interfaces and their hostnames.
.TP 16
\f3\-t \f2data_update_time\fP
Set the time interval at which the traffic values are updated. This interval
is set to
.I data_update_time
seconds.
.TP 16
\f3\-T \f2node_update_time
Recalculate the set of busiest nodes every
.I node_update_time
seconds.
.TP 16
\f3\-d \f2number_destinations\fP
The top
.I number_destinations
destinations you want to see the traffic to.
.TP 16
\f3\-s \f2number_sources\fP
The top
.I number_sources
sources you want to see the traffic from.
.TP 16
\f3\-I \f2interpolation_percentage\fP
.TP 16
\f3\-S \f2scale_recalc_time\fP
Reduce the maximum scale after 
.I scale_recalc_time
seconds.
.TP 16
\f3\-y\fP
Use NIS maps when available.  By default, \f2NetTop\fP disables
NIS and uses the local files, such as \f2/etc/ethers\fP.  This option,
together with the \f3hostresorder\fP resource,
control how address translation is performed in \f2NetTop\fP.
.TP 16
\f3\-O\fP
Output the list of busiest nodes as it is calculated, to standard output.
If you are only looking at specific nodes in \f2NetTop\fP,
this option will have no effect.
.P
A filter expression may also be given to \f2NetTop\fP on the command line.
Filter expressions are used to limit the captured network packets only to
those which match the expression.
.P
.SS Resources
.P
.TP 16
\f3controlsFile\fP
Same as \f3\-u\fP command line option.
.TP 16
\f3useyp\fP
Same as \f3\-y\fP command line option.
.TP 16
\f3hostresorder\fP
Defines the ordering of address translation services used by \f2NetTop\fP.
By default, this is set to "local".  The format of this string is a keyword
separated by white space.  Currently accepted keywords are: "nis" for Sun's
network information service, "bind" for BIND, and "local" for local files such
as /etc/hosts.  See \f2resolver\fP(4) for more information on the format and
operation.
.TP 16
\f3colormap\fP
Force the use of colormap mode instead of rgb mode. Normally,
\f2NetTop\fP will use rgb mode where it can, on machines with
enough bitplanes, or with starter graphics. If this resource
is set to true, colormap mode will be used regardless of the
graphics available on the display station.
.TP 16
\f3nodeControlBackgroundColor\fP
X color to use for the background of the node control window.
.TP 16
\f3trafficControlBackgroundColor\fP
X color to use for the background of the traffic control window.
.TP 16
\f3mainBackgroundRGBColor\fP
RGB color (3bytes, 1 byte each for blue, green and red) to use for
the background in the main window.
The resources whose names end in "RGBColor" are used if \f2NetTop\fP
is running in RGB mode.
.TP 16
\f3baseRGBColor\fP
RGB color to use for the box that is the base of the graph.
.TP 16
\f3labelRGBColor\fP
RGB color to use for labeling the horizontal axes of the graph.
("Sources", "Destinations", "Nodes", and "Filters.")
.TP 16
\f3selectRGBColor\fP
RGB color to use for selected objects.
.TP 16
\f3nameRGBColor\fP
RGB color to use for the names of standard nodes and filters.
.TP 16
\f3nameErrorRGBColor\fP
RGB color to use for the names of nodes/filters that have errors.
.TP 16
\f3nameLockedRGBColor\fP
RGB color to use for the names of nodes/filters that are locked.
.TP 16
\f3scaleRGBColor\fP
RGB color to use for the vertical scale.
.TP 16
\f3titleRGBColor\fP
RGB color to use for the graph title.
.TP 16
\f3edgeRGBColor\fP
RGB color to use for the edges of the towers in the graph.
.TP 16
\f3mainBackgroundIndexColor\fP
Color index value to use for the background in the main window.
The resources whose names end in "IndexColor" are used if \f2NetTop\fP
is running in colormap mode.
.TP 16
\f3baseIndexColor\fP
Color index value to use for the box that is the base of the graph.
.TP 16
\f3labelIndexColor\fP
Color index value to use for labeling the horizontal axes of the graph.
.TP 16
\f3selectIndexColor\fP
Color index value to use for selected objects.
.TP 16
\f3nameIndexColor\fP
Color index value to use for the names of standard nodes and filters.
.TP 16
\f3nameErrorIndexColor\fP
Color index value to use for the names of nodes/filters that have errors.
.TP 16
\f3nameLockedIndexColor\fP
Color index value to use for the names of nodes/filters that are locked.
.TP 16
\f3scaleIndexColor\fP
Color index value to use for the vertical scale.
.TP 16
\f3titleIndexColor\fP
Color index value to use for the graph title.
.TP 16
\f3edgeIndexColor\fP
Color index value to use for for the edges of the towers in the graph.
.TP 16
\f3totalTotalIndexColor\fP
Color index value to use for tower representing total traffic.
.TP 16
\f3otherOtherIndexColor\fP
Color index value to use for the tower representing traffic between
"other" sources and "other" destinations.
.TP 16
\f3totalAnyIndexColor\fP
Color index value to use for the towers representing total traffic
from each source and to each destination.
.TP 16
\f3otherAnyIndexColor\fP
Color index value to use for the towers representing "other"traffic
from each source and to each destination.
.TP 16
\f3anyAnyIndexColor\fP
Color index value to use for the towers representing traffic between
any source and any destination (i.e. not "total" or "other).


.SH FILES
.nf
$HOME/.nettoprc		                Default nettop data file
/usr/sbin/nettop		        Executable
/usr/NetVis/app-defaults/NetTop		Resource file
/usr/lib/HelpCards/NetTop.general.help  Help File
/usr/lib/HelpCards/NetTop.node.help     Help File
/usr/lib/HelpCards/NetTop.traffic.help  Help File
.fi
.SH SEE ALSO
netfilters(1M), netgraph(1M),
netlook(1M),snoop(7P), snoopd(1M),
\f2NetVisualyzer User's Guide\fP
.* .SH AUTHOR
.* Charuhas  Ghatge
.\"so /pubs/tools/origin.sgi
