calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/display/nveventd.1m
'\"macro stdmacro
.TH NVEVENTD 1M local "Silicon Graphics, Inc."
.SH NAME
nveventd \- NetVisualyzer event daemon
.SH SYNOPSIS
.B /usr/etc/nveventd
.RB [ \-d [input] 
.RB  [output]]
.RB [ \-F\0 \f2logFileName\fP]
.RB [ \-n\0 \f2numberOfLogFiles\fP]
.RB [ \-s\0 \f2logFileSize\fP]
.SH DESCRIPTION
.I Nveventd
is a
server that receives events from NetVisualyzer applications. It logs
events in the \f2logFileName\fP and performs other functions if
configured to do so. 
It is invoked on demand by
.IR ttsession(1)
and logs diagnostics to
.IR syslog (3B).
.PP

.I Nveventd
uses the
.I /usr/lib/netvis/eventcfgrc
file to determine how to handle incoming events and to tell the
NetVisualyzer applications which events 
.B not
to generate. The file also optionally gives
.I nveventd
parameters for event logging.
.PP
Event option entries have the form:
.Ex 2
<option> <option argument> <option argument> ...
# option  eventID   alrmLvl noSend   actId   dstID
event	    30		1	0	0	0
.Ee
.PP
In the above example
.I nveventd
would assign alarm level 1 or
.B WARNING
to event 30 or
.B rate threshold exceeded.
It would also tell the NetVisualyzer applications that generate this
event to send it. And 
.I nveventd
would take no further actions nor forward the event to any other
applications.
.PP
Logging option entries have the form:
.Ex 2
#option	   logFileSize  numberOfLogFiles	[logName]
logging     5000	     5		    /usr/etc/EVENTLOG
.Ee
.PP
The above line tells
.I nveventd
to put 5000 records in each log file, to use 5 log files, and to use
"/usr/etc/EVENTLOG" as the name of the current log file. The logName is
optional. If missing, the default log file name is used.
.SS Options
.TP 16
\-d  [\f2input\fP] [\f2output\fP]
Dump incoming event messages and outgoing event messages. There can be two \-d
arguments, one for
.I input
and one for 
.I output.
The messages are dumped to
.I stderr.
These options should only be used for debugging purposes. 
.TP 16
\-F \f2logFileName\fP
Use this name as the base name of the event log file. It should be a
fully qualified pathname. The default 
.I logFileName
is
.I /usr/lib/netvis/eventlog
.TP 16
\-n \f2numberOfLogFiles\fP
Set the number of log files to use. 
.I Nveventd
keeps circular logs. When a log file is full it is saved to another
file and a new log file of
.I logFileName
is created. The saved log file is named
.I logFileName.n
where n is a number greater than or equal to one (1) and less than or
equal to nine (9). Therefore there can be up to ten (10) such files.
The default
.I numberOfLogFiles
is two (2).
.TP 16
\-s \f2logFileSize\fP
Set the number of event records in the log files.
The default 
.I logFileSize
is two thousand (2000) records.
.PP
These options override those found in the
.I eventcfgrc
file.
.SS Log record format
Log file records have the following format:
.Exq 2
<timestamp> <event type> <application>[<pid>] <user>(<uid>) ...
<alarm level> <interface>(interface address) <filter>...
<NEWLINE><TAB> <event-specific values> <NEWLINE> <TAB>...
<other application-specific information>
.Ee
.PP
If a field is not specified, it is NULL in the 
.I eventlog.
.SH CAVEATS
In the initial release
.I nveventd
only logs events. It takes no further actions.
.PP
.I Nveventd
is sensitive to the format of the 
.I eventcfgrc 
file. Edit it carefully when making changes. Read the comments in the
file thoroughly.
.SH FILES
.nf
/etc/tt/types.xdr		ToolTalk types database (for ttsession)
/usr/lib/netvis/eventcfgrc	nveventd configuration file
/usr/lib/netvis/nveventd_types  nveventd ToolTalk Types file
/usr/lib/netvis/ttEventdOps.h   include file for nveventd_types
.SH SEE ALSO
analyzer(1M), netcollect(1M), inetd(1M), netgraph(1M), netlook(1M),
netsnoop(1M), nettop(1M), snoop(7P), ttsession(1), 
\f2ToolTalk Setup and Administration Guide\fP, \f2NetVisualyzer User's Guide\fP
.\".SH AUTHOR
.\"Paul Robins
.\".so /pubs/tools/origin.sgi
