calmsacibis995/irix-6517-src/irix/cmd/stress/Regression/X/xcrash/xcrash.man
'\"     @(#)     xcrash/xcrash/xcrash.man     Ver. 1.1        Rel. PVTS 3.2        (93/01/13)
.TH XCRASH 1 "Release 5" "X Version 11"
.SH NAME
xcrash \- attempt to crash the X server with legal X calls
.SH SYNOPSIS
.B xcrash
[-option ...]
.SH OPTIONS
.TP 8
.B \-display \fIdisplay\fB
specify the display to use; see \fIX(1)\fP.
.TP 8
.B \-input \fIfile\fP
This option specifies the file to be read in as input.  See below.
.TP 8
.B \-nasty
Generate far out of bounds x and y values for test cases.
.TP 8
.B \-quiet
This option disallows the display of system messages to
stderr.
.TP 8
.B \-seed \fInumber\fP
Number to use for seeding the random number generator srand().  This
defaults to the current time in seconds.
.TP 8
.B \-tests \fInumber\fP
This option specifies the number of tests to run.
The default is 200.
.TP 8
.B \-verbose
This option causes the program to display everything its
doing to stdout, allowing playback if this file is
saved and read back in with the -infile parameter.
.SH DESCRIPTION
.I Xcrash
runs randomized tests in an attempt to crash the X server.
The program can generate a set of random tests or play back tests
previously recorded.  If standard output of the program is redirected to
a file and output is set to verbose (with the -v parameter), the output file
created can be read in as input by using the -infile parameter on a
subsequent run.

For example:
.de SX
.ne 5
.in +.5i
.if n .sp 1
.if t .sp .5
.nf
..
.de EX
.fi
.in -.5i
.if n .sp 1
.if t .sp .5
..
.SX
xcrash -v -tests 10 > out
xcrash -infile out
.EX
records 10 random tests and plays them back.

.SH "SEE ALSO"
X(1)
.SH BUGS
The normal X conventions of allowing -bg, -fg and -geometry on
the command line do not work.

Resizing the window while the test is running does not work well with the
tracefile.  The window size changes are not recorded so the playback
will not be exact.

If you find more, let me know.

.SH COPYRIGHT
Copyright 1992, HaL Computer Systems.

.br
See the HaL copyright notice for a full statement of rights and permissions.
