calmsacibis995/irix-6517-src/eoe/man/man1/at.1
.nr X
.if \nX=0 .ds x} at 1 "User Environment Utilities" "\&"
.TH \*(x}
.tr ~
.SH NAME
at, batch \- execute commands at a later time
.SH SYNOPSIS
.nf
\f3at\f1 [\-m] [\-f \f2file\f1] [\-q \f2queuename\f1] \-t \f2time\f1 
\f3at\f1 [\-m] [\-f \f2file\f1] [\-q \f2queuename\f1] \f2timespec\f1 
\f3at\f1 \f3\-r\f1 \f2at_job_id ...\f1
\f3at\f1 \f3\-l\f1 \f3\-q\f1 \f2queuename\f1
\f3at\f1 \f3\-l\f1 [\f2at_job_id ...\f1]
\f3batch\f1
.fi
.SH DESCRIPTION
\f2at\fP and \f2batch\fP read commands from standard input to be
executed at a later time.
\f2at\fP allows you to specify when the commands should be executed,
while
jobs queued with \f2batch\fP will execute
when system load level permits.
The \f2at\fP utility reads commands from standard input and 
groups them together as an \f2at-job\fP, to be executed at a later time.
.P
The at-job will be executed in a separate invocation of the shell, 
running in a separate process group with no controlling terminal, 
except that of the environment variables, current working directory, 
file creation mask, and other implementation-dependent execution-line 
attributes in effect when the \f2at\fP
utility is executed wil be retained and used when the at-job is executed.
The shell umask and ulimit are retained when the commands are executed.
Open file descriptors, traps, and priority are lost.
.P
When the at-job is submitted, the \f2at_job_id\f1 and scheduled time 
are written to standard error. The \f2at_job_id\f1 is an identifier 
that will be a string consisting solely of alphanumeric characters
and the period character. 
The \f2at_job_id\f1 is assigned by the system when the job is scheduled 
such that it uniquely identifies a particular job.
.P
User notification and the processing of the job's standard
output and standard error are described under the \f3\-m\f1 option.
.P
If the file
\f3/usr/lib/cron/at.allow\f1. 
exists, only users whose names appear in the file are permitted to use
\f2at\fP.
This restriction applies to all users, including root.
If that file does not exist, the file \f3/usr/lib/cron/at.deny\f1 
is checked to determine if the user should be denied access to \f2at\fP. 
If neither file exists, only a process with the appropriate privileges 
is allowed to submit a job. 
If only \f3at.deny\f1 exists and is empty, global usage is permitted.
The \f3at.allow\f1 and \f3at.deny\f1 files consist of one user name per line.
These files can only be modified by the superuser.

.SH OPTIONS

The \f2at\fP utility supports the \f3XBD\f1 specification, 
\f3Section 10.2, Utility Syntax Guidelines\f1.
.P
.I at
may be used with the following options:
.TP
.B \-f file
Specify the pathname of a file to be used as the source 
of the at-job, instead of standard input.
.TP
.B \-l
(The letter ell.) Report all jobs scheduled for the invoking user
if no \f2at_job_id\f1 operands are specified. If \f2at_job_ids\f1
are specified, report only information on these jobs. 
The output will be written to standard output.
.TP
.B \-m
Send mail to the invoking user after the at-job has run, 
announcing its completion. 
Standard output and standard error produced by the at-job 
will be mailed to the user as well, unless directed elsewhere.
Mail will be sent even if the job produces no output.
.P
.RS 5
If \f3\-m\f1 is not used, the job's standard output and standard error 
will be provided to the user by means of mail, unless they are redirected 
elsewhere;
if there is no such output to provide, the implementation needs not notify the user of the job's completion.
.RE
.TP
.B \-q queuename
Specify in which queue to schedule a job for submission. 
When used with the \f3\-l\f1 option, limit the search to that particular queue.
By default, at-jobs will be scheduled in queue \f3a\f1.
In contrast, queue \f3b\f1 is reserved for batch jobs. 
(see the \f2batch\fP utility.)
The meanings of all other \f2queuenames\fP are implementation-dependent.
.TP
.B \-r
Remove the jobs with the specified \f2at_job_ids\f1 that were previously 
scheduled with \f2at\f1.
You can only remove your own jobs unless you are the superuser.
.TP
.B \-t time
Submit the job to be run at the time specified by the \f2time\f1 option
argument, which must have the format as specified by the \f2touch\f1 utility.
.P
All jobs are placed on a specific queue.
By default,
.I at
jobs go on queue ``a'',
.I batch
jobs go on queue ``b''.
Additional queues may be created by altering the
.B /usr/lib/cron/queuedefs
file.
.IR queuedefs (4)
defines the format for that file.
Note that queue names must be lower case letters.
.P

.SH OPERANDS
The following operands are supported:
.TP
.I at_job_id
The name reported by a previous invocation of the \f2at\f1 utility
at the time the job was scheduled.
.TP
.I timespec
Submit the job to be run at the date and time specified. All of the
\f2timespec\f1 operands are interpreted as if they were separated 
by space characters and concatenated, and are parsed as described 
in the grammar at the end of this section.
The date and time are interpreted as being the timezone of the user (as determined by the \f2TZ\f1 variable), unless a timezone name appears as 
part of \f2time\f1 below.
.P
.RS 5
In the POSIX locale, the following describes the three parts of the time 
specification string. 
All of the values from the LC_TIME categories in the POSIX locale 
are recognized in a case-insensitive manner.
.TP 5
.I time
The \f2time\f1 can be specified as one, two, or four digits. One- and two-digit numbers are taken to be hours, four-digit numbers to be hours and minutes.
The time can alternatively be specified as two numbers separated by a colon, meaning \f2hour:minute\f1. 
An AM/PM indication (one of the values from the am_pm keywords in the LC_TIME locale category) can follow the time;
otherwise, a 24-hour clock time is understood. 
A timezone name can also follow to further qualify the time. 
The acceptable timezone names are implementation-dependent, 
except that they will be case-insensitive and the string utc is 
supported to indicate the time in Coordinated Universal Time.
The suffix
.B zulu
may be used to indicate GMT.

The \f2time\f1 field can also be one of the following tokens in the POSIX locale:
.RS 5
.TP 5
.B midnight
Indicates the time 12:00 am (00:00).
.TP 5
.B noon
Indicates the time 12:00 pm.
.TP 5
.B now
Indicates the current day and time. Invoking \f2at now\f1 will submit
an at-job for potentially immediate execution (that is, subject only to unspecified scheduling delays).
.RE
.TP 5
.I date
An optional \f2date\f1 can be specified as either a month name 
(one of the values from the \f3mon\f1 or \f3abmon\f1 keywords in the 
LC_TIME locale category) followed by a day number (and possibly year number 
preceded by a comma, two digit years 00-37 and 70-99 represent 2000-2037 and
1970-1999 respectively, all years inclusive) or a day of the week (one of the 
values from the \f3day\f1 or \f3abday\f1 keywords in the LC_TIME locale category). 
Two special days are recognized in the POSIX locale:
.RS 5
.TP 5
.B today
Indicates the current day.
.TP 5
.B tomorrow
Indicates the day following the current day.
.P
If no
.I date
is given,
.B today
is assumed if the given hour is greater than the current hour
and
.B tomorrow
is assumed if it is less.
If the given month is less than the current month (and no year is
given), next year is assumed.
.RE
.P
.TP 5
.I increment
The optional
.I increment
is simply
a number preceded by a plus sign (+) and
suffixed by one of the following:
.BR minutes ,
.BR hours ,
.BR days ,
.BR weeks ,
.BR months ,
or
.BR years .
(The singular form is also accepted.)
The keyword next is equivalent to an increment number of +1. 
For example, the following are equivalent command:
.P
.RS 10
at 2pm + 1 week
.br
at 2pm next week
.RE
.br
.ne 6
.P
Thus legitimate commands include:
.P
.RS 10
at 0815am Jan 24
.br
at 8:15am Jan 24
.br
at now + 1 day
.br
at 5 pm Friday
.RE
.RE

The following grammar describes the precise format of \f2timespec\f1
in the POSIX locale. 
This formal syntax takes precedence over the preceding text syntax description. When used in a \f2timespec\f1, white space also delimits tokens.

.br
%token hr24clock_hr_min
.br
%token hr24clock_hour
.br
/* 
.br
A hr24clock_hr_min is a one, two or four digit number. 
A one or two digit number constitutes a hr24clock_hour. 
A hr24clock_hour may be any of the single digits '0' - '9', 
or may be double digits, ranging from "00" - "23". 
If a hr24clock_hr_min is a four digit number, 
the first two digits must be valid hr24clock_hour, 
while the last two represent the number of minutes, from "00" - "59".
.br
*/

.br
%token wallclock_hr_min
.br
%token wallclock_hour
.br
/* 
.br
A wallclock_hr_min is a one, two or four digit number. 
A one or two digit number constitutes a wallclock_hour. 
A wallclock_hour may be any of the single digits '1' - '9', 
or may be double digits, ranging from "01" - "12". 
If a wallclock_hr_min is a four digit number, 
the first two digits must be valid wallclock_hour, 
while the last two represent the number of minutes, from "00" - "59".
.br
*/

%token minute
.br
/*
.br
A minute is a one or two digit number whose values can be '0' - '9'
or "00" - "59".
.br
*/

%token day_number
.br
/*
.br
A day_number is a number in the range appropriate for the particular month 
and year specified by month_name and year_number, respectively.
If no year_number is given, the current year is assumed if the given date
and time are later this year. If no year_number is given and the date
and time have already occured this year and the month is not the current month, next year is the assumed year.
.br
*/

%token year_number
.br
/*
.br
A year_number is a four digit number representing the year A.D., 
in which the at_job is to be run
.br
*/

%token inc_number
.br
/*
.br
The inc_number is the number of times the succeeding increment period
is to be added to the specified date and time.
.br
*/

%token timezone_name
.br
/*
.br
The name of an optional timezone suffix to the time field, in an implementation dependent format.
.br
*/

%token month_name
.br
/*
.br
One of the values from the "mon" or "abmon" keywords in the LC_TIME locale
category.
.br
*/

%token day_of_week
.br
/*
.br
One of the values from the "day" or "abday" keywords in the LC_TIME locale
category.
.br
*/

%token am_pm
.br
/*
.br
One of the values from the "am_pm" keyword in the LC_TIME locale category.
.br
*/

%start timespec
.br
%%
.br
timespec   : time
.RS 11
| time date
.br
| time increment
.br
| time date increment
.br
| nowspec
.br
;
.RE

nowspec    : "now"
.RS 11
| "now" increment
.br
;
.RE

time       : hr24clock_hr_min
.RS 11
| hr24clock_hr_min timezone_name
.br
| hr24clock_hour ":" minute
.br
| hr24clock_hour ":" minute timezone_name
.br
| wallclock_hr_min am_pm
.br
| wallclock_hr_min am_pm timezone_name
.br
| wallclock_hour ":" minute am_pm
.br
| wallclock_hour ":" minute am_pm timezone_name
.br
| "noon"
.br
| "midnight"
.br
;
.RE

date       : month_name day_number
.RS 11
| month_name day_number "," year_number
.br
| day_of_week
.br
| "today"
.br
| "tomorrow"
.br
;
.RE

increment  : "+" inc_number inc_period
.RS 11
| "next" inc_period
.br
;
.RE

inc_period : "minute" | "minutes"
.RS 11
| "hour" | "hours"
.br
| "day" | "days"
.br
| "week" | "weeks"
.br
| "month" | "months"
.br
| "year" | "years"
.br
;
.RE


.P
.I batch
submits a batch job.
It is almost equivalent to \f2at now\f1, but not quite.
For one, it goes into a different queue.
.P
.SH STDIN
The standard input must be a text file consisting of commands acceptable to the shell command language. The standard input will only be used if no \f2\-f\f1 
.I file
option is specified.
.SH ENVIRONMENT VARIABLES
The following environment variables affect the execution of
\f4at\fP:
.TP
\f4LANG\fP
provide a default value for the internationalization variables that are unset or null.
If
.I LANG\^
is unset or null the corresponding value from the implementation-specific
default locale will be used. If any of the internationalization variables
contains an invalid setting, the utility will behave as if
none of the variables had been defined.
.TP
\f4LC_ALL\fP
if set to a non-empty string value, override the values of all the
other internationalization variables.
.TP
\f4LC_CTYPE\fP
determine the locale for the interpretation of sequences of bytes of
text data as characters (for example, single - as opposed to multi-byte -
characters in arguments).
.TP
\f4LC_MESSAGES\fP
determine the locale that should be used to affect the format and 
contents of diagnostic messages written to standard error.
.TP
\f4NLSPATH\fP
determine the location of message catalogs for the processing of \f4LC_MESSAGES\fP.
.TP
\f4LC_TIME\fP
determine the format and contents of date and time strings written by
.I at\^
.TP
\f4SHELL\fP
determine a name of a command interpreter to be used to invoke the at-job. 
If the variable is unset or null, \f2sh\f1 will be used. 
If it is set to a value other than a name for \f2sh\f1, the implementation 
will do one of the following: use that shell; use \f2sh\f1; 
use the login shell from the user database; 
or any of the preceding accompanied by a warning diagnostic about 
which was chosen.
.TP
\f4TZ\fP
determine the time zone. The job will be subnmitted for execution at the time specified by \f2timespec\f1 or 
.B \-t
\f2time\f1 relative to the timezone specified by the TZ variable.
If \f2timespec\f1 specifies a timezone, it will override \f2TZ\f1.
If \f2timespec\f1 does not specify a timezone and \f2TZ\f1 is unset or null, an unspecified
default timezone will be used.
.SH STDOUT
When standard input is a terminal, prompts of unspecified format for each 
line of the user input described in 
.B STDIN
may be written to standard output.
.P
In the POSIX locale, the following will be written to the standard output 
for each job when jobs are listed in response to the \f3\-l\f1 option:
.P
.RS 10
"%s\\t%s\\n"\f2, at_job_id, <date>\f1
.RE
.P
where \f2<date>\f1 is equivalent in format to the output of:
.P
.RS 10
date +"%a %b %e %T %Y"
.RE
.P
The date and time written will be adjusted so that they appear 
in the timezone of the user (as determined by the \f2TZ\f1 variable).

.SH STDERR
The following will be written to standard error when a job has been 
successfully submitted:
.P
.RS 10
"job %s at %s\\n"\f2, at_job_id, <date>\f1
.RE
.P
where \f2<date>\f1 has the same format as is described in 
.B STDOUT
. Neither this, nor warning messages concerning the selection of the command 
interpreter, are considered a diagnostic that changes the exit status.
.P
Diagnostic messages, if any, are written to standard error.

.SH EXIT STATUS
The following exit values are returned:
.br
\f40\ \ \fP
successful completion
.br
\f4>0\ \fP
an error occured
.SH CONSEQUENCES OF ERRORS
The job will not be scheduled, removed or listed.
.SH EXAMPLES
The \f2at\fP and \f2batch\fP commands read
from standard input the commands to be executed
at a later time.
.P
1. This sequence can be used at a terminal:
.P
.RS 10
at -m 0730 tomorrow
.br
sort <file >outfile
.br
EOT
.RE
.P
2. This sequence, which demonstrates redirecting standard error to a pipe, 
is useful in a command procedure (the sequence of output redirection 
specifications is significant):
.P
.RS 10
at now + 1 hour <<!
.br
diff file1 file2 2>&1 >outfile | mailx mygroup
.RE
.P
3. To have a job reschedule itself, \f2at\f1 can be invoked from 
within the at-job. For example, this daily processing script named 
.B my.daily
will run every day (although \f2crontab\f1 is a more appropriate 
vehicle for such work):
.P
.RS 10
#my.daily runs every day
.br
.I daily processing
.br
at now tomorrow < my.daily
.RE
.P
4. The spacing of the three portions of the POSIX locale \f2timespec\f1 
is quite flexible as long as there are no ambiguities. 
Examples of various times and operand presentation include:
.P
.RS 10
at 0815am Jan 24
.br
at 8 :15amjan24
.br
at now "+ 1 day"
.br
at 5 pm FRIday
.RE
.RE

.P
.P
.IR sh (1)
provides different ways of specifying standard input.
Within your commands, it may be useful to redirect standard output.
.sp .8v
5. This sequence can be used at a terminal:
.nf
.in +1i
batch
sort \f2filename\fP >\f2outfile\fP
<control-D> (hold down 'control' and depress 'D')
.in -1i
.sp .8v
.fi
6. This sequence, which demonstrates redirecting standard
error to a pipe, is useful in a shell procedure (the sequence of
output redirection specifications is significant):
.nf
.in +1i
batch <<!
sort \f2filename\fP 2>&1 >\f2outfile\fP | mail \f2loginid\fP
!
.in -1i
.sp .8v
.fi
7. To have a job reschedule itself, invoke \f2at\fP from within the
shell procedure, by including code similar to the following within the shell file:
.nf
.in +1i
echo "sh \f2shellfile\fP" | at 1900 thursday next week
.in -1i
or, from a terminal
.ne 3
.in +1i
at 1900 thursday next week
sh \f2shellfile\fP
<control-D> (hold down 'control' and depress 'D')
.in -1i
.fi
.sp .8v
.SH FILES
.nf
	/usr/lib/cron			  main cron directory
	/usr/lib/cron/at.allow	  list of allowed users
	/usr/lib/cron/at.deny	  list of denied users
	/usr/spool/cron/atjobs	  spool area
	/usr/lib/cron/.proto	  generic prototype, prepended to all jobs
	/usr/lib/cron/.proto.x	  prototype for queue `x'
	/usr/lib/cron/queuedefs	  definitions for queues
.fi
.SH SEE ALSO
cron(1M),
kill(1),
mail(1),
nice(1),
ps(1),
sh(1),
sort(1),
proto(4),
queuedefs(4).
.SH DIAGNOSTICS
Complains about various syntax errors and times out of range.
