calmsacibis995/irix-6517-src/eoe/man/man1/dhcp_relay.1
'\"macro stdmacro
.TH dhcp_relay 1M "29 Jan 1996"
.SH NAME
dhcp_relay \- proclaim relay-agent for Dynamic Host Configuration Protocol
.SH SYNOPSIS
\f3/usr/etc/dhcp_relay\f1 [ \f3\-f\f1 ] [ \f3\-o\f1 \f2relay_options_file\f1 ]
.SH DESCRIPTION
.I dhcp_relay
is the relay-agent that communicates with other DHCP and \fIproclaim\fR clients
and servers to provide address-leases across networks using DHCP messages.
The format of DHCP messages is based on BOOTP messages (see RFC 951).
A detailed protocol specification for DHCP is contained in RFC 1541,
available from the Network Information Center.
.PP
The DHCP relay-agent receives service requests at the UDP port indicated
in the \f2bootp\fP service description contained in the file
.I /etc/services
(see
.IR services (4)).
.PP
.I dhcp_relay
replaces the standard \fIbootp(1M)\fR server application and serves both
\f2bootp\fP and DHCP clients.
The \f3\-f\fP option on the command line enables the forwarding function of 
.IR bootp(1M).

.SH CONFIGURATION
.I dhcp_relay
execution can be controlled through the following steps.
.IP 1) 4n
Specify relay-agent options in the \f2/etc/config/dhcp_relay.options\fP file,
if any, as in this example:
.br
\f3\-c proclaim_config_dir\fP
.br
This specifies an optional \f2proclaim\fP server configuration directory.
The default directory is \f2/var/dhcp/config\fP.
.IP 2) 4n
The configuration directory contains a file \f2dhcp_relay.servers\fP,
which has a list of \f2proclaim\fP servers, one per line.
DHCP messages are forwarded to each server contained in this file.
Proclaim servers may be specified using either an Internet host name
or an Internet address in standard dot notation (see 
.IR inet (3N)).
Here is a sample \f2dhcp_relay.servers\fP configuration file:
.nf
\f3192.26.61.9\fP
\f3dhcpserver.sgi.com\fP
.fi
.IP 3) 4n
Enable the \fIproclaim\fR relay-agent by entering these commands:
.nf
\f3chkconfig proclaim_relayagent on\fP
\f3chkconfig proclaim_server off\fP
.fi
.IP 4) 4n
Replace the "bootp" entry in \f2/usr/etc/inetd.conf\fP with this line:
.RS
\f3bootp dgram udp wait root /usr/etc/dhcp_relay dhcp_relay -o \e
	/etc/config/dhcp_relay.options\f1
.RE
.IP 5) 4n
Kill any running \f2bootp\fP with this command:
.RS
\f3/etc/killall bootp\fP
.RE
.IP 6) 4n
Restart \f2inetd\fP with this command:
.RS
\f3/etc/killall -HUP inetd\fP
.RE

.SH FILES
.nf
/etc/config/dhcp_relay.options
/etc/hosts
/etc/ethers
/usr/etc/inetd.conf
/var/dhcp/etherToIP
/var/dhcp/config/dhcp_relay.servers
.fi

.SH "SEE ALSO"
bootp(1M),
chkconfig(1M),
dhcp_bootp(1M),
inetd(1M),
proclaim(1M),
ProclaimRelayMgr(1M),
syslogd(1M),
ethers(4),
hosts(4).
.PP
IETF RFCs 1541, 1533, 1534, 1535.
