calmsacibis995/irix-6517-src/eoe/man/man1/dhcp_bootp.1
.TH dhcp_bootp 1M "29 Jan 1996"
.SH NAME
dhcp_bootp \- proclaim server for Dynamic Host Configuration Protocol
'\" LINKS: proclaim_server
.SH SYNOPSIS
.nf
\f3/usr/etc/dhcp_bootp\f1 [ \f3\-fd\f1 ] [ \f3\-o\f1 \f2dhcp_options_file\f1 ]
.fi
.SH DESCRIPTION
.I dhcp_bootp
is the server that communicates with other DHCP and \f2proclaim\f1(1M) clients
to provide configuration parameters, including at least an IP address.
The format of DHCP messages is based on \f2bootp\f1 messages (see RFC 951).
A detailed protocol specification for DHCP is contained in RFC 1541,
available from the Network Information Center.
.PP
The DHCP protocol uses UDP/IP as its transport mechanism.
The DHCP server receives service requests at the UDP port indicated in the
\f2bootp\f1 service description contained in the file
.I /etc/services
(see
.IR services (4)).
The \f2proclaim\f1 server can be used together with one or more
\f2proclaim relay-agents\f1 (see \f2dhcp_relay\f1(1M))
to enable clients to obtain address-leases across networks.
The \f2dhcp_bootp\f1 server responds to multiple interfaces
on a multihomed gateway machine, for dynamic IP addresses.
.PP
.I dhcp_bootp
replaces the standard \f2bootp\f1(1M) server application
and serves both \f2bootp\f1 and DHCP clients.

.SH COMMAND LINE OPTIONS
.TP
\f3-f\f1 
This enables cross network forwarding if the client is
requesting for service from a dhcp server which is reachable via
this server and on a different wire.
.TP
\f3-d\f1
This enables the \f2dhcp_server\f1 into a debug mode in which it
logs messages to \f2/var/adm/SYSLOG\f1.
.TP
\f3-o\f1
The path of the \f2dhcp_options_file\f1 can be mentioned using
this option. The default location is \f2/etc/config/dhcp_bootp.options\f1.
.SH CONFIGURATION
.I dhcp_bootp
execution can be controlled through the following steps.
.IP 1) 4n
Specify the additional DHCP-related options in the
\f2/etc/config/dhcp_bootp.options\f1 file as follows:
.RS
.TP
\f3\-y\f1
If you are using NIS to propagate the \f2hosts\f1 and \f2ethers\f1
map, this system is required to be the NIS master server
for \f2proclaim\f1 to work correctly.
.TP
\f3\-w\f1 \f2hosts_map\f1
Specifies the optional location of the \f2hosts\f1 map.
The default is \f2/etc/hosts\f1.
.TP
\f3\-e\f1 \f2ethers_map\f1
Specifies the optional location of the \f2ethers\f1 map.
The default is \f2/etc/ethers\f1.
.TP
\f3\-u\f1 \f2sysname\f1
Specifies the name for an optional \f2sysname\f1 file.
The default
is \f2/unix\f1.
.TP
\f3\-c\f1 \f2proclaim_config_dir\f1
Specifies the optional proclaim server configuration directory.
The default directory is \f2/var/dhcp/config\f1.
.TP
\f3-t\f1 \f2seconds\f1
A timeout period for the \f2dhcp_bootp\f1 server can be set else
the default period will be used.If a timeout period of 0 seconds
is used then the \f2dhcp_bootp\f1 server will become a persistent
daemon.
.TP
\f3\-x\f1
This option is used in conjunction with a Domain Name
Server that provides the IP address to hostname mapping for the
initial assignment of IP addresses to hosts by the DHCP
server. The option has been found to be particularly useful in an
Internet Service Provider type of setup where the IP address to
hostname mapping may be required to remain fixed. Once an IP address is
assigned it is written to the \f2etherToIP.pag\f1 file.  When this
option is in effect, \f2etherToIP.pag\f1 is the only file
consulted to determine whether a particular IP address or hostname
is already assigned.
.TP
\f3\-n\f1
Specifies that the server should return a 
netmask with its reply regardless of whether a client requested
it or not.
.TP
\f3\-m\f1 \f2options\f1
Specifies additional options to be sent by the server to clients
irrespective of whether the client requests them or not. The
additional options are specified as a comma or colon separated
list with no spaces.
.TP
\f3\-r\f1 \f2script_file_path\f1
Specifies an optional script file to execute when the server changes
the \f2etherToIP\f1 database. The complete path to the
script must be specified as an a argument. The server calls the
script with several command-line arguments: \f2\-c client_identifier
\-m physical_address \-i ip_address \-h hostname \-l lease \-o
operation \-t dhcp_message_type\f1. The script is executed in the
background. The value of the operation argument is 0 if it was a
record creation, 1 if it was a deletion, and 2 if the lease was
updated. The dhcp_message_type is the same as defined message
types in the DHCP literature. If a message is sent to the client
that message type is passed as an argument, otherwise the message
type received from the client is passed. This script may be used
to perform other functions such as dynamic DNS updates. 
.TP
\f3\-W\f1 
Specifies that the the hosts map file or \f2/etc/hosts\f1 file
should not be updated when leases are added or removed.
.TP
\f3-E\f1
Specifies that the ethers map file or\f2/etc/ethers\f1 file
should not be updated when leases are added or removed.
.TP
The following options (\f3-px,-dx,-l\f1) can be set only
with the Enhanced DHCP server product.
.TP
\f3\-pn\f1
Specifies that a ping be sent before an address is leased to
check if a host is using the IP address. If a reply is received
then a message is logged in the SYSLOG indicating that "Address
<addr> appears to be STOLEN" and a record is added into the
database with a lease time of -2 for this IP address. The DHCP
administrator should investigate the occurrence and remove the
entry in the database with the \f2dhcpdb\f1 command once it has
been resolved. The DHCP server tries to give out another address
to the requesting client. The server attempts to recycle stolen 
addresses when it runs out of addresses and at a frequency
specified by the lease time in the configuration files.

.TP
\f3\-pt\f1 \f2ping_timeout\f1
Specifies the timeout for the ping. If a reply to a ping is not
received in \f2ping_timeout\f1 seconds the address is considered
to be not taken. The default value for the timeout is 1
second. Note that the server processes requests from other DHCP
clients while waiting for the timeout to expire. The server does
not block waiting for a reply to a ping request. If blocking
pings are required for some reason use the \f3-pb\f1 option
instead of the \f3-pn\f1 option.
.TP
\f3\-pl\f1 \f2number_of_outstanding_pings\f1
This is the maximum number of pings outstanding. Once this value
is reached the server automatically stops sending ping to check
if an IP address is taken. The server begins to send ping request 
once the number of outstanding ping requests falls below this
value. It is set to 16 by default.
.TP
\f3\-pd\f1 This option is available for backward compatibility
with earlier versions. In prior versions (if \f3-x\f1 was not
specified) while assigning a new address the server would make a
\f2gethostbyaddr(3N)\f1 call to check if it could assign an IP
address to a client for which it had no prior binding. If a
binding was found in DNS maps then the particular address was not
assigned. In the new version of the server to obtain this older
behavior it is necessary to specify the \f3-pd\f1 option. If this
is not specified the server will not perform a
\f2gethostbyaddr(3N)\f1 call to check if an IP address is
available.
.TP
\f3\-dn\f1 Specifies that dynamic DNS updates are on. The
behavior of DNS updates are modified by the following
(\f2\-da\-db\-dc\-ds\-dt\f1) additional options. Note that if the -x
DHCP server option is specified then the -dn option is silently
ignored. With the -x option DNS maps are pre-populated so it
does not make any sense to update DNS dynamically.
.TP
\f3\-da\f1 Ordinarily the server will perform dynamic DNS updates
(if the -dn option is specified) only if the Dynamic DNS option
is sent by the client (option 81 as per the draft). If this (-da)
option is used the server will update DNS regardless of whether
option 81 was sent by the client or not.  
.TP
\f3\-db\f1 If this is specified the DNS updates are performed
before an ACKnowledgement is sent to the client. By default the
dynamic DNS updates are performed after the ACK is sent to the
client.
.TP
\f3-dc\f1 If this is specified the DNS A RR is also updated 
by the server. Otherwise whether the A RR is updated or not
depends on the flags value sent in the dynamic DNS update
option by the client.
.TP
\f3\-ds\f1 Specifies that the security feature should not be
used. By default secure updates are performed using TSIG for
those networks for which a key is specified.
.TP
\f3\-df\f1 \f2filename\f1 
Specifies the file that contains the
(TSIG) keys for the various networks served by the DHCP
server. The default file name is
\f2/var/dhcp/config/dhcp_ddns.conf\f1. A key must be specified
for each network number for which secured updates are
required. Each line in this file specifies the network number
(netnumber) followed by the keyname, algorithm, and the base 64
encoded secret key. Fields are separated with spaces or tabs. The
keyname and algorithm-name are the same as that used in the BIND
8.2 configuration file.
.TP
\f3\-dt\f1 \f2time_to_live\f1 
Specifies the time to live (ttl in seconds)
for records that are added to the DNS. The ttl specified by the
DHCP server in the DNS update is the minimum of this value and
the lease duration.
.TP
\f3\-l\f1 \f2/var/dhcp/config/dhcp_ldap.conf \f1 
This option specifies that the ldap related options should be 
picked from the /var/dhcp/ldap/dhcp_ldap.conf file. See the 
file /var/dhcp/ldap/dhcp_ldap.conf to see various options and 
what may need to be specified in order to use the DHCP server
with an LDAP server to store configuration and leases.
.RE
.IP 2) 4n
Create one or more network configuration files based on the network
numbers this server is responsible for.
A default configuration file is provided: \f2/var/dhcp/config/config.Default\f1.
The new file(s) should be named \f2config.<netnumber>\f1 in the same directory.
For example, if this server is serving clients on the 192.26.61 network,
the configuration file should be named \f2config.192.26.61.0\f1.
See below for a list of configuration parameters.
.IP 3) 4n
The DHCP server also provides MAC address based filtering. This
option is available only with the Enhanced DHCP server product. The
filters are specified in the 
.I /var/dhcp/config/dhcpmtab
file. MAC addresses can be specified as either complete addresses
or as a regular expression to specify a set of addresses. The
regular expression syntax is described in the man pages for
\f2regcmp(3G)\f1. 

If a DHCP packet from a client with a matching
mac address is received then the corresponding actions are
taken. Regular expression matching is attempted only if a
complete match is not found. The length and hardware type must
also match for non-regular expression entries. The length may not
match for entries that have regular expressions. Once a match is
found the remaining entries are not searched. An example of the
configuration file is as follows

.Ex
# dhcpmtab - mac address based filtering for DHCP
#len	htype	mac			action	
6	1	01:02:03:8a:8b:8c	K
0	1	01:02:*			L|K	
.Ee

The actions can be specified as a combination of L and K. Each of
the actions L=log request, and K=drop request, is acted upon in
that order.  The system log is updated if the L action is
requested. If the K action is specified and an L is not specified
then the packet is silently dropped.

.IP 4) 4n
The DHCP server can be configured to send specific user defined
options based on the value of the vendor class option sent by the 
DHCP client. To define new options for this purpose use the
\f2/var/dhcp/config/dhcp_option_types\f1 file. The format of this
file is described as comments within this file. Each line
consists of a user selected name, an option number, and the type
of the option. The value to be returned by the DHCP server can be 
specified in the \f2/var/dhcp/config/vendor_options\f1 file. See the
file for the format. The vendor class and the network number to
which option values apply can be specified within the file.

.IP 4) 4n
Enable the \f2proclaim\f1 server by giving the command:
.nf
\f3chkconfig proclaim_server on\f1
.fi
.IP 5) 4n
Replace the "bootp" entry in \f2/usr/etc/inetd.conf\f1 with this line:
.nf
\f3bootp dgram udp wait root /usr/etc/dhcp_bootp dhcp_bootp -o \e
	/etc/config/dhcp_bootp.options\f1
.fi
.IP 6)
Issue this command, to restart \f2inetd\f1 with \f3/etc/killall -HUP inetd\f1:
.nf
\f4/etc/killall bootp\f1
.fi
.SS "Configuration Parameters"
.PP
These parameters can be supplied in the configuration file for each network.
All of the address fields can either be in standard IP address dot notation,
or as a hex number prefixed with a 0x.
Most of the fields can be left blank to render them non-applicable.
.TP
\f2pro_address_counter\f1
This integer field specifies the host number for the next IP
address.
The next address is constructed using the counter
and checked through the range of the assignable addresses.
The
first available address in the range is assigned.
.TP
\f2pro_host_pfx_counter\f1
This integer field specifies the starting number
appended to the \f2pro_host_prefix\f1 to generate a new hostname.
This counter is incremented and a new hostname generated
until a unique unused name is found.
.TP
\f2pro_netmask\f1
This field takes a netmask in address form.
For more information
on netmasks, see the \f2IRIX Admin: Networking and Mail\f1 guide.
This field specifies the subnetmask
used by the client systems.
.TP
\f2pro_lease\f1
This unsigned integer field specifies the client address lease
time in seconds.
This implementation of the DHCP server assigns
3 year leases by default, and the leases are expired only when
explicitly surrendered by the client.
.TP
\f2pro_host_prefix\f1
This string field specifies the default text prefix for
generating client hostnames.
For example, the prefix \f3iris\f1
directs proclaim to generate hostnames of the form \f3iris1\f1,
\f3iris2\f1, \f3iris3\f1, and so on.
.TP
\f2pro_choose_name\f1
This boolean (true or false) flag specifies whether the client
systems are allowed to choose their own hostname or whether they
must be assigned the name given to them by the server.
A value of 1 (true) in this field brings up a dialog box on the client
system giving the user the option of either taking the name
offered by the server or entering a hostname of the user's choice.
If the user selects a name, the server allows this
name if it passes basic tests for syntax and uniqueness,
otherwise the server/client dialogue continues until a
mutually acceptable name is submitted.
A value of 0 (false) in
this field indicates that the user on the client system must
accept the name provided by the server. 
This option can be used with SGI DHCP clients and servers
only. The client and server exchange DHCPREQUEST and DHCPOFFER
packets until a mutually acceptable name is chosen. This option
is being deprecated; use the \f2-H host-name\f1 option with 
SGI clients to specify host names.
.TP
\f2pro_ipaddress_range\f1
This field takes an entry of integers using standard numeric range rules.
The entry defines the range of host number
addresses assignable by this server.
For example, if the value is: 1-3, 5-7, 9.  The server issues IP addresses with the base address specified in the
configuration filename (such as \f2config.192.26.61.0\f1).
.IP
Each client is issued an IP address matching the name of the
configuration file, suffixed with the numbers 1 through 3, and
5 through 7, and 9, but not 4 or 8.
This option can be to restrict the IP addresses offered by a
given server.
This is very useful if the administrator wants
to assign only certain block(s) of addresses using proclaim,
or in the absence of a server to server protocol, wishes to
have multiple servers serve clients on the same subnet.
.TP
\f2pro_router_addr\f1
This field of comma-separated IP addresses specifies a list of
addresses for network routers on the client's subnet.
Routers
should be listed in the order of preference for their use.
.TP
\f2pro_bootfile_size\f1
Specifies length in 512-octet blocks of the default boot image for the client.
.TP
\f2pro_time_offset\f1
Specifies offset of the client's subnet from Coordinated Universal Time (UTC)
in seconds.
.TP
\f2pro_meritdump_pathname\f1
Specifies a file for dumping a core image in case the client crashes.
.TP
\f2pro_root_pathname\f1
Specifies the directory that contains the client's root disk partition.
.TP
\f2pro_extensions_pathname\f1
Specifies a TFTP file containing vendor extensions for \f2bootp\f1.
On SGI systems the this file has the same format as the
\f2config.netnumber\f1 file.
.TP
\f2pro_TFTPserver_name\f1
Specifies a TFTP server for the client.
.TP
\f2pro_bootfile_name\f1
Specifies the pathname of the default boot image for the client.
.TP
\f2pro_dns_domain\f1
This text field specifies the domain name that client should use
when resolving hostnames using DNS.
.TP
\f2pro_dnsserver_addr\f1
This field of comma-separated IP addresses specifies a list of
addresses for Domain Name System servers available to the client.
Servers should be listed in the order of preference for their use.
.TP
\f2pro_propel_server\f1
This IP address specifies the address of the \f2propel\f1 server that
serves the clients on this subnet.
Additional information about \f2propel\f1 can be found in Chapter 2,
"Software Distribution, User, and Host Management With propel,"
of the \f2IRIXpro Administrator's Guide\f1.
.TP
\f2pro_timeserver_addr\f1
This field of comma-separated IP addresses specifies a list of
addresses for time servers available to the client.
Addresses should be listed in the order of preference for their use.
.TP
\f2pro_logserver_addr\f1
Specifies a list of UDP log servers available to the client.
.TP
\f2pro_cookieserver_addr\f1
Specifies a list of RFC 865 cookie servers available to the client.
.TP
\f2pro_LPRserver_addr\f1
Specifies a list of RFC 1179 line printer servers available to the client.
.TP
\f2pro_resourceserver_addr\f1
Specifies a list of RFC 887 resource location servers available to the client.
.TP
\f2pro_swapserver_addr\f1
Specifies the IP address of the client's swap server.
.TP
\f2pro_nis_domain\f1
This text field specifies the name of the client's NIS domain.
.TP
\f2pro_nisserver_addr\f1
This field of comma-separated IP addresses specifies a list of
addresses indicating NIS servers available to the client.
Servers should be listed in the order of preference for their
use.
.TP
\f2pro_mtu\f1
This unsigned short integer field specifies the MTU (maximum transmission unit)
to use on the network interface configured in this file.
The minimum legal value for the MTU is 68.
.TP
\f2pro_allnets_local\f1
This boolean (true/false) field specifies whether or not the
client can assume that all other subnets of the IP network to
which the client is connected use the same MTU as the subnet to
which the client is directly connected.
A value of 1 (true) indicates that all subnets share the same MTU.
A value of 0 (false) means that the client should assume that some other
subnets can have smaller MTUs.
.TP
\f2pro_broadcast\f1
This IP address field specifies the broadcast address in use on
the client's subnet.
.TP
\f2pro_domask_disc\f1
This boolean (true/false) Perform Mask Discovery field specifies
whether or not the client should perform subnet mask discovery using ICMP.
A value of 1 (true) means that the client
should perform mask discovery, while a value of 0 (false)
indicates that the client should not perform mask discovery.
.TP
\f2pro_resp_mask_req\f1
This boolean (true/false) Mask Supplier field specifies
whether or not the client should respond to subnet mask requests using ICMP.
A value of 1 (true) means that the client should respond.
A value of 0 (false) in this field means that the client should not respond.
.TP
\f2pro_static_routes\f1
This field takes a comma-separated list of routes in the following form:
.br
\f3dest_address - router_address, dest_address2 - router_address2.\f1
.br
The static route field specifies a list of static routes that
the client should install in its routing cache.
If multiple routes to the same destination are specified,
they should be listed in descending order of priority.
The routes consist of a list of IP address pairs.
The first address is the destination address;
its counterpart address, separated by a dash (-),
is the address of the router to the destination.
The default route (0.0.0.0) is an illegal destination for a static route.
.TP
\f2Serve_This_Network\f1
Toggle DHCP serving of this subnet.
.TP
\f2Other Options\f1
The Proclaim server also handles other options listed in RFC 1533.
To set values for these options use of the
\f2ProclaimServerMgr\f1(1M) graphical user interface is recommended.
You can view the standard \f2config.Default\f1 file in the
\f2/var/dhcp/config\f1 directory to see all the supported options.
.PP
The following are the active lines only from a working \f2config.netnumber\f1
configuration file:
.PP
.RS
.nf
Serve_This_Network: 1
pro_address_counter: 1
pro_host_pfx_counter: 1
pro_netmask: 255.255.255.0
pro_lease: 604800
pro_host_prefix: n6634
pro_choose_name: 1
pro_ipaddress_range: 1-254
pro_dns_domain: engr.sgi.com
pro_nis_domain: engr.sgi.com
pro_mtu: 1500
pro_allnets_local: 1
pro_domask_disc: 0
pro_resp_mask_req: 0
.fi
.RE

.SH NOTES
.PP
Debugging may be enabled by sending a SIGUSR1 signal to the
server and may be disabled by sending SIGUSR2. To increase the
level of debugging send multiple SIGUSR1 signals, for example,
\f3killall -USR1 dhcp_bootp\f1. Sending a SIGHUP signal to the
server will cause the server to reload its configuration files.
.PP

The dhcp_bootp server database is maintained in ndbm files with
(.dir) and (.pag) extensions. The \f2dhcpdb(1M)\f1 utility may be
used to manage the DHCP database. This utility also allows leases to
be imported or exported from/to text files.
.PP
The \f2/usr/sbin/dbmToEthIP\f1 utility can be used to view
the contents of the database. It converts the ndbm format to the
text format and outputs the text onto the standard output.In
case of situations where it is needed to generate the ndbm files
the \f2/usr/etc/ethIPToDbm\f1 utility may be used to convert a
\f2etherToIP\f1 file (in text format) to ndbm formatted
files. \f2dbmToEthIP\f1 and \f2ethIPToDbm\f1 may be discontinued
in the future. Use \f2dhcpdb\f1 instead.
.PP
To use the \f2bootp\f1 server with DHCP style options, specify
the options in the \f2/etc/config/bootp-rfc1533.options\f1
file. See this file to check what options are supported.
.SH FILES
.nf
/etc/config/dhcp_bootp.options
/etc/config/bootp-rfc1533.options
/etc/hosts
/etc/ethers
/usr/etc/inetd.conf
/var/dhcp/etherToIP
/var/dhcp/etherToIP.pag
/var/dhcp/etherToIP.dir
/var/dhcp/config/config.Default
/var/dhcp/config/dhcpmtab
/var/dhcp/config/dhcp_option_types
/var/dhcp/config/vendor_options
/var/dhcp/config/dhcp_ldap.conf
/var/dhcp/config/dhcp_ddns.conf
.fi

.SH "SEE ALSO"
bootp(1M),
chkconfig(1M),
dhcp_relay(1M),
dhcpdb(1M),
inetd(1M),
proclaim(1M),
ProclaimServerMgr(1M),
syslogd(1M),
ethers(4),
hosts(4).
.PP
IETF RFCs 1541, 1533, 1534, 1535.
