calmsacibis995/irix-6517-src/eoe/man/man1/eject.1
'\"macro stdmacro
.TH EJECT 1
.SH NAME
eject \- eject a removable media device
.SH SYNOPSIS
.B eject
[ [
.I controller_id
]
.I  scsi_id
[
.I lun "] |" device " |"
.I dir
]
.SH DESCRIPTION
.B eject
ejects a removable mediad device.  If the device has mounted filesystems,
.B eject
will first try to unmount them.
.PP
Without any options,
.B eject
will act upon the first device it
finds in the hardware inventory table.
.SH OPTIONS
.TP
.I device
Specify the device to eject.  The device may be specified using
any of the names described in the \fImediad(1m)\fP man page.
Note that some devices do not support software eject.
.TP
.I dir
If
.B mediad
is running, the mount point of the filesystem
on the disk to be ejected can be specified.
.TP
.I [controller_id] scsi_id
If 
.B mediad
is running, the controller id and the scsi id of the device to be ejected
can be specified.  If the controller id is left out, it will default
to 0.
.SH FILES
/dev/rdsk/fd*	floppy devices
.br
/dev/scsi/* 	generic SCSI devices (for CD-ROM drives)
/dev/tape		shorthand for the tape device on the system
/dev/rmt/*	real name for all tape devices on the system
/etc/fsd.tab	table of devices monitored by mediad
.SH ERRORS
An error will occur if the specified device does not have
a disk in it, or if the file system on the disk couldn't
be unmounted.
.SH EXAMPLES
eject /dev/scsi/sc0d6l0		eject CD-ROM disk (controller 0 SCSI id 6)
.br
eject /dev/rdsk/fds0d2.3.5	eject floppy disk (controller 0 SCSI id 2)
.br
eject 0 2					eject floppy disk (controller 0 SCSI id 2)
.br
eject 2					eject floppy disk (controller 0 SCSI id 2)

.SH SEE ALSO
mediad(1M), mount(1M), umount(1M), ds(7M), smfd(7M)
.SH DIAGNOSTICS
.PP
The exit codes for eject have the following meanings:
.RS 4
0 : success
.br
1 : Incorrect usage.  Check the eject man page.
.br
2 : The drive is busy.  Make sure no programs are using the drive.
.br
3 : Unable to eject.  Try hardware eject.
.br
4 : There is no media in the drive.  Make sure you are specifying the right drive.
.br
5 : Software eject not supported.  Use hardware eject.
.br
6 : No such device.  Check your scsi id, fsname, or dir.
.br
7 : A system error has occurred.  See /var/adm/SYSLOG for more info.
.br
.RE
.PP

