calmsacibis995/irix-6517-src/eoe/man/man1/espnotify.1
.TH espnotify 1
.SH NAME
espnotify \- a generic command line notification utility for SGI Embedded Support Partner
.SH SYNOPSIS
.nf
\f3/usr/bin/espnotify -E\f1 <\f2e-mail addresses\f1> { \f3-f\f1 <\f2filename\f1> | \f3-m\f1 <\f2message\f1> }
                   [\f3-o\f1 <\f2processing options\f1>] [\f3-s\f1 <\f2subject\f1>]

\f3/usr/bin/espnotify -c\f1 <\f2message\f1> [\f3-a\f1] [\f3-D\f1 <\f2Display\f1>] [\f3-g\f1 <\f2geometry\f1>] 
                   [\f3-i\f1 <\f2icon image\f1>] [\f3-t\f1 <\f2title\f1>]

\f3/usr/bin/espnotify -C\f1 <\f2message\f1> \f3-p\f1 <\f2pagers\f1> [\f3-S\f1 <\f2paging service\f1>]
                   [\f3-Q\f1 <\f2qpage server\f1>]

\f3/usr/bin/espnotify -A\f1 <\f2message\f1>
.fi
.SH DESCRIPTION
.I espnotify
is a generic command line utility that is packaged with SGI Embedded Support 
Partner (see \f3esp\f1(5) for more details).  It is used to perform various
types of notifications.  
.P
\f2espnotify\f1 can post a given message to e-mail addresses, can display a
message on local/remote X display, can post a message to a paging service to 
be delivered to a pager or can display the message on the system console.
.P
\f2espnotify\f1 supports various command line options for various types of
notifications.  These options are discussed in detail later in this man page.
More than one type of notification can be specified at a time.  There are some
general options that are applicable to all types of notifications.  These
general options are :
.TP
.B \-d  
This causes espnotify to display debug information.
.TP
.B \-n \f2range from 1 to 7\f1
Provide a numeric priority for the message (defaults to 7).  The priorities 
are decoded as follows :
          1 and 2	Critical Message
          3		Error Message
          4		Warning Message
          5 to 7	Informational Message
.P
The first synopsis is for posting a message to specified e-mail addresses.
\f2espnotify\f1 invokes /usr/sbin/Mail to deliver message to the e-mail 
addresses specified with \-E option.
.P
The options for e-mail notification include:
.TP
.B \-E \f2e-mail addresses\f1
Comma seperated list of e-mail addresses for use in e-mail notifications.
This option must be specified for e-mail notification to work.
.TP
.B \-f \f2filename\f1
This specifies a text file content of which is used for e-mail notification.
A binary file may be sent if the \f3-o\f1 option is used.  
.TP
.B \-m \f2message\f1
This option is used when the content for an email notification is to be a
string.  All strings must be enclosed in double quotes.  Please note that
\f3-m\f1 and \f3-f\f1 options are mutually exclusive.
.TP
.B \-o \f2processing options\f1
Processing options for the message.  Supported options are \f2COMP\f1
(compress and uuencode the message) and \f2ENCO\f1 (uuencode the 
message).  Processing options are valid only with \f3-f\f1 option.
.TP
.B \-s \f2subject\f1
Subject for the message.  In case no subject is given, a default subject
is provided by \f2espnotify\f1. The format of the default subject is as 
follows :

    [HOSTNAME]: <text>

    where,
    HOSTNAME is the name of the host
    <text> can be "Critical System Error" or "System Error" or 
           "System Warning" or "System Information" depending
           on priority.

If both subject and priority are specified, the subject specified with -s
overrides the default subject.  If neither a subject or priority is specified,
the subject will default to "[HOSTNAME]: System Information".
.P
The second synopsis is for displaying a message (graphical notification) to 
a local/remote X display. 
.P
The options for graphical notification include:
.TP
.B \-a
This options specifies that audio should be used along with
graphical notification.  Audio notification cannot be run without
graphical notification.  Audio is played via the /usr/sbin/ssplay 
command on which host it is executed.  It is not possible to play
audio on a remote host.
.TP
.B \-c \f2message\f1
A text string for use as GUI notification content.  Text must be contained
within double quotes if spaces are needed in the string.  This option
must be specified to perform a graphical notification.
.TP
.B \-D \f2Display\f1
Specifies an alternate display host on which to display a graphical
notification.  The default is to display on the host specified in the
$DISPLAY environment variable.
.TP
.B \-g \f2geometry\f1
X compatible geometry string in the form WIDTHxHEIGHT+XOFF+YOFF where
WIDTH, HEIGHT, XOFF, and YOFF are numbers) for specifying a preferred size
and location for this application's main window.
.TP
.B \-i \f2icon image\f1
This option specifies the icon to display within graphical notifications.

There are four options:

     \f4Critical\f1
     \f4Error\f1
     \f4Warning\f1
     \f4Info\f1

If a priority is set with the -n option, the icon is set accordingly.  If
neither priority or icon_image is specified, the "Info" icon will be
defaulted to.
.TP
.B \-t \f2title\f1
This specifies the title of the graphical notification.  If a numeric
notification priority is set with -n, title defaults to:

     Priority 1 - "Critical System Error" 
     Priority 2 - "System Error" 
     Priority 3 - "System Warning" 
     Priority 4 - "System Information" 

If neither a title nor priority are specified the title will default to:
"System information"   If a priority is specified, a custom title can
still be specified.
.P
The third synopsis is for sending a message to a specified pager.  \f2espnotify\f1
uses \f2qpage\f1 (see \f2QuickPage\f1(1m) for more details) to deliver the
message. The QuickPage daemon must be running on the machine that delivers 
the page.  This daemon is started during system startup if chkconfig variable, 
quickpage is turned on.
.P
The configuration of the daemon can be done via SGI Embedded Support 
Partner User Interface.  Please refer to the SGI Embedded Support Partner
User's Guide for more details.
.P
The options for paging notification include:
.TP
.B \-C \f2message\f1
Specifies a text string for use as alphanumeric page content.  Text must be
contained within double quotes if spaces are needed in the string.  
This option must be specified for paging notification to work.

.TP
.B \-p \f2pagers\f1
Comma seperated list of pager or pager-ids that are to receive a
notification.  One or more  of each can be specified on the command line.
Pager specifications are stored in /etc/qpage.cf file on the server that
is delivering the page.  The pagers can be set from the SGI Embedded
Support Partner User Interface.

.TP
.B \-S \f2paging service\f1
This options allows the specification of an alternate paging service.
Service specifications are stored in /etc/qpage.cf file on the server that
is delivering the page.  These services can be set from the SGI Embedded
Support Partner User Interface.  If no service is specified then the service
with name set as 'default' is used to deliver the page.

.TP
.B \-Q \f2qpage server\f1
This option allows the specification of an alternate server on which
the QuickPage daemon is running.  If this option is not specified a connection
to the local Qpage daemon will be tried.
.P
The fourth synopsis is to display message on the terminal/system console.
The message specified with \f3-A\f1 is displayed on the standard output
of the terminal if open.  Otherwise, the message is displayed on the system
console.

.SH EXAMPLES

Send a prioritized GUI notification.
.PP
% espnotify -n 2 -c "Widget 25 failure"

Send a prioritized e-mail notification with string content along with a
page.  In this example we are using a "pager" definiton defined in
/etc/qpage.cf as the argument for the -p parameter.
.PP
% espnotify -n 2 -E john@xyz.com -m "System disk is nearing capacity" -p johndoe -C "System disk is nearing capacity"

Send a page to "johndoe".  Use an alternate Qpage server along with an 
alternate paging service.  "johndoe" along with the alternate paging 
service name must exist in /etc/qpage.cf configuration file on the alternate
QuickPage Server.
.PP
% espnotify -C "System temperature too high" -Q pager.server.com -S airtouch -p johndoe
.SH SEE ALSO
Mail(1), 
QuickPage(1m),
esp(5).
.SH REFERENCES
SGI Embedded Support Partner Documentation.
