calmsacibis995/irix-6517-src/eoe/man/man1/hostid.1
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)hostid.1	6.2 (Berkeley) 5/5/86
.\"
.if n .pH man1.hostid @(#)hostid	30.3 of 2/1/86
.TH HOSTID 1
.UC 5
.SH NAME
hostid \- set or print identifier of current host system 
.SH SYNOPSIS
.B hostid
[ \f2hexnum\fP | \f2hostname\fP ]
.br
.B hostid \-h \f2hostname\fP
.SH DESCRIPTION
The
.I hostid
command with no arguments prints the identifier of the current host 
in hexadecimal.
This numeric value is expected to be unique across all hosts and
is commonly set to the host's Internet address.
The super-user can set the host ID by giving an argument that is a hexadecimal
value or a hostname.
With the \f3\-h\fP option, the argument must be a hostname.
If the argument is a hostname,
.I hostid
sets the ID to the name's Internet address listed in
.IR /etc/hosts .
.I Hostid
sets the exit status to 0 if it successfully changed the 
host ID and to 1 if not.
The script \f2/etc/init.d/network\f1 uses
.I hostid
to set the ID during system startup to the Internet address of the
hostname found in /etc/sys_id.
.SH FILES
/etc/hosts	hostname-address database
.SH SEE ALSO
gethostid(2), sethostid(2), sysinfo(1), network(1M), hosts(4)
