calmsacibis995/irix-6517-src/eoe/man/man1/hostname.1
'\"macro stdmacro
.\" Copyright (c) 1983, 1988 Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)hostname.1	6.3 (Berkeley) 7/9/88
.\"
.TH HOSTNAME 1
.SH NAME
hostname \- set or print name of current host system
.SH SYNOPSIS
\f3hostname\fP [\-s] [nameofhost]
.SH DESCRIPTION
\f2Hostname\fP prints the name of the current host.  
The \f2\-s\fP option trims any domain information from the printed name.
The super-user can
set the hostname by supplying an argument; this is usually done in the
system setup initialization script 
.B /etc/init.d/sysetup
using the contents of 
.BR /etc/sys_id .
This setting persists only until the next reboot when the startup procedure
will once again initialize the hostname with the contents of the above file.
To permanently change this value change the contents of the above file then
run hostname as a privileged user.
.SH SEE ALSO
gethostname(2), sethostname(2)
