calmsacibis995/irix-6517-src/eoe/man/man1/oview.1
'\"macro stdmacro
.nr X
.if \nX=0 .ds x} OVIEW 1 "Performance Co-Pilot" "\&"
.if \nX=1 .ds x} OVIEW 1 "Performance Co-Pilot"
.if \nX=2 .ds x} OVIEW 1 "" "\&"
.if \nX=3 .ds x} OVIEW "" "" "\&"
.TH \*(x}
.SH NAME
\f3oview\f1 \- visualize the performance of Origin systems 
.\" literals use .B or \f3
.\" arguments use .I or \f2
.SH SYNOPSIS
\f3oview\f1
[\f3\-Cz\f1]
[\f3\-A\f1 \f2align\f1]
[\f3\-a\f1 \f2archive\f1]
[\f3\-c\f1 \f2configfile\f1]
[\f3\-h\f1 \f2host\f1]
[\f3\-l\f1 \f2level\f1]
[\f3\-n\f1 \f2pmnsfile\f1]
[\f3\-O\f1 \f2origin\f1]
[\f3\-p\f1 \f2port\f1]
[\f3\-S\f1 \f2starttime\f1]
[\f3\-T\f1 \f2endtime\f1]
[\f3\-t\f1 \f2interval\f1]
[\f3\-x\f1 \f2version\f1]
[\f3\-Z\f1 \f2timezone\f1]
[\f3\-geometry\f1 \f2geometry\f1]
[\f3\-display\f1 \f2display\f1]
[\f3\-name\f1 \f2name\f1]
[\f3\-title\f1 \f2title\f1]
[\f3\-xrm "\f1\f2resourceName\f1\f3:\f2 value\f3"\f1 ...]
[other X11-flags]
.SH DESCRIPTION
.deCW
.ie t \f(CW\\$1\f1\\$2
.el \fI\\$1\f1\\$2
..
.B oview
is a graphical tool for the Performance Co-Pilot (see 
.BR PCPIntro (1))
that supports a dynamic display of Origin system topology and performance.
.PP
.B oview
can display performance information about CPUs, nodes and CrayLink
routers in Origin systems connected in no-router, star, planar, cube
or hypercube configurations.  Configurations with more than 16
CrayLink routers (i.e. more than 64 CPUs) are currently not
supported by
.BR oview .
.PP
Normally,
.B oview
operates in ``live'' mode where performance metrics are fetched in real-time.
The target host can be changed from the default localhost to another Origin host
running 
.BR pmcd (1)
with the
.B \-h
option.
Performance metric archives, previously collected by
.BR pmlogger (1),
may be replayed by using the
.B \-a
option.  This allows the user to interactively control the current replay time
and rate using the VCR paradigm.  This is particularly useful for retrospective
comparisons and for post-mortem analysis of performance problems where a remote
system is not accessible or a performance analyst is not available on-site.
.PP
By default, the interconnection topology of the metric source is automatically
determined by
.BR oview_layout (1).
This application generates a configuration file describing the connections
between CrayLink routers which
.B oview
translates into a three-dimensional scene.  Alternatively, a hand-crafted
configuration can be passed to
.B oview
using the
.B \-c
option or piped on
.IR stdin .
.SH VISUALIZATION
.PP
Routers are represented in the scene by octahedrons connected to other
routers and nodes by cylindrical CrayLinks.  Nodes are represented by short
cylinders and CPUs are blocks on the ends of each node.
.PP
To avoid cluttering the scene, CPUs and nodes may not be shown by default.  The
.B \-l
option and the
.B Options
menu can be used when 
.B oview
is launched or while it is running to selectively ``sprout'' nodes and CPUs.
.PP
The CrayLink cylinders between routers and nodes show the receive utilization
of the associated router or node port.  This is visualized as colored bands
which grow toward the mid-point of the link as the utilization increases.  The
.B "receive bypass"
and the
.B "receive queued"
utilization are shown as
.B violet
and
.B yellow
bands, respectively.
The routers
change color proportional to the average receive utilization of all connected
links to the router.  The default thresholds for each color change are:
.TP
.B cyan
insignificant router utilization
.br
0 <= utilization < 1%
.TP
.B light cyan
light router utilization
.br
1% <= utilization < 5%
.TP
.B yellow
medium router utilization
.br
5% <= utilization < 20%
.TP
.B orange
high router utilization
.br
20% <= utilization < 40%
.TP
.B red
saturated router utilization
.br
utilization >= 40%
.PP
The short cylinders representing nodes change color according to the
.B "page migration interrupt rate"
on the node as a proportion of the expected maximum rate of 10.  The metric
used by nodes may be changed using the
.B nodeMetric
resource.  The default color scale for nodes is:
.TP
.B "light yellow"
0 <= rate < 5%
.TP
.B blue
5% <= rate < 10%
.TP
.B magenta
10% <= rate < 20%
.TP
.B orange
20% <= rate < 40%
.TP
.B red
rate >= 40%
.PP
CPUS use a stack of 
.BR blue ,
.B red
and
.B cyan
colored blocks to show the
.BR user ,
.B system
and
.B wait
utilization of each CPU, respectively.  A grey block on top of the colored
blocks, if visible, represents the unused CPU capacity.
.PP
All default
colors and color scale thresholds are configurable by modifying the application
defaults file
.IR /var/lib/X11/app-defaults/OView ,
your personal
.I .Xdefaults
file, or by using the
.BR X (1)
command line option
.BR \-xrm .
The resources supported by
.B oview
are described in the
.B "Application Resources"
section below.
.PP
Other tools can be launched from the
.B "oview Launch"
menu so that specific areas of performance may be explored in more detail.
.SH COMMAND LINE OPTIONS
The 
.BR -S ,
.BR -T ,
.B -O
and
.B -A
options may be used to define a time window to restrict the samples retrieved,
set an initial origin within the time window, or specify a ``natural''
alignment of the sample times; refer to
.BR PCPIntro (1)
for a complete
description of these options.
.PP
The other available options are:
.PP
.TP
\f3\-a\f1 \f2archive\f1
Performance metric information is retrospectively retrieved 
from the Performance Co-Pilot (PCP)
.IR archive ,
previously generated by 
.BR pmlogger (1). 
The archive should contain sufficient metrics for
.B oview
to determine the interconnection topology and modulate the scene.
.I /var/pcp/config/pmlogger/config.oview
contains the minimal set of metrics for
.BR pmlogger (1)
to generate an archive for
.BR oview .
.TP
.B \-C
Terminate after parsing the configuration, without displaying a window.  This
option can be used to validate an
.B oview
configuration without displaying the visualization.  However,
.B oview
still requires a connection to an 
.BR X (1)
display.
.TP
\f3\-c\f1 \f2configfile\f1
Generate the scene from the topology description in 
.IR configfile ,
rather than launching 
.BR oview_layout (1)
to automatically generate the configuration.  The format of 
.I configfile
is described in
.BR oview_layout (1).
To force reading the configuration from
.I stdin
if
.B \-a
or
.B \-h
have been specified, use ``\f3\-c\f1 \f3\-\f1''
.TP
\f3\-h\f1 \f2host\f1
Performance metric information is retrieved in real time from the 
Performance Metrics Collector Daemon (PMCD) of the nominated
.I host
machine.  Implies that 
.B oview
will run in ``live'' mode, so no archives 
.RB ( \-a )
can be specified on the command line. Only one
.B \-h
option may be given and the target
.I host
must be an Origin system.
.TP
\f3\-l\f1 \f2level\f1
Change the
.I level
of detail shown by
.B oview
when first displaying the scene.  The default level of details depends on the
number of routers on the target host:
.RS 4n
.TP
.B 0
Show only CrayLink routers, the default for systems with more than eight
routers.
.TP
.B 1
Show the CrayLink routers and node, the default for systems with five to eight
routers.
.TP
.B 2
Show all the CrayLink routers, nodes and CPUs, the default for systems with
less than five routers.
.RE

.TP
\f3\-n\f1 \f2pmnsfile\f1
Normally
.B oview
operates on the distributed Performance Metrics Name Space (PMNS), however if
the
.B \-n
option is specified an alternative local PMNS is loaded from the file
.IR pmnsfile .
.TP
\f3\-p\f1 \f2port\f1
Connect to the time controls (see
.BR pmtime (1))
on this
.BR port .
Used when a tool launches another tool so that they can connect to the
same time controls.
.TP
\f3\-t\f1 \f2interval\f1
The default update \f2interval\f1 may be set to something other than the
default 2 seconds.
The
.I interval
argument follows the syntax described in
.BR PCPIntro (1),
and in the simplest form may be an unsigned integer (the implied
units in this case are seconds).
.TP
\f3\-x\f1 \f2version\f1
Use the specified
.I version
of the
.BR pmlaunch (5)
specification.  The versions currently supported are ``1.0'' and the default
version ``2.0''.
.TP
\f3-Z\f1 \f2timezone\f1
By default,
.B oview
reports the time of day according to the local  timezone on the system where
.B oview
is run.  The
.B \-Z
option changes the default timezone to 
.I timezone
which should be in the format of the environment variable
.B TZ
as described in 
.BR environ (5).
.TP
.B \-z
Change the reporting timezone to the local timezone at the host that is the
source of the performance metrics, as identified via either the
.B \-h
or the first
.B \-a
options.
.PP
\f3\-geometry\f1 \f2geometry\f1
.br
\f3\-display\f1 \f2display\f1
.br
\f3\-name\f1 \f2name\f1
.br
\f3\-title\f1 \f2title\f1
.br
\f3\-xrm\f1 \f3"\f2resourceName: value\f3"\f1
.IP
Most standard 
.BR X (1) 
command line arguments may be used.
.SH WINDOW
The
.B oview 
window is comprised of a menu bar, time and scale controls, metric and time
values, and an ``examiner'' viewer (see
.BR ivview (1)),
which displays the 3D scene.
.SH EXAMINER VIEWER
The left, right and bottom edges of the examiner viewer contain a variety of
thumb wheels and buttons that can be used to adjust the visualization of the
3D scene.  The 
.I Rotx
and
.I Roty
thumb wheels allow the user to rotate the scene about the x and y axes, 
respectively.  The
.I dolly
thumb wheel moves the virtual camera closer and further from the scene allowing
the user to examine specific parts in detail or view the entire scene.  On the 
right edge of the viewer are eight buttons which affect the way the user can 
interact with the scene.
.TP 4n
.I Pointer
Changes the cursor to a pointer which allows blocks to be selected in the
scene.  See the Metric Selection section below.
.TP 4n
.I Hand
Changes the cursor to a hand which allows the scene to be rotated, translated
and dollied using a combination of mouse buttons.  The left mouse button can
be used to rotate the scene in the direction of the mouse.  Releasing the
left mouse button before the mouse has stopped moving will cause the scene to
continue to rotate, which can be stopped by pressing the left mouse button
again.  The middle mouse button will ``pan'' the scene, and both mouse buttons
act as a dolly for the virtual camera.
.TP 4n
.I Question Mark
Displays the SGI Help information for the examiner viewer.
.TP 4n
.I Home
Changes the scene back to its original position, unless the home position has
been changed by the home pointer button.
.TP 4n
.I Home Pointer
Changes the home position of the scene to be the scene currently in view.
.TP 4n
.I Eye
Resizes the scene so that it completely fits into the 3D viewing area.
.TP 4n
.I Cross-hairs
Moves the object under the cursor to the center of the viewing area, if the
hand cursor has been selected.  Pressing the ``s'' key while the cursor is
over an object has the same affect.
.TP 4n
.I Perspective Box
Switches the display between perspective and orthogonal projections.
.PP
Pressing the right mouse button within the scene window will bring up a menu 
of options which affect how the 3D scene is drawn.  The options include
drawing the blocks as wire frames, and turning on stereo viewing.
.SH METRIC SELECTION
When the pointer cursor is active, more information about the 3D scene can 
be obtained.  Text describing the metric represented by the object under the 
cursor will be displayed in the top text box of the
.B oview
window.  The text contains the source and name of the metric, current value and
units, and the percentage of the expected maximum (or normalization) value.
The text box is updated whenever the scene is updated with the
latest metric values or when the cursor is moved over another object in the
scene.  Moving the cursor over the surrounding space will clear the text box.
.PP
Clicking the left mouse button on a object will bind the text box on that
metric instance so that the metric can be monitored while performing other
actions with the mouse.  The object will be highlighted with a red wire frame.
Clicking the left mouse button on text or the space surrounding the scene
will deselect the object, causing the text box to revert to the original
behavior of showing the metric underneath the cursor.
.PP
Multiple selections are possible by pressing the SHIFT key while selecting an
object with the left mouse button. When more than one object is selected, the
text box behaves as if nothing is selected, so the metric displayed will be the
metric currently under the cursor.
.SH MENUS
There are four menus in
.BR oview 's
user interface which allow scenes to be recorded, saved and printed
.RB ( File ),
access to the time controls
.RB ( Options ),
launching other tools
.RB ( Launch )
and
online help
.RB ( Help ).
Some menu options will change depending on the current selections and the
objects that are visible and hidden in the current scene.
.TP 4n
.B "File/Record"
When in ``live'' mode, this option will launch 
.BR pmlogger (1)
processes to record the current scene into an archive folio (see 
.BR pmafm (1))
so that it may be
replayed at a later time.  This option is not available in ``replay'' mode.

When
.B "File/Record"
is selected, a file chooser dialog will prompt for the name of the new archive
folio.  If the directory to the folio does not exist, 
.B oview
will attempt to create it.  It is usually convenient to keep each folio within
its own directory as there will be several other files associated with the
folio, including the generated archives.

Once a valid folio has been created,
.B oview
will launch a
.BR pmlogger (1)
process to collect the metrics required in the current scene.  The current
selections do not affect the set of metrics that are recorded.  

While recording is in progress, a red dot will appear in the time controls 
button in the top left-hand corner of the
.B oview
window.  The 
.B "File/Record"
option will also change to
.BR "File/Stop Recording"
as only one recording session is possible at any one time.  Selecting blocks or
launching other tools will have no affect on the recording session.

The record session may be terminated by selecting 
.BR "File/Stop Recording" .
This will display a dialog for the
.BR pmlogger (1)
instance describing the size and location of the archive files.  The red dot is
then removed from the time controls button, and the menu reverts back to
.B "File/Record"
to allow another recording session to take place.

If the application terminates while recording, a dialog will appear allowing
you to terminate the
.BR pmlogger (1)
process, or leave it running unattached.

An archive folio may be replayed using the command:
.RB `` pmafm
.I folio
.BR replay ''.
See 
.BR pmafm (1)
for more details.
.TP 4n
.B "File/Save"
Saves the current scene to a human-readable Open Inventor file (see 
.BR inventor (1)).
A file dialog will prompt for the location of the file.  The default file
extension is ``.iv'' which is recognized by
.BR ivview (1)
and some Web browsers.
.TP 4n
.B "File/Print"
Outputs the current scene to a printer.  A print dialog will be displayed
allowing a specific printer to be selected.
.TP 4n
.B "File/Quit"
.B oview
immediately exits.  If recording was active, a dialog will be displayed for
the
.BR pmlogger (1)
process so that it may be terminated.
.TP 4n
.B "Options/Show Time Control"
Displays the time controls (see
.BR pmtime (1))
that are driving this instance of
.BR oview .
The time controls may be shared by other tools, including
.BR pmchart (1), 
that have been launched by other instances of
.B oview
and
.BR pmview (1).
Therefore, this menu item may appear to have no affect if the time controls 
are already visible.
.TP 4n
.B "Options/New Time Control"
Disconnect with the current time controls (which may be shared by other tools,
see
.BR pmtime (1))
and use a new time control that is not connected to any other tools.  The new
time control will be immediately displayed.
.PP
The four remaining options in the
.B Options
menu allow the user to ``sprout'' and hide CPUs and nodes in the current scene.
The 
.B Options
menu items will change depending on the current selections and the number of
objects that are visible, so not all of these items will be available at any
one time.
.TP 4n
.B "Options/Show All Nodes"
Reveal all nodes that are currently hidden.
.TP 4n
.B "Options/Show Nodes"
Reveal all nodes attached to this router that are currently hidden.
.TP 4n
.B "Options/Show Node"
Reveal the single node attached to the selected router that is currently
hidden.
.TP 4n
.B "Options/Hide All Nodes"
Hide all nodes that are visible in the current scene.
.TP 4n
.B "Options/Hide Nodes"
Hide the nodes attached to the selected router.
.TP 4n
.B "Options/Hide Node"
Hide the selected node or the only visible node attached to the selected
router.
.TP 4n
.B "Options/Show All CPUs"
Reveal all CPUs that are currently hidden.
.TP 4n
.B "Options/Show CPUs"
Reveal all CPUs attached to the selected node or router that are currently
hidden.
.TP 4n
.B "Options/Show CPU"
Reveal the single CPU attached to the selected node or router that is currently
hidden.
.TP 4n
.B "Options/Hide All CPUs"
Hide all CPUs that are currently visible.
.TP 4n
.B "Options/Hide CPUs"
Hide all CPUs attached to the selected node or router that are currently
visible.
.TP 4n
.B "Options/Hide CPU"
Hide the selected CPU, or the single CPU attached to the selected node or
router that is currently visible.
.TP 4n
.B "Launch"
The launch menu is generated from a menu specification file (see 
.BR pmlaunch (5)).
The menu contains tools that may be launched based on the sources and names of
the selected metrics in the scene.  For example, if the selected metrics are 
from three different hosts, then three copies of a tool may be launched, 
one for each host.  The behavior of a launch depends on the selected metrics
and the tools being launched.

On selection of a
.B Launch
menu item
.BR oview
generates state information in the 
.BR pmlaunch (5)
metrics specification format.  This provides a description of the selected
metrics (or if there are no selections, all the metrics) in the scene without 
any geometry information.

Tools which can monitor multiple hosts and user specified metrics may be
launched only once for those metrics (eg 
.BR pmdumptext (1)).
Other tools which have a fixed view for one host (eg
.BR mpvis (1)),
may be
launched multiple times, once for each host in the selected metric list.  If 
the launched tools have time controls, they will share the
time controls with the launching
.BR oview .

The set of launched tools is configurable, and may include IRIX and user
applications.  See 
.BR pmlaunch (5)
for more details.
.TP 4n
.B "Help/..."
If 
.I pcp_eoe.books.help
has been installed, then the 
.BR insight (1)
books for
.B oview
are displayed.
.SH TIME CONTROLS
In addition to the menu options for time controls, the current direction of the
time controls (see
.BR pmtime (1))
is shown in a button in the top-left corner of the 
.B oview
window.  Pressing this button will display the time control and is identical 
in behavior to
.BR "Options/Show Time Control" .
.SH SCALE CONTROLS
Above the examiner window is a thumb wheel and an edit-able text box which 
allow the user to apply a multiplier to all values represented in the scene.  
Spinning the wheel to the right and/or increasing the text value for the scale
will increase the height of the bars.  Spinning the wheel to the left and/or
lowering the text value will decrease the height of the bars.  The button to 
the right of the thumb wheel will reset the scale so that the bars appear at
the original height for their current value.
.SH TIME INFORMATION
Beside the scale controls is another text box which displays the time of the
fetched metrics.  The time will change with the time controller (see
.BR pmtime (1)).
.SH APPLICATION RESOURCES
This section describes the
.B X11
application resources that can be configured by the user.
Other resources, such as those for controlling labels in the user interface
are not described here - see comments in the
.B oview
application defaults file,
.BR /usr/lib/X11/app-defaults/OView .
.PP
.TP 7
.B "OView*routerDistance"
The distance between proximal routers, relative to the router radius.
.TP 7
.B "OView*routerLinkRadius"
The radius of router-router link tubes, relative to the router radius.
.TP 7
.B "OView*axisLength"
The axis length as a proportion of
.BR routerDistance .
.TP 7
.B "OView*nodeLinkLength"
The length of node-router links relative to the length of a
router-router link.  A value of
.B 1.0
indicates equal lengths.
.TP 7
.B "OView*nodeLinkRouterProportion"
The proportion of the node-router link tube that router-metering uses
(the remainder is used for node-metering).  A value of
.B 0.5
indicates equal (balanced) proportions.
.TP 7
.B "OView*nodeRadius"
The radius of a node cylinder, relative to the router radius.
.TP 7
.B "OView*cpuHeight"
The height of a CPU block, relative to the router radius.
.TP 7
.B "OView*centerMarkLength"
The length of the center mark for router-router links, relative to the
router radius.
.TP 7
.B "OView*longBendDeviation"
The bend deviation factor for "long diagonal" router-router links,
relative to
.BR routerLinkRadius .
This is used to avoid collisions of otherwise intersecting long
diagonal link tubes.
.TP 7
.B "OView*nodeLinkRadius"
The node-router link radius relative to
.BR routerLinkRadius .
A value of
.B 1.0
specifies equal radii.
.TP 7
.B "OView*sceneXRotation"
The initial rotation of the whole scene around the X-Axis, in degrees.
.TP 7
.B "OView*sceneYRotation"
The initial rotation of the whole scene around the Y-Axis, in degrees.
.TP 7
.B "OView*antiAliasSmooth"
Whether to perform anti-aliasing.  A
.B true
value sets "fast" anti-aliasing.
.TP 7
.B "OView*antiAliasPasses"
The number of anti-aliasing passes, in the range 1 to 255.  A value of
1 (the default) disables anti-aliasing.
.TP 7
.B "OView*cpuSlack.color"
The color of the inactive part of a CPU bar.
.TP 7
.B "OView*cpuMetric1.color"
.TP 7
.B "OView*cpuMetric2.color"
.TP 7
.B "OView*cpuMetric3.color"
The colors used in the active parts of a CPU bar.
.TP 7
.B "OView*routerLinkSlack.color"
The color of the inactive part of a router link.
.TP 7
.B "OView*routerLinkMetric1.color"
.TP 7
.B "OView*routerLinkMetric2.color"
.TP 7
.B "OView*routerLinkMetric3.color"
The colors used for the three metrics showing CrayLink utilization for
router-router links.
.TP 7
.B "OView*nodeLinkMetric.color"
The color of the metric showing CrayLink utilization at the node end
of a router-node link.  This is normally the same as
.BR routerLinkMetric1.color .
.TP 7
.B "OView*evenRouter.color"
.TP 7
.B "OView*oddRouter.color"
The alternating (even/odd) colors of all routers with "insignificant"
utilization (utilization less than
.BR routerLevel1.legend ).
By default the same color is used for both.
.TP 7
.B "OView*routerLevel1.color"
.TP 7
.B "OView*routerLevel2.color"
.TP 7
.B "OView*routerLevel3.color"
.TP 7
.B "OView*routerLevel4.color"
The color legend for router utilization.  A router will be drawn with
.BR routerLeveln.color
if its associated utilization threshold (\c
.BR routerLeveln.legend )
is exceeded.
.TP 7
.B "OView*routerLevel1.legend"
.TP 7
.B "OView*routerLevel2.legend"
.TP 7
.B "OView*routerLevel3.legend"
.TP 7
.B "OView*routerLevel4.legend"
The floating point utilization threshold values for the router
utilization color legend above.  The values should be increasing in
the range from 0.0 to 1.0 where 1.0 represents 100% utilization.
.TP 7
.B "OView*node.color"
The color of nodes with "insignificant" utilization (utilization less
than
.BR nodeLevel1.legend ).
.TP 7
.B "OView*nodeLevel1.color"
.TP 7
.B "OView*nodeLevel2.color"
.TP 7
.B "OView*nodeLevel3.color"
.TP 7
.B "OView*nodeLevel4.color"
The color legend for node migration interrupt utilization.
A node will be drawn with
.BR nodeLeveln.color
if its associated utilization threshold (\c
.BR nodeLeveln.legend )
is exceeded.
.TP 7
.B "OView*nodeLevel1.legend"
.TP 7
.B "OView*nodeLevel2.legend"
.TP 7
.B "OView*nodeLevel3.legend"
.TP 7
.B "OView*nodeLevel4.legend"
The floating point utilization values for the node migration interrupt
utilization color legend resources described above.  The values should
be increasing in the range from 0.0 to 1.0 where 1.0 represents 100%
utilization (relative to
.BR migrUtilModulationScale ).
.TP 7
.B "OView*join.color"
The color of the inactive center (join) section of long links.
.TP 7
.B "OView*centerMark.color"
The router link center marker color.
.TP 7
.B "OView*linkWarn.color"
The color for unrecognized link-type alerts.  If any links appear in
this color then it is likely the
.B oview_layout
program has incorrectly resolved the system topology or a
syntactically correct but semantically invalid configuration file was
supplied with the
.B \-c
command line option.
.TP 7
.B "OView*routerUtilModulationScale"
The maximum value for CrayLink utilization.  Since the router metrics
are already normalized to 100%, this resource should never need to be
changed.
.TP 7
.B "OView*cpuUtilModulationScale"
The maximum CPU utilization (in milliseconds per second).  This
resource should not be changed from 1000.
.TP 7
.B "OView*nodeUtilModulationScale"
The maximum migration interrupt rate (per second) for determining
migration interrupt utilization.  This may be changed from the default
of 10 interrupts per second equals 100%.
.TP 7
.B "OView*nodeMetric"
The metric for modulating nodes in the scene.  The default is
.IR origin.numa.migr.intr.total ,
but this can be changed to any other metric with the node instance domain.  In
other words, a metric which also represents nodes.  For example, to monitor the
free memory available on each node, this resource can be set to 
.IR origin.node.free.total .
The modulation scale 
.B "OView*nodeUtilModulationScale"
must also be set to the maximum physical memory on any
node, which can be obtained from the metric
.IR origin.node.physmem .
There is no mechanism at this time for specifying different scales for
each node.  The color scale must also be specified in reverse as low
values indicate the lack of free memory.  For example, for a system
with 256 Meg of physical memory on each node, the resources to monitor
memory usage could be:
.PP
.in 1.5i
.ft CW
.nf
OView*nodeMetric: origin.node.free.total
OView*nodeUtilModulationScale: 268435456
OView*node.color: red
OView*nodeLevel1.color: orange
OView*nodeLevel1.legend: 0.2
OView*nodeLevel2.color: magenta
OView*nodeLevel2.legend: 0.4
OView*nodeLevel3.color: blue
OView*nodeLevel3.legend: 0.6
OView*nodeLevel4.color: light yellow
OView*nodeLevel4.legend: 0.8
.fi
.ft R
.in
.TP 7
.B OView*saturation
The saturation multiplier for all modulated objects.  The default saturation
multiplier is set to 1.05 which allows for a 5% error in metric values due to
rate calculations using slightly inaccurate time deltas.  Therefore, a
metric which exceeds the modulation scale by more than 5% is considered
saturated. However, the modulation of an object never actually exceeds 100%.
In other words a height modulated object will never exceed the maximum
height even if the point of saturation is larger than 100%.
.PP
Default values for these resources are supplied in the
.B oview
application defaults file,
.BR /usr/lib/X11/app-defaults/OView .
Consult the
.BR X (1)
man page for details of the syntax for standard
.B X11 
geometry resources
and other standard resources.
.SH CONFIGURATION FILE SYNTAX
The syntax of the
.B oview
configuration file
is described in the
.BR oview_layout (1)
man page.
.SH FILES
.TP 8
.BI /var/pcp/pmns/ *
default PMNS specification files
.TP
.B /usr/lib/X11/app-defaults/OView
the application defaults file
.TP
.B /var/pcp/config/pmlogger/config.oview
.BR pmlogger (1)
configuration file suitable for use with
.B oview
.TP
.B /var/pcp/config/pmlaunch/*
global configuration files controlling the
.B Launch
menu contents
.TP
.B $HOME/.pcp/pmlaunch/pmlaunchrc
user specific configuration files controlling the
.B Launch
menu contents
.PD
.SH CAVEAT
.PP
The algorithm for 3-D layout of Origin system components by
.BR oview (1)
is complex, and relies on heuristics.
If you encounter a configuration that is not displayed as expected,
please send e-mail to 
.B pcp-info@sgi.com
including a description of the problem, and attaching the output from
.sp
.ti+1i
.ft CW
pminfo -f hinv
.ft R
.PP
A known area of layout difficulty occurs in configurations with many
links with diagonal portions in the same vicinity; 
.B oview
might draw connections on top of one another in the 3-D scene.
.SH SEE ALSO
.BR mpvis (1),
.BR oview_layout (1),
.BR PCPintro (1),
.BR pmafm (1),
.BR pmcd (1),
.BR pmdumptext (1),
.BR pminfo (1),
.BR pmlogger (1),
.BR pmtime (1),
.BR X (1),
.BR environ (5)
and
.BR pmlaunch (5).
.SH DIAGNOSTICS
Are intended to be self explanatory.  The environment variable 
.B PCP_STDERR
can be set to force most startup warnings and errors to be posted in a
dialog rather than sent to standard error.  See
.BR PCPintro (1)
for more details.
