calmsacibis995/irix-6517-src/eoe/man/man1/ProclaimServerMgr.1
'\"macro stdmacro
.TH ProclaimServerMgr 1M "29 Jan 1996"
.UC 5
.SH NAME
ProclaimServerMgr \- graphical interface for proclaim server configuration
.SH SYNOPSIS
\fB/usr/sbin/ProclaimServerMgr\fR 
.SH DESCRIPTION
.I ProclaimServerMgr
is a graphical front end that displays the status and configuration
of the \fIproclaim\fR server running on the local host.
It displays the set of IP addresses and lease times that are currently assigned.
Proclaim is an implementation of DHCP (dynamic host configuration protocol).
.P
The \fBFile\fR button on the main window opens a pull-down menu
for editing options and configuration files.
.P
The \fBOptions\fR menu choice allows you to edit \fIproclaim\fR server options
defined in the \fI/etc/config/proclaim_server.options\fR file.
.P
The \fBConfiguration\fR menu choice allows you to
add, delete, and edit configuration parameters.
Configurations are saved in files and
define the IP addresses, lease times, and other options returned to clients.
See \fIdhcp_bootp(1M)\fR for details about configuration parameters.
.P
To view messages logged by the server in the system log file
(\fI/var/adm/SYSLOG\fR), launch \fIsysmon(1M)\fR from the main window
by choosing the \fBSystem Log Viewer\fR menu item.
.P
You can disable or enable DHCP by clicking the
\fBProclaim Server On/Off\fR button in the main window. 
.SH FILES
.nf
/etc/config/dhcp_bootp.options
/var/adm/SYSLOG
/var/dhcp/etherToIP
/var/dhcp/config/config.Default
.fi
.SH "SEE ALSO"
chkconfig(1M), dhcp_bootp(1M), dhcp_relay(1M), proclaim(1M),
ProclaimRelayMgr(1M), syslogd(1M)
