calmsacibis995/irix-6517-src/eoe/man/man1/run-proclaim.1
.TH run\-proclaim 1M "29 Jan 1996"
.SH NAME
run-proclaim \- proclaim initialization, shutdown, and status script
.SH SYNOPSIS
.nf
\f3/etc/init.d/run-proclaim\f1 [ \f3start\f1 | \f3stop\f1 | \c
\f3surrender\f1 | \f3verify\f1 | \f3status\f1 ]
.fi
.SH DESCRIPTION
The
.I run-proclaim
shell script is called during system startup from
.I /etc/rc2
to obtain (or verify) an IP address and host configuration parameters.
The script is called during system shutdown from
.I /etc/rc0
to gracefully kill the
.IR proclaim (1)
client.
.P
The arguments to
.I run-proclaim
are:
.TP 11
.B start
Do the following,
using the configuration flags described below:
.RS
.IP \(bu 3
Kill any existing
.I proclaim
clients.
.IP \(bu 3
Run the
.I proclaim
client with the
.B \-i
option to verify an existing lease if one exists and
obtain a new address lease if one does not exist. This 
option also invokes the 
.I proclaim
client for any non-primary interfaces on the system depending on 
options specified in the 
.I /etc/config/proclaim.options 
file.
.IP \(bu 3
Run the 
.I /usr/etc/dhcpcopt
script to act on options received by the client. For example, if 
a router address was returned it is used to setup a static route.
.RE
.TP
.B stop
Gracefully terminate the client.
.TP
.B surrender
Signal a running
.I proclaim
client to terminate the lease.
.TP
.B verify
Signal a running
.I proclaim
client to verify the existing address and extend or obtain a lease.
.TP
.B status
Display the current status of the address lease as it
was recorded in the
.I /var/adm/proclaim.lease_info
file when the lease was obtained.
.SH "CONFIGURATION FLAGS"
A daemon or subsystem is enabled if its configuration flag in the
\f2/etc/config\fP directory is in the \f3on\f1 state.
If a flag file is missing, the flag is considered off.
Use the
.IR chkconfig (1M)
command to turn a flag on or off.
For example,
.Ex
\f4chkconfig timed on\f1
.Ee
enables the \f3timed\f1 flag.
When invoked without arguments,
.I chkconfig
prints the state of all known flags.
.P
There are two flags, \f3verbose\f1 and \f3autoconfig_ipaddress\f1
that control the
behavior of the
.I run\-proclaim
script.
The \f3verbose\f1 flag controls the printing of messages from the script.
The \f3autoconfig_ipaddress\f1 flag controls the use of the
.I proclaim
client for auto configuration of the host.
If auto configuration and address leases are not in use then this flag should
be turned off.
.P
Site-dependent options for
.I proclaim
belong in the
.I /etc/config/proclaim.options
file.
.P
See
.I /etc/init.d/run\-proclaim
for the general format of the script.
.SH FILES
.ta \w'/etc/config/proclaim.options\ \ \ \ \ 'u
.nf
/etc/rc0.d/K41proclaim	linked to \f2/etc/init.d/run-proclaim\f1
/etc/rc2.d/S31proclaim	linked to \f2/etc/init/d/run-proclaim\f1
/etc/config/proclaim.options	values of options; see \f2proclaim\f1(1M)
/var/adm/proclaim.lease_info*	status of current address lease
/usr/etc/dhcpcopt	script file to act on options values
.fi
.SH "SEE ALSO"
chkconfig(1M),
proclaim(1M),
rc0(1M),
rc2(1M).
