calmsacibis995/irix-6517-src/eoe/man/man1/uname.1
'\"macro stdmacro
.if n .pH g1.uname @(#)uname	30.3 of 1/29/86
.nr X
.if \nX=0 .ds x} UNAME 1 "Essential Utilities" "\&"
.if \nX=1 .ds x} UNAME 1 "Essential Utilities"
.if \nX=2 .ds x} UNAME 1 "" "\&"
.if \nX=3 .ds x} UNAME "" "" "\&"
.TH \*(x}
.SH NAME
uname \- identify the current \s-1IRIX\s+1 system
.SH SYNOPSIS
.B uname
[
.B \-snrvmpadR
]
.P
.B uname
[
.B \-V
INSTVERSIONNUM ]
.P
.B uname
[
.B \-S
nodename ]
.SH DESCRIPTION
.I uname\^
prints information that identifies the current \s-1IRIX\s+1 system 
to standard output. The string \s-1IRIX64\s+1 is printed on systems
that support 64-bit addressing (pointers); also see the
.B KERN_POINTERS
argument to
.IR sysconf (1).
.P
The options cause selected information returned by
.IR uname (2)
to be printed:
.TP
.B \-a
Behave as though all of the options 
.B \-mnrsv
were specified.
.TP
.B \-m
Print the machine hardware name.
This is the type of CPU board that the system is running on, e.g.
.BR IP22 .
.TP
.B \-n
Print the hostname or nodename.
The nodename is the name by which the system is known to communications
networks.
.TP
.B \-p
Print the (informal) name of the current system's instruction set
architecture.  See the \f3SI_ARCHITECTURE\fP section of \f4sysinfo\fP(2).
.TP
.B \-r
Print the operating system release.
This string begins with one of the following forms:
.I m.n
or
.I m.n.a
where
.I m
is the major release number,
.I n
is the minor release number and
.I a
is the (optional) maintenance level of the release;
e.g.
.BR 3.2
or
.BR 3.2.1\^\^ .
.TP
.B \-R
Print the extended release name, usually the name of a hardware
specific release.  Implies the
.B \-r
option.  The string returned will be empty (that is, the
.B \-r
and
.B \-R
options will produce the same output) on the base OS release.
This option shows additional information similar to that printed
on the CD label for hardware specific releases.
.TP
.B \-s
Print the (operating) system name (the default).
.TP
.BR \-S \ \f4nodename\fP
Change the hostname or nodename to the specified \f4nodename\fP.
This changes only the runtime name, and is normally unused.
The
.IR hostname (1)
command is the recommended method of setting this field, because
it will allow for longer names.  
.I hostname
uses the contents of
.B /etc/sys_id
to set the name during system startup.
Only the super-user is allowed this capability.
.TP
.B \-v
Print the operating system version.
This is the date and time that the operating system was generated, 
and has the form:
.IR mmddhhmm .
.PP
The 
.B \-d
and 
.B \-V
options decode the inst version-number, a 10-digit integer that, if present,
is the last field in the release-name string returned by `\f2uname \-r\f1'.
Alpha and Beta releases have inst version-numbers, final releases do not.
This number represents encoded information about the origin of the release.
.PP
`\f2uname \-d\f1' attempts to report the running system's inst version
information; if the release has no inst version-number,
.I uname\^
displays an error message.
.PP
`\f2uname \-V INSTVERSIONNUM\f1' interprets and displays the information
encoded in INSTVERSIONNUM; if the number is invalid,
.I uname\^
displays an error message.
.SH NOTES
Do not confuse the 8-digit version number returned by 
`\f2uname \-v\f1'--present in all releases--with the 10-digit inst 
version-number.  The two serve different--if somewhat overlapping--purposes.
.SH "SEE ALSO"
hostname(1), inst(1M), sysconf(1), versions(1M),
uname(2), sysinfo(2),
sys_id(4)
.\"	@(#)uname.1	6.2 of 9/2/83
.Ee
'\".so /pubs/tools/origin.att
