#ifndef __RACER_HEART_H__
#define __RACER_HEART_H__
/*
 * heart.h - heart chip header file
 *
 * Copyright 1996, Silicon Graphics, Inc.
 * ALL RIGHTS RESERVED
 *
 * UNPUBLISHED -- Rights reserved under the copyright laws of the United
 * States.   Use of a copyright notice is precautionary only and does not
 * imply publication or disclosure.
 *
 * U.S. GOVERNMENT RESTRICTED RIGHTS LEGEND:
 * Use, duplication or disclosure by the Government is subject to restrictions
 * as set forth in FAR 52.227.19(c)(2) or subparagraph (c)(1)(ii) of the Rights
 * in Technical Data and Computer Software clause at DFARS 252.227-7013 and/or
 * in similar or successor clauses in the FAR, or the DOD or NASA FAR
 * Supplement.  Contractor/manufacturer is Silicon Graphics, Inc.,
 * 2011 N. Shoreline Blvd. Mountain View, CA 94039-7311.
 *
 * THE CONTENT OF THIS WORK CONTAINS CONFIDENTIAL AND PROPRIETARY
 * INFORMATION OF SILICON GRAPHICS, INC. ANY DUPLICATION, MODIFICATION,
 * DISTRIBUTION, OR DISCLOSURE IN ANY FORM, IN WHOLE, OR IN PART, IS STRICTLY
 * PROHIBITED WITHOUT THE PRIOR EXPRESS WRITTEN PERMISSION OF SILICON
 * GRAPHICS, INC.
 */
#ident "$Revision: 1.95 $"
/*
 * heart.h - heart chip header file
 */
#define	HEART_CHIP	1

/* Notes:  All Heart registers are 64 bits wide.  Heart is defined
 * to be hardwired to widget 0x8, see sys/xtalk/xbow.h ...
 */

#if LANGUAGE_C
#include "../iobus.h"
#include "../xtalk/xtalk.h"
#endif
#include "../xtalk/xwidget.h"

#if LANGUAGE_C

#define	ERRTYPE_ALL			(ERRTYPE_XBAR_CREDIT_OVER |	\
					 ERRTYPE_XBAR_CREDIT_UNDER |	\
					 ERRTYPE_IO_NONHEAD |		\
					 ERRTYPE_IO_BAD_FORMAT |	\
					 ERRTYPE_IO_UNEXPECTED_RESP_ERR | \
					 ERRTYPE_IORWRB_OFLOW_ERR |	\
					 ERRTYPE_IOR_CMD_ERR |		\
					 ERRTYPE_IOR_CMD_WARN |		\
					 ERRTYPE_IOR_INT_VEC_ERR |	\
					 ERRTYPE_IOR_INT_VEC_WARN |	\
					 ERRTYPE_LLP_RCV_WARM_RST |	\
					 ERRTYPE_LLP_RCV_LNK_RST |	\
					 ERRTYPE_LLP_RCV_SN_ERR |	\
					 ERRTYPE_LLP_RCV_CB_ERR |	\
					 ERRTYPE_LLP_RCV_SQUASH_DATA |	\
					 ERRTYPE_LLP_TX_RETRY_TIMEOUT |	\
					 ERRTYPE_LLP_TX_RETRY |		\
					 ERRTYPE_LLP_RCV_CNT_255 |	\
					 ERRTYPE_LLP_TX_CNT_255 |	\
					 ERRTYPE_PIO_RD_TIMEOUT |	\
					 ERRTYPE_PIO_WR_TIMEOUT |	\
					 ERRTYPE_PIO_XTLK_ACC_ERR |	\
					 ERRTYPE_PIO_WCR_ACC_ERR)

/* bits in the HEART_WID_PIO_ERR_UPPER register */
#define HW_PIO_ERR_PROC_ID_SHFT		22
#define HW_PIO_ERR_PROC_ID		(HEARTCONST 0x3 << HW_PIO_ERR_PROC_ID_SHFT)
#define HW_PIO_ERR_UNC_ATTR		(HEARTCONST 0x3 << 20)
#define HW_PIO_ERR_SYSCMD		(HEARTCONST 0x7ff << 8)
#define HW_PIO_ERR_SYSCMD_WR_CMD	(HEARTCONST 0x1 << 15)
#define HW_PIO_ERR_ADDR			(HEARTCONST 0xff << 0)

/* bits in the HEART_WID_PIO_ERR_LOWER register */
#define	HW_PIO_ERR_LOWER_ADDR	(HEARTCONST 0xffffffff << 0)    /* PhysAddr */

/* bits in the HEART_WID_PIO_RTO_ADDR register */
#define	HW_PIO_RTO_ERR_PROC_ID_SHFT	18		
#define	HW_PIO_RTO_ERR_PROC_ID		(HEARTCONST 0x3 << HW_PIO_RTO_ERR_PROC_ID_SHFT)
#define	HW_PIO_RTO_ERR_IOSPACE		(HEARTCONST 0x3 << 16)
#define	HW_PIO_RTO_ERR_DIDN		(HEARTCONST 0xf << 12)
#define	HW_PIO_RTO_ERR_ADDR		(HEARTCONST 0xfff << 0)

/* System memory -- 31.5 GB to 08 0000 0000 */
#define	SYSTEM_MEMORY_ALIAS_SIZE	0x00004000
#define SYSTEM_MEMORY_BASE		0x20000000

#define	ABS_SYSTEM_MEMORY_BASE		0x20000000
#define	ABS_SYSTEM_MEMORY_TOP		0x800000000

#define PHYS_RAMBASE            SYSTEM_MEMORY_BASE
#define K0_RAMBASE              PHYS_TO_K0(PHYS_RAMBASE)
#define K1_RAMBASE              PHYS_TO_K1(PHYS_RAMBASE)
#define PHYS_TO_K0_RAM(x)       PHYS_TO_K0((x)+PHYS_RAMBASE)
#define PHYS_TO_K1_RAM(x)       PHYS_TO_K1((x)+PHYS_RAMBASE)

#define	TID_MEMORY		HEART_ID	/* local memory target id */

/* The Heart chip is the system interrupt controller.  Direct all
 * interrupts to its target id, and interrupt address.
 */
#define INT_DEST_TARGET		HEART_ID
#define INT_DEST_ADDR		HEART_XTALK_ISR

#define INT_DEST_UPPER(vec) \
	(((vec)<<24) | (INT_DEST_TARGET<<16) |(int)((INT_DEST_ADDR>>32)&0xffff))
#define INT_DEST_LOWER 		(INT_DEST_ADDR&0xffffffff)

#define	HEART_CREDIT	4

/* Xtalk is normally 400 Mhz (4*IO clock).  Heart updates every 8 IO clock
 * cycles.
 */
#if EMULATION || SABLE
#define X_CLK_RATE		((1 * 1000 * 1000) * 2)
#else
#define X_CLK_RATE		((100 * 1000 * 1000) * 4)
#endif
#define HEART_IOCLK_FREQ        (X_CLK_RATE / 4)
#define HEART_COUNT_RATE	(HEART_IOCLK_FREQ / 8)
/* Heart count is 80 ns */
#define HEART_COUNT_NSECS ((1000 * 1000 * 1000)/HEART_COUNT_RATE)

#if LANGUAGE_C

typedef volatile struct heart_cfg_s {	/* at HEART_BASE (0x00_1w00_0000) */
	widget_cfg_t		h_widget;		/* +0x00 */

#define	h_wid_id		h_widget.w_id			/* +0x04 */
#define	h_wid_status		h_widget.w_status		/* +0x0c */
#define	h_wid_err_upper_addr	h_widget.w_err_upper_addr	/* +0x14 */
#define	h_wid_err_lower_addr	h_widget.w_err_lower_addr	/* +0x1c */
#define	h_wid_control		h_widget.w_control		/* +0x24 */
#define	h_wid_req_timeout	h_widget.w_req_timeout		/* +0x2c */
    /* no wid_intdest_upper	h_widget.w_intdest_upper_addr	   +0x34 */
    /* no wid_intdest_lower	h_widget.w_intdest_lower_addr	   +0x3c */
#define	h_wid_err_cmd_word	h_widget.w_err_cmd_word		/* +0x44 */
#define	h_wid_llp_cfg		h_widget.w_llp_cfg		/* +0x4c */
#define	h_wid_tflush		h_widget.w_tflush		/* +0x54 */

	heartreg_t		h_wid_reserved_0;	/* +0x58 */
	heartreg_t		h_wid_err_type;		/* +0x60 */
	heartreg_t		h_wid_err_mask;		/* +0x68 */
	heartreg_t		h_wid_pio_err_upper;	/* +0x70 */
	heartreg_t		h_wid_pio_err_lower;	/* +0x78 */
	heartreg_t		h_wid_isr;		/* +0x80 */
	heartreg_t		h_wid_reserved_1;	/* +0x88 */
	heartreg_t		h_wid_pio_rdto_addr;	/* +0x90 */
} heart_cfg_t;

typedef volatile struct heart_piu_s {	/* at HEART_PIU_BASE (0x00_0FF0_0000) */
	heartreg_t		h_mode;			/* +0x00000 */
	heartreg_t		h_sdram_mode;		/* +0x00008 */
	heartreg_t		h_mem_ref;		/* +0x00010 */
	heartreg_t		h_mem_req_arb;		/* +0x00018 */

	union {
		heartreg_t	reg[4];		/* by 64-bit hw registers */
		__uint32_t	bank[8];	/* per-bank data */
	}			h_memcfg;		/* +0x00020 */

	heartreg_t		h_fc_mode;		/* +0x00040 */
	heartreg_t		h_fc_timer_limit;	/* +0x00048 */
	heartreg_t		h_fc_addr[2];		/* +0x00050 */
	heartreg_t		h_fc_cr_cnt[2];		/* +0x00060 */
	heartreg_t		h_fc_timer[2];		/* +0x00070 */
	heartreg_t		h_status;		/* +0x00080 */
	heartreg_t		h_berr_addr;		/* +0x00088 */
	heartreg_t		h_berr_misc;		/* +0x00090 */
	heartreg_t		h_memerr_addr;		/* +0x00098 */
	heartreg_t		h_memerr_data;		/* +0x000a0 */
	heartreg_t		h_piur_acc_err;		/* +0x000a8 */
	heartreg_t		h_mlan_clk_div;		/* +0x000b0 */
	heartreg_t		h_mlan_ctl;		/* +0x000b8 */
	char __pad0[0x00F40];
	heartreg_t		h_piu_undef;		/* +0x01000 undefined reg, for diagnostics */
	char __pad1[0x0EFF8];
	heartreg_t		h_imr[4];		/* +0x10000 */
	heartreg_t		h_set_isr;		/* +0x10020 */
	heartreg_t		h_clr_isr;		/* +0x10028 */
	heartreg_t		h_isr;			/* +0x10030 */
	heartreg_t		h_imsr;			/* +0x10038 */
	heartreg_t		h_cause;		/* +0x10040 */
	char __pad2[0x0FFB8];
	heartreg_t		h_count;		/* +0x20000 */
	char __pad3[0x0FFF8];
	heartreg_t		h_compare;		/* +0x30000 */
	char __pad4[0x0FFF8];
	heartreg_t		h_trigger;		/* +0x40000 */
	char __pad5[0x0FFF8];
	heartreg_t		h_prid;			/* +0x50000 */
	char __pad6[0x0FFF8];
	heartreg_t		h_sync;			/* +0x60000 */
} heart_piu_t;

typedef struct {
    unsigned		pad	:12;
    unsigned		cpu	:2;
    unsigned		ios	:2;
    unsigned		didn	:4;
    unsigned		addr	:12;
}	h_wid_pio_rdto_addr_f;

typedef union {
    widgetreg_t			r;
    h_wid_pio_rdto_addr_f	f;
}	h_wid_pio_rdto_addr_u;

#if LANGUAGE_ASSEMBLY || _STANDALONE	/* use struct in kernel */
/*
 * HEARTREG takes as a parameter one of the heart register name macros
 * supplied above. The resulting construct is a volatile lvalue
 * representing the specified register on the heart chip addressed
 * through the COMPATK1 address space.
 */
#define	HEARTREG(phys)	(*((volatile heartreg_t *) PHYS_TO_COMPATK1((phys))))
#endif

#ifdef _STANDALONE
void init_heart(heart_piu_t *heart, heart_cfg_t *heartcfg);
void heart_clearnofault(void);
#elif _KERNEL
void heart_mp_intr_init(cpuid_t);
#endif	/* _STANDALONE/_KERNEL */

/* ========================================================================
 */

