calmsacibis995/irix-6517-src/eoe/man/man5/DIFFsource.5
'\"macro stdmacro
.TH DIFFsource 5
.SH NAME
DIFFsource \- archive of DIFF sources
.SH DESCRIPTION
The file
.B /usr/src/rcs/DIFFsource.Z
contains
the compressed cpio archive of compilable
sources for the port of DIFF version 1.15 to
Silicon Graphics systems.
This source is provided to you under the terms of
the GNU General Public License, as described below.
.P
To decompress this source archive
create a new directory, change to that
directory (cd), and issue the command:
.PP
zcat /usr/src/rcs/DIFFsource.Z | cpio -icv
.PP
View the decompressed file README for further instructions
on how to rebuild this product, and for a list
of the changes made to DIFF 1.15 as part
of this port.
.PP
DIFF is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 1, or (at your option)
any later version.
.PP
DIFF is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
See the
GNU General Public License for more details.
.PP
You should have received a copy of the GNU General Public License
along with DIFF; see the file COPYING.
If not, write to
the Free Software Foundation, 675 Mass Ave, Cambridge, MA 02139, USA.
.SH FILES
.PD 0
.TP 12
.B /usr/src/rcs/DIFFsource.Z
Compressed cpio archive
of sources for port of DIFF version 1.15 to
Silicon Graphics systems.
.SH SEE ALSO
bdiff(1),
cc(1),
cmp(1),
comm(1),
diff(1),
diff3(1),
odiff(1)
