calmsacibis995/irix-6517-src/eoe/man/man5/dominance.5
'\"! tbl | mmdoc
'\"macro stdmacro
.if n .pH g3.mac_dom
.nr X
.if \nX=0 .ds x} DOMINANCE 5 "Mandatory Access Control Files" "\&"
.if \nX=1 .ds x} DOMINANCE 5 "Mandatory Access Control Files"
.if \nX=2 .ds x} DOMINANCE 5 "" "\&"
.if \nX=3 .ds x} DOMINANCE 5 "" "\&"
.ds Lc /etc/mac_label/categorynames
.ds Ld /etc/mac_label/divisionnames
.ds Lg /etc/mac_label/gradenames
.ds Ll /etc/mac_label/labelnames
.ds Lv /etc/mac_label/levelnames
.ds Li /etc/mac_label/minttypenames
.ds Ls /etc/mac_label/msentypenames
.ds As \v'+.3'\s-1\&S\s0\v'-.3'
.ds Ai \v'+.3'\s-1\&I\s0\v'-.3'
.ds Bs \v'+.3'\s-1\&S\s0\v'-.3'
.ds Bi \v'+.3'\s-1\&I\s0\v'-.3'
.TH \*(x}
.SH NAME
dominance \- \s-1MAC\s+1 label comparison policy
.SH SYNOPSIS
.B #include <sys/mac_label.h>
.SH DESCRIPTION
On systems with mandatory access control (MAC) enabled,
the set of all possible Mandatory Access Control 
(\s-1MAC\s+1) labels constitutes a lattice, where a lattice is defined 
to be a partially ordered set for which there exists, for every pair of 
elements in the set, a greatest lower bound (\s-1GLB\s+1) and a least 
upper bound (\s-1LUB\s+1).
A partial ordering over a set is defined by a relation that has the
following three properties:  reflexive, antisymmetric, transitive.  
The reflexive property states that every element in the set is "related" to 
itself.
The antisymmetric property states that given two elements in the set, if the first
element is "related" to the second element, and the second element is "related" 
to the first element, then the two elements are necessarily equal.
The transitive property states that given three elements in the set, if the
first element is "related" to the second element, and the second element is 
"related" to the third element, then the first element is also "related" to 
the third element.
.P
A simple example of this is the improper subset relation:
.P
.in+3
.TS
l lw(4i).
Reflexive:	T{
Given a set A, A is an improper subset of A
T}
Antisymmetric:	T{
Given two sets A and B, if A is an improper
subset of B and B is an improper subset of A,
then A and B are equal (i.e., the same set).
T}
Transitive:	T{
Given three sets A, B, and C,
if A is an improper subset of B and B is an
improper subset of C, then A is an improper
subset of C.
T}
.TE
.in-3
.P
\fIdominance\fP represents the relation providing the partial ordering over 
the lattice formed by the set of all possible \s-1MAC\s+1 labels.
Hence, the \fIdominance\fP relation upholds the three properties described
above over the set of all possible \s-1MAC\s+1 labels.
.P
.ne3.5i
A \s-1MAC\s+1 label is defined as follows:
.P
.TS
l l.
structure mac_label{	unsigned char   ml_msen_type;
\&	unsigned char   ml_mint_type;    
\&	unsigned char   ml_level;       
\&	unsigned char   ml_grade;      
\&	unsigned short  ml_catcount;  
\&	unsigned short  ml_divcount; 
\&	unsigned short  ml_list[MAC_MAX_SETS]; }
.TE
.P
A \s-1MAC\s+1 label comprises both a Mandatory Sensitivity (\s-1MSEN\s+1) 
label portion and a Mandatory Integrity (\s-1MINT\s+1) label portion. 
With respect to the above definition of \s-1MAC\s+1 label; 
the \s-1MSEN\s+1 label portion includes 1) ml_msen_type, 2) ml_level, 
3) ml_catcount, and 4) the first ml_catcount elements in ml_list[MAC_MAX_SETS],
while 
the \s-1MINT\s+1 label portion includes 1) ml_mint_type, 2) ml_grade,
3) ml_divcount, and 4) the last ml_divcount elements in ml_list[MAC_MAX_SETS].
.P
The determination of whether one \s-1MAC\s+1 label dominates another
\s-1MAC\s+1 label depends at the highest level simply upon whether the 
\s-1MSEN\s+1 label portions compare as required and whether the \s-1MINT\s+1 
label portions compare as required.  
By definition, for any two \s-1MAC\s+1 labels A and B, A dominates B 
if and only if the \s-1MSEN\s+1 label portion of A dominates the \s-1MSEN\s+1 
label portion of B and the \s-1MINT\s+1 label portion of A is dominated by the 
\s-1MINT\s+1 label portion of B.
However, comparison of \s-1MSEN\s+1 label portions and \s-1MINT\s+1 label
portions is more complicated, and may take one of two different paths.
Specifically, given two \s-1MAC\s+1 labels A and B: 
the ml_msen_types are read and based on their values either an \s-1MSEN\s+1 
dominance determination is made or it is determined that comparison of 
ml_levels, ml_catcount, and ml_lists is required;
the ml_mint_types are read and based on their values either a \s-1MINT\s+1 
dominance determination is made or it is determined that comparison of 
ml_grades, ml_divcount, and ml_lists is required.
.P
Specifically, a \s-1MAC\s+1 label includes an \s-1MSEN\s+1 label type as part 
of the \s-1MSEN\s+1 label portion and a \s-1MINT\s+1 label type as part of 
the \s-1MINT\s+1 label portion. 
The predefined set of valid system \s-1MSEN\s+1 label type values is: 
\fImsenadmin\fP, 
\fImsenequal\fP, 
\fImsenhigh\fP, 
\fImsenmldhigh\fP, 
\fImsenlow\fP, 
\fImsenmldlow\fP, 
\fImsenmld\fP,  and   
\fImsentcsec\fP.
The predefined set of valid system \s-1MINT\s+1 label type values is: 
\fImintequal\fP, 
\fIminthigh\fP, 
\fImintlow\fP and 
\fImintbiba\fP. 
Each of the \s-1MSEN\s+1 label type set and the \s-1MINT\s+1 label type set 
constitute a lattice, in that there exists a fully defined comparison
relation between each pair of \s-1MSEN\s+1 label types and each pair of 
\s-1MINT\s+1 label types, i.e. either they are equal, one dominates the other, 
they are non-comparable, or further comparison of the other relevant component 
fields is required.
.P
In particular, for all \s-1MAC\s+1 labels containing the following \s-1MSEN\s+1 
label types, 
\fImsenadmin\fP, 
\fImsenequal\fP, 
\fImsenhigh\fP, 
\fImsenmldhigh\fP, 
\fImsenlow\fP and 
\fImsenmldlow\fP, 
the comparison relation between the \s-1MSEN\s+1 label portions of two 
\s-1MAC\s+1 labels is entirely dependent upon only the \s-1MSEN\s+1 label types.
In addition, for all \s-1MAC\s+1 labels containing the following \s-1MINT\s+1 
label types, 
\fImintequal\fP, 
\fIminthigh\fP and 
\fImintlow\fP, 
the comparison relation between the \s-1MINT\s+1 label portions of two 
\s-1MAC\s+1 labels is entirely dependent upon only the \s-1MINT\s+1 label types.
In other words, given two \s-1MAC\s+1 labels A and B, where either comprises 
one of the \s-1MSEN\s+1 label types and one of the \s-1MINT\s+1 label types 
referenced above, the comparison relation between the two labels is fully 
defined.
.P
Additionally, in the case where a \s-1MAC\s+1 label contains an \s-1MSEN\s+1 
label type of 
\fImsenmld\fP or 
\fImsentcsec\fP
there must be included the level and the (possibly empty) category set 
component fields as part of the \s-1MSEN\s+1 label portion.  
Analogously, in the case where a \s-1MAC\s+1 label contains a \s-1MINT\s+1 
label type of 
\fImintbiba\fP 
there must be included the grade and (possibly empty) division set component 
fields as part of the \s-1MINT\s+1 label portion.
.nr Tn (\w'3.)'+1.5n)/1n
Then given two \s-1MAC\s+1 labels A and B, there are three possible situations 
that result:
.TP \n(Tn
1.)
Both \s-1MAC\s+1 labels comprise one of the \s-1MSEN\s+1 label types 
\fImsenmld\fP or
\fImsentcsec\fP
and the \s-1MINT\s+1 label type 
\fImintbiba\fP. 
.TP
2.)
Both \s-1MAC\s+1 labels comprise one of the \s-1MSEN\s+1 label types 
\fImsenmld\fP or
\fImsentcsec\fP
along with comparable \s-1MINT\s+1 label types (not \fImintbiba\fP), 
.TP
3.)
Both \s-1MAC\s+1 labels comprise the \s-1MINT\s+1 label type 
\fImintbiba\fP
along with comparable \s-1MSEN\s+1 label types (not \fImsenmld\fP or 
\fImsentcsec\fP). 
.P
In all three situations, the comparison relation between the two \s-1MAC\s+1 
labels is dependent upon actual comparison of the level, category set, grade, 
and division set component fields.
.sp 1
.nr Tn (\w'Given \s-1MAC\s+1 labels A and B:'+1.5n)/1n
.TP \n(Tn
Given \s-1MAC\s+1 labels A and B:  
A[S] and B[S] represent the \s-1MSEN\s+1 label portions of A and B respectively 
.br
A[I] and B[I] represent the \s-1MINT\s+1 label portions of A and B respectively  
.P
So that:
.nr Tn (\w'And If'+1.5n)/1n
.TP \n(Tn
If
A[S] is an element in the set {\fImsenadmin, msenequal, msenhigh, msenmldhigh, msenlow, msenmldlow\fP} and
.br
A[I] is an element in the set {\fImintequal, minthigh, mintlow\fP}
.br 
        or
.br 
B[S] is an element in the set {\fImsenadmin, msenequal, msenhigh, msenmldhigh, msenlow, msenmldlow\fP} and
.br
B[I] is an element in the set {\fImintbiba, minthigh, mintlow\fP}
.sp .5v
then a dominance determination is possible based solely on the \s-1MSEN\s+1 and \s-1MINT\s+1 label types.
.sp .5v
.TP
If
A[S], B[S] are elements in the set {\fImsenmld, msentcsec\fP}  
.sp .5v
then comparison of the ml_level fields, the ml_catcount fields, and 
the first ml_catcount elements of the ml_list fields is required.
.sp .5v
.TP
If
A[I], B[I] are elements in the set {\fImintbiba\fP}
.sp .5v
then comparison of the ml_grade fields, the ml_divcount fields, and 
the last ml_divcount elements of the ml_list fields is required.
.sp .5v
.TP
And If
A[S], B[S] are elements in the set {\fImsenmld, msentcsec\fP} and 
.br
A[I], B[I] are elements in the set {\fImintbiba\fP}
.sp .5v
then comparison of the ml_level fields, the ml_catcount fields, and 
the first ml_catcount elements of the ml_list fields is required,
and comparison of the ml_grade fields, the ml_divcount fields, and 
the last ml_divcount elements of the ml_list fields is required.
.sp 1
.P
\fB\s-1MSEN\s+1 label type\fP Comparison 
.P
If A[S] is \fImsenadmin\fP then 
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenadmin\fP or \fImsenequal\fP
then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenhigh\fP or \fImsenmldhigh\fP
then A[S] is dominated by B[S]
T}
If B[S]%T{
is \fImsenlow\fP or \fImsenmldlow\fP
then A[S] dominates B[S]
T}
If B[S]%T{
is \fImsenmld or msentcsec\fP
then A[S] and B[S] are non-comparable
T}
.TE
.in-3
.P
If A[S] is \fImsenequal\fP then 
.in+3
.TS
tab(%);
l lw(5i).
\0\0A[S]%is equal to B[S]
.TE
.in-3
.P
If A[S] is \fImsenhigh\fP then
.in+3
.TS 
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal, msenhigh\fP or \fImsenmldhigh\fP
then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenadmin, msenlow, msenmldlow, msenmld or
msentcsec\fP then A[S] dominates B[S]
T}
.TE
.in-3
.P
If A[S] is \fImsenmldhigh\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal, msenhigh\fP or \fImsenmldhigh\fP
then A[S] is equal to B[S] 
T}
If B[S]%T{
is \fImsenadmin, msenlow, msenmldlow, msenmld or
msentcsec\fP then A[S] dominates B[S]
T}
.TE
.in-3
.P
If A[S] is \fImsenlow\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal, msenlow\fP or \fImsenmldlow\fP
then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenadmin, msenhigh, msenmldhigh, msenmldor
msentcsec\fP then A[S] is dominated by B[S]
T}
.TE
.in-3
.P
If A[S] is \fImsenmldlow\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal, msenlow\fP or \fImsenmldlow\fP
then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenadmin, msenhigh, msenmldhigh, msenmld or
msentcsec\fP then A[S] is dominated by B[S]
T}
.TE
.in-3
.P
If A[S] is \fImsenmld\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal\fP then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenlow\fP or \fImsenmldlow\fP then A[S] dominates B[S]
T}
If B[S]%T{
is \fImsenhigh\fP or \fImsenmldhigh\fP then A[S] is dominated by B[S]
T}
If B[S]%T{
is \fImsenadmin\fP then A[S] and \*(BS are non-comparable
T}
If B[S]%T{
is \fImsenmld or msentcsec\fP then the level and 
category set component fields of A[S] and B[S] must be compared
T}
.TE
.in-3
.P
If A[S] is \fImsentcsec\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[S]%T{
is \fImsenequal\fP then A[S] is equal to B[S]
T}
If B[S]%T{
is \fImsenlow\fP or \fImsenmldlow\fP then A[S] dominates B[S]
T}
If B[S]%T{
is \fImsenhigh\fP or \fImsenmldhigh\fP then A[S] is dominated by B[S]
T}
If B[S]%T{
is \fImsenadmin\fP then A[S] and \*(BS are non-comparable
T}
If B[S]%T{
is \fImsenmld or msentcsec\fP then the level and 
category set component fields of A[S] and B[S] must be compared
T}
.TE
.in-3
.sp 1
.ne4i
.P
\fB\s-1MINT\s+1 label type\fP Comparison 
.P
If A[I] is \fImintequal\fP then 
.in+3
.TS
tab(%);
l lw(5i).
\0\0A[I]%T{
is equal to B[I]
T}
.TE
.in-3
.P
If A[I] is \fIminthigh\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[I]%T{
is \fImintequal\fP or \fIminthigh\fP then A[I] is equal to B[I]
T}
If B[I]%T{
is \fImintlow\fP or \fImintbiba\fP then A[I] is dominated by B[I]
T}
.TE
.in-3
.P
If A[I] is \fImintlow\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[I]%T{
is \fImintequal\fP or \fImintlow\fP then A[I] is equal to B[I]
T}
If B[I]%T{
is \fIminthigh\fP or \fIminbiba\fP then A[I] dominates B[I]
T}
.TE
.in-3
.P
If A[I] is \fImintbiba\fP then
.in+3
.TS
tab(%);
l lw(5i).
If B[I]%T{
is \fImsenequal\fP then A[I] is equal to B[I]
T}
If B[I]%T{
is \fIminthigh\fP then A[I] dominates B[I]
T}
If B[I]%T{
is \fImintlow\fP then A[I] is dominated by B[I]
T}
If B[I]%T{
is \fImintbiba\fP then the grade and division set component fields 
of A[I] and B[I] must be compared
T}
.TE
.in-3
.sp 1
.P
The rules for the \s-1MSEN\s+1 and \s-1MINT\s+1 label type dominance 
relationship are defined as follows:
.P
.TP
For \fB\s-1MSEN\s+1 label type\fP dominance:
\fImsenadmin\fP is defined to dominate \fImsenadmin, msenequal, msenlow\fP, 
and \fImsenmldlow\fP.
.br
\fImsenequal\fP is defined to dominate all other \s-1MSEN\s+1 label types.
.br
\fImsenhigh\fP is defined to dominate all other \s-1MSEN\s+1 label types.
.br
\fImsenmldhigh\fP is defined to dominate all other \s-1MSEN\s+1 label types.
.br
\fImsenlow\fP is defined to dominate \fImsenequal, msenlow\fP and
\fImsenmldlow\fP.
.br
\fImsenmldlow\fP is defined to dominate \fImsenequal, msenlow\fP and 
\fImsenmldlow\fP.
.br
\fImsenmld\fP is defined to dominate \fImsenequal, msenlow\fP and 
\fImsenmldlow\fP.
In addition, \fImsenmld\fP is defined to dominate \fImsenmld\fP and 
\fImsentcsec\fP if level of A[S] is greater than or equal to level of B[S] 
and category set of B[S] is a subset of category set of A[S]. 
.br
\fImsentcsec\fP is defined to dominate \fImsenqual, msenlow\fP and 
\fImsenmldlow\fP.
In addition, \fImsentcsec\fP is defined to dominate \fImsenmld\fP and 
\fImsentcsec\fP if level of A[S] is greater than or equal to level 
of B[S] and category set of B[S] is a subset of category set 
of A[S]. 
.P
.TP
For \fB\s-1MINT\s+1 label type\fP dominance:
\fImintequal\fP is defined to dominate all other \s-1MINT\s+1 label types.
.br
\fImintlow\fP is defined to dominate all other \s-1MINT\s+1 label types.
.br
\fIminthigh\fP is defined to dominate \fImintequal\fP and \fIminthigh\fP.
.br
\fImintbiba\fP is defined to dominate \fImintequal\fP and \fIminthigh\fP.
In addition, \fImintbiba\fP is defined to dominate \fImintbiba\fP if 
grade of A[I] is greater than or equal to grade of B[I] and 
division set of B[I] is a subset of division set of A[I].
.sp 1
.P
The rules for the \s-1MSEN\s+1 and \s-1MINT\s+1 label type equality relationship are 
defined as follows:
.P
.TP
For \fB\s-1MSEN\s+1 label type\fP equality:
\fImsenadmin\fP is defined to equal \fImsenadmin\fP and \fImsenequal\fP.
.br
\fImsenequal\fP is defined to equal all other \s-1MSEN\s+1 label types.
.br
\fImsenhigh\fP is defined to equal \fImsenequal, msenhigh\fP and 
\fImsenmldhigh\fP.
.br
\fImsenmldhigh\fP is defined to equal \fImsenequal, msenhigh\fP and 
\fImsenmldhigh\fP.
.br
\fImsenlow\fP is defined to equal \fImsenequal, msenlow\fP and
\fImsenmldlow\fP.
.br
\fImsenmldlow\fP is defined to equal \fImsenequal, msenlow\fP and 
\fImsenmldlow\fP.
.br
\fImsenmld\fP is defined to equal \fImsenequal\fP. 
In addition, \fImsenmld\fP is defined to equal \fImsenmld and msentcsec\fP 
if level of A[S] is equal to level of B[S] 
and category set of A[S] is equal to category set of B[S]. 
.br
\fImsentcsec\fP is defined to equal \fImsenqual\fP.
In addition, \fImsentcsec\fP is defined to equal \fImsenmld and msentcsec\fP 
if level of A[S] is equal to level of B[S] 
and category set of A[S] is equal to category set of B[S]. 
.P
.TP
For \fB\s-1MINT\s+1 label type\fP equality:
\fImintequal\fP is defined to equal all other \s-1MINT\s+1 label types.
.br
\fIminthigh\fP is defined to equal \fImintequal\fP and \fIminthigh\fP.
.br
\fImintlow\fP is defined to equal \fImintequal\fP and \fImintlow\fP.
.br
\fImintbiba\fP is defined to equal \fImintequal\fP.
In addition, \fImintbiba\fP is defined to equal \fImintbiba\fP if 
grade of \fIlp1\fP is equal to grade of \fIlp2\fP and 
division set of \fIlp1\fP is equal to division set of \fIlp2\fP.
.P
Any pair of \s-1MSEN\s+1 label types or \s-1MINT\s+1 label types not 
explicitely referenced above are considered to be non-comparable, and 
thus the \s-1MAC\s+1 labels comprised of them are also non-comparable.
.sp 1
.ne5i
.DS
.ce
\s-1\fBTABLE 1:\fP\s+1  \s-1MSEN\s+1 Label Type Relationships
.sp .5v
.TB "\s-1MSEN\s+1 Label Type Relationships"
.TS
box center tab(:);
cb || cb | cb | cb | cb | cb | cb | cb | cb 
cb || c  | c  | c  | c  | c  | c  | c  | c.
:A:E:H:I:L:N:M:T:X
=
A:\(eq:\(eq:<:<:>:>:NC:NC
_
E:\(eq:\(eq:\(eq:\(eq:\(eq:\(eq:\(eq:\(eq
_
H:>:\(eq:\(eq:\(eq:>:>:>:>
_
I:>:\(eq:\(eq:\(eq:>:>:>:>
_
L:<:\(eq:<:<:\(eq:\(eq:<:<
_
N:<:\(eq:<:<:\(eq:\(eq:<:<
_
M:NC:\(eq:<:<:>:>:\(**:\(**
_
T:NC:\(eq:<:<:>:>:\(**:\(**
.TE
.DE
.sp 1
.DS
.ce
\s-1\fBTABLE 2:\fP\s+1  \s-1MINT\s+1 Label Type Relationships
.sp .5v
.TB "\s-1MINT\s+1 Label Type Relationships"
.TS
box center tab(:);
cb || cb | cb | cb | cb
cb || c  | c  | c  | c.
:e:h:l:b
=
e:\(eq:\(eq:\(eq:\(eq
_
h:\(eq:\(eq:<:<
_
l:\(eq:>:\(eq:>
_
b:\(eq:>:<:\(**
.TE
.DE
.SH FILES
\*(Lc
.br
\*(Ld
.br
\*(Lg
.br
\*(Ll
.br
\*(Lv
.br
\*(Li
.br
\*(Ls
.br
.SH SEE ALSO
.br
mac_dominate(3c)
.br
mac_equal(3c)
.br
mac_to_text(3c)
.br
mac_from_text(3c)
.\"**************************************************************************
.\"                        E N D   O F   M O D U L E                        *
.\"**************************************************************************
