calmsacibis995/irix-6517-src/eoe/man/man5/environ.5
'\"! tbl | mmdoc
'\"macro stdmacro
.if n .pH g5.environ @(#)environ	41.9 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} environ 5 "" "\&"
.if \nX=1 .ds x} environ 5 ""
.if \nX=2 .ds x} environ 5 "" "\&"
.if \nX=3 .ds x} environ "" "" "\&"
.TH \*(x}
.SH NAME
\f4environ\f1 \- user environment
.SH DESCRIPTION
When a process begins execution,
\f4exec\fP
routines make available an array of strings called the
environment (see \f4exec\f1(2)).
By convention, these strings have the form \f2variable=value\f1,
for example, \f4PATH=/sbin:/usr/sbin\f1.
These environmental variables provide a way to make
information about a program's environment available to programs.
The following environmental variables can be used by
applications and are expected to be set in the target runtime environment.
.PP
.TP 12
\f4HOME\f1
The name of the user's login directory, set by
\f4login\fP(1)
from the password file
(see
\f4passwd\fP(4)).
.TP
\f4LANG\f1
The program's locale.
Locales consist of files that describe the conventions
appropriate to some nationality, culture, and language.
Generally, users determine which files are selected by manipulating
the environment variables described below.
For background, see \f4setlocale\f1(3C).
.IP
Locales are partitioned into categories \f4LC_COLLATE\f1,
\f4LC_CTYPE\f1, \f4LC_MESSAGES\f1, \f4LC_MONETARY\f1, \f4LC_NUMERIC\f1,
and \f4LC_TIME\f1 (see below for what the categories control).
Each category has a corresponding environment variable that
the user can set to specify that category's locale:
.IP
\f4LC_CTYPE=fr\f1[anc\*,ais]
.IP
The \f4LANG\f1 environment variable is searched if the environment
variable for a category is unset or empty:
.nf
.sp .25
\f4LANG=fr
LC_COLLATE=de\f1[utsche]
.sp .25
.fi
sets all the categories but \f4LC_COLLATE\f1 to French.
If \f4LANG\f1 is unset or empty, the default \f4C\f1 locale is used.
.IP
.RS
.TP 15
\f4LC_COLLATE\f1
specifies the collation order used.
The information for this category is stored in a database
created by the
\f4colltbl\fP(1M)
command.
This environment variable affects
\f4sort\f1(1),
\f4strcoll\fP(3C),
and
\f4strxfrm\fP(3C).
.TP
\f4LC_CTYPE\f1
specifies character classification, character conversion,
and widths of multibyte characters.
The information for this category is stored
in a database created by the
\f4chrtbl\fP(1M)
or \f4wchrtbl\fP(1M)
commands.
The default
\f4C\f1
locale uses the 7-bit
US ASCII
character set.
This environment variable affects
many commands and functions, among them,
\f4cat\fP(1),
\f4ed\fP(1),
\f4ls\fP(1),
\f4vi\fP(1),
\f4ctype\fP(3C),
and
\f4mbchar\fP(3C),
.TP
\f4LC_MESSAGES\f1
specifies the message database used.
A command or application may have French and German
message databases, for example.
Message databases are created by the
\f4mkmsgs\fP(1) or \f4gencat\f1(1) commands.
This environment variable affects
\f4gettxt\fP(1), \f4srchtxt\f1(1), \f4catgets\f1(3C), and \f4gettxt\fP(3C),
and every command that generates locale-specific output messages.
.TP
\f4LC_MONETARY\f1
specifies the monetary symbols and delimiters used.
The information for this category is stored in a database created
by the \f4montbl\fP(1M) command.
This environment variable affects
\f4localeconv\fP(3C).
.TP
\f4LC_NUMERIC\f1
specifies the decimal and thousands delimiters.
The information for this category is stored in a database
created by the
\f4chrtbl\fP(1M)
or \f4wchrtbl\fP(1M)
commands.
The default
\f4C\f1
locale uses a period (\f4.\fP) as the
decimal delimiter and no thousands delimiter.
This environment variable affects
\f4localeconv\fP(3C),
\f4printf\fP(3S),
\f4scanf\f1(3S),
and
\f4strtod\fP(3C).
.TP
\f4LC_TIME\f1
specifies date and time formats.
The information for this category is stored in a database
specified in
\f4strftime\fP(4).
The default
\f4C\f1
locale uses US date and time formats.
This environment variable affects
many commands and functions, among them,
\f4at\fP(1),
\f4calendar\fP(1),
\f4date\f1(1),
\f4getdate\f1(3C),
and
\f4strftime\fP(3C).
.RE
.TP
\f4MSGVERB\f1
Controls which standard format message components
\f4fmtmsg\f1 selects when messages are displayed to
\f4stderr\f1 (see \f4fmtmsg\fP(1) and \f4fmtmsg\f1(3C)).
.TP
\f4NOMSGLABEL\f1
Used to turn off the label portion of \f4pfmt\f1 message
component.
(see \f4pfmt\f1(3C)).
.TP
\f4NOMSGSEVERITY\f1
Used to turn off the severity portion of \f4pfmt\f1 message
component.
(see \f4pfmt\f1(3C)).
.TP
\f4SEV_LEVEL\f1
Defines severity levels and associates and prints strings
with them in standard format error messages
(see \f4addseverity\fP(3C), \f4fmtmsg\fP(1), and \f4fmtmsg\f1(3C)).
.\".TP 12
.\"\f4NETPATH\f1
.\"A colon-separated list of network identifiers.
.\"A network identifier is a character string used by the
.\"Network Selection
.\"component of the system to provide application-specific default
.\"network search paths.
.\"A network identifier must consist of non-NULL
.\"characters and must have a length of at least 1.
.\"No maximum length is specified.
.\"Network identifiers are normally chosen
.\"by the system administrator.
.\"A network identifier is also the first field in
.\"any
.\"\f4/etc/netconfig\f1
.\"file entry.
.\"\f4NETPATH\f1
.\"thus provides a link into the
.\"\f4/etc/netconfig\f1
.\"file and the information about a network contained in that network's entry.
.\"\f4/etc/netconfig\f1
.\"is maintained by the system administrator.
.\"The library routines described in
.\"\f4getnetpath\fP(3N)
.\"access the
.\"\f4NETPATH\f1
.\"environment variable.
.TP
\f4NLSPATH\fP
Contains a sequence of templates which
\f4catopen\fP(3C)
uses when attempting to locate message catalogs.
Each template consists of
an optional prefix,
one or more substitution fields,
a filename, and an optional suffix.
.IP
For example:
.IP
.ft 4
.ft 1
.nf
NLSPATH="/system/nlslib/%N.cat"
.fi
.IP
.ne 4
defines that
\f4catopen\fP
should look for all message catalogs in the
directory
\f4/system/nlslib\fP,
where the catalog name should be constructed from the
.I name
parameter passed to
\f4catopen\fP,
\f4%N\fP,
with the suffix \f4.cat\fP.
.IP
Substitution fields consist of a
\f4%\fP
symbol, followed by a single-letter keyword.
The following keywords are currently defined:
.IP
.columns 1 8
.TS
center, box;
lfCW l.

%N   The value of the \f2name\fP parameter passed to \f4catopen\fP.

%L   The value of \f4LANG\fP environment variable if \f2oflag\fP is 0. 
     The value of \f4LC_MESSAGES\fP category if \f2oflag\fP is \f4NL_CAT_LOCALE\fP.

%l   The language element from \f4LANG\fP environment variable if \f2oflag\fP is 0. 
     The language element from \f4LC_MESSAGES\fP category if \f2oflag\fP is 
     \f4NL_CAT_LOCALE\fP.

%t   The territory element from \f4LANG\fP environment variable if \f2oflag\fP is 0. 
     The territory element from \f4LC_MESSAGES\fP category if \f2oflag\fP is 
     \f4NL_CAT_LOCALE\fP.

%c   The codeset element from \f4LANG\fP environment variable if \f2oflag\fP is 0. 
     The codeset element from \f4LC_MESSAGES\fP category if \f2oflag\fP is 
     \f4NL_CAT_LOCALE\fP.

%%   A single \f4%\fP character.

.TE
.IP
where \f2oflag\fP is a second argument of \f2catopen\fP.
.IP
An empty string is substituted if the specified value is not
currently defined.
The separators ``\f4_\fP'' and ``\f4.\fP'' are not included in
\f4%t\fP and \f4%c\fP
substitutions.
.IP
Templates defined in
\f4NLSPATH\fP
are separated by colons (\f4:\fP).
A leading colon or two adjacent colons (\f4::\fP) is equivalent to
specifying \f4%N\fP.
.IP
For example:
.IP
.ft 4
.ft 1
.nf
NLSPATH=":%N.cat:/nlslib/%L/%N.cat"
.fi
.IP
indicates to
\f4catopen\f1
that it should look for the requested message catalog in
\f2name\f1,
\f2name\f1\f4.cat\f1,
and
\f4/nlslib/$LANG/\f1\f2name\f1\f44
def.cat\f1 (if \f2oflag\fP is set to 0).
.TP
\f4LD_LIBRARY_PATH\f1
Can override the normal library search paths
(/lib:/lib/cmplrs/cc:/usr/lib:/usr/lib/cmplrs/cc)
(For more detail, see \f4rld\fP(1).)
.TP
\f4_RLD_ARGS\f1
Can specify runtime linker options.
(For more detail, see \f4rld\fP(1).)
.TP
\f4PATH\f1
The sequence of directory prefixes that
\f4sh\fP(1),
\f4time\fP(1),
\f4nice\fP(1),
\f4nohup\fP(1),
and so on
apply in searching for a file known by an incomplete pathname.
The prefixes are separated by colons
(\f4:\f1).
\f4login\fP(1)
sets
\f4PATH=:/usr/sbin:/usr/bsd:/sbin:/usr/bin:/usr/bin/X11\f1.
(For more detail, see \f4login\fP(1) and \f4sh\fP(1).)
.TP
\f4SHELL\fP
When the shell is invoked, it scans the environment
for this name.
If it is found and \f4rsh\fP is
the filename part of its value,
the shell becomes a restricted shell.
The value of this variable should be specified with an absolute pathname.
The variable is used by \f4make\f1(1), \f4ksh\f1(1),
\f4sh\f1(1), and \f4vi\f1(1), among other commands.
.TP
\f4TERM\f1
The kind of terminal for which output is to be prepared.
This information is used by commands, such as
\f4mm\fP(1)
or
\f4vi\fP(1),
which may exploit special capabilities of that terminal.
.TP
\f4TZ\f1
Time zone information.
The contents of the environment variable named \f4TZ\f1 are used by the
functions
\f4ctime\f1(3C),
\f4localtime\f1 (see \f4ctime\fP(3C)),
\f4strftime\f1(3C),
and
\f4mktime\f1(3C)
to override the default timezone.
If the first character of \f4TZ\f1 is a colon (\f4:\f1), the behavior
is implementation-defined, otherwise \f4TZ\f1 has the form:
.IP
\f2std\f1\f4\f1\f2offset\f1\f4[\f1\f2dst\f1\f4[\f1\f2offset\f1\f4],[\f1\f2start\f1\f4[/\f1\f2time\f1\f4],\f1\f2end\f1\f4[/\f1\f2time\f1\f4]]]\f1
.RS 12
.TP
\f2std\fP\ and\ \f2dst\fP
Three or more bytes that are the designation for the standard
(\f2std\f1)
and daylight savings time
(\f2dst\f1)
timezones.
Only
.I std
is required, if
.I dst
is missing, then daylight savings time does not apply in this locale.
Upper- and lowercase letters are allowed.
Any characters
except a leading colon (\f4:\fP), digits, a comma (\f4,\fP),
a minus (\f4\-\fP), or a plus (\f4+\fP) are allowed.
.TP
\f2offset\fP
Indicates the value one must add to the local time to arrive at
Coordinated Universal Time.
The offset has the form:
.IP
\f2hh\f1\f4[:\f1\f2mm\f1\f4[:\f1\f2ss\f1\f4]]\f1
.IP
.IP
The minutes
.RI ( mm )
and seconds
.RI ( ss )
are optional.
The hour
.RI ( hh )
is required and may be a single digit.
The
.I offset
following
.I std
is required.
If no
.I offset
follows
.I dst ,
daylight savings time is assumed to be one hour ahead of standard time.
One or more digits may be used; the value is always
interpreted as a decimal number.
The hour must be between 0
and 24, and the minutes (and seconds) if present between 0 and
59.
Out of range values may cause unpredictable behavior.
If preceded
by a ``\-'', the timezone is east of the Prime Meridian;
otherwise it is west (which may be indicated by an optional
preceding ``\f2+\fP'' sign).
.TP
\f2start\fP/\f2time\fP,\f2end\fP/\f2time\fP
Indicates when to change to and back from daylight savings time, where
.I start/time
describes when the change from standard time to daylight savings time occurs, and
.I end/time
describes when the change back happens.
Each
.I time
field describes when, in current local time, the change is made.
.IP
The formats of
.I start
and
.I end
are one of the following:
.RS
.TP 0.5i
\f4J\fP\f2n\fP
The Julian day
.I n
(1 \(<=
.I n
\(<= 365).
Leap days are not counted.
That is, in all years, February 28 is
day 59 and March 1 is day 60.
It is impossible to refer to the occasional
February 29.
.TP
\f2n\fP
The zero-based Julian day
(0 \(<=
.I n
\(<= 365).
Leap days are counted,
and it is possible to refer to
February 29.
.TP
\f4M\fP\f2m.n.d\fP
The
.IR d \uth\d
day,
(0 \(<=
.I d
\(<= 6) of week
.I n
of month
.I m
of the year
(1 \(<=
.I n
\(<= 5, 1 \(<=
.I m
\(<= 12), where week 5 means ``the last
.IR d -day
in month
.IR m ''
which may occur in either the fourth or the fifth week).
Week 1 is the first week in which the
.IR d \uth\d
day occurs.
Day zero is Sunday.
.RE
.IP
Implementation-specific defaults are used for
.I start
and
.I end
if these optional fields are not given.
.IP
The
.I time
has the same format as
.I offset
except that no leading sign (``\f2\-\fP'' or ``\f2+\fP'') is allowed.
The default, if
.I time
is not given is 02:00:00.
.IP
For example, the most complete setting for New Jersey in 1986 could be
.IP
\f4
        EST5:00:00EDT4:00:00,116/2:00:00,298/2:00:00\fP
.IP
or simply
.IP
.BR
        \f4EST5EDT\fP
.IP
In the longer version of the New Jersey example of
\f4TZ\^,\f1
\f4EST\fP is the abbreviation for the main time zone, 
\f45:00:00\fP is the difference, in hours, minutes, and seconds 
between GMT and the main time zone, 
\f4EDT\fP is the abbreviation for the alternate time zone, 
\f44:00:00\fP is the difference, in hours, minutes, and seconds 
between GMT and the alternate time zone, 
\f4116\fP
is the number of the day of the year (Julian day) when the
alternate time zone will take effect, 
\f42:00:00\fP is the number of hours, minutes, and seconds 
past midnight when the alternate time zone will take effect, 
\f4298\fP is the number of the day of the year when the alternate time
zone will end, and 2:00:00 is the number of hours, minutes, and seconds
past midnight when the alternate time zone will end.
.IP
Timezone specifications under the IRIX 4 operating system used a ";"
to separate the
.I dst
field from the
.I start
field.  In conformance with the X/Open XPG4 standard, this is no
longer legal, and a "," must be used in place of the ";".
.RE
.PP
Further names may be placed in the environment by
the
\f4export\f1
command and
.IR name = value
arguments in
\f4sh\fP(1),
or by
\f4exec\fP(2).
It is unwise to conflict with
certain shell variables that are frequently exported by
\f4\&.profile\f1
files:
\f4MAIL\f1,
\f4PS1\f1,
\f4PS2\f1,
\f4IFS\f1
(see
\f4profile\fP(4)).
.SH SEE ALSO
cat(1),
chrtbl(1M),
colltbl(1M),
date(1),
ed(1),
fmtmsg(1),
gencat(1),
gettxt(1),
login(1),
ls(1),
mkmsgs(1),
mm(1),
montbl(1M),
nice(1),
nohup(1),
sh(1),
sort(1),
srchtxt(1),
time(1),
vi(1),
wchrtbl(1M),
exec(2),
addseverity(3C),
catgets(3C),
catopen(3C),
ctime(3C),
ctype(3C),
fmtmsg(3C),
getdate(3C),
getnetpath(3N),
gettxt(3C),
localeconv(3C),
mbchar(3C),
mktime(3C),
printf(3S),
scanf(3S),
setlocale(3C),
strcoll(3C),
strftime(3C),
strtod(3C),
strxfrm(3C),
netconfig(4),
passwd(4),
profile(4),
strftime(4),
strftime(4),
timezone(4)
.\"	@(#)environ.5	6.5 of 4/30/97
