calmsacibis995/irix-6517-src/eoe/man/man5/esp.5
'\"macro stdmacro
.TH ESP 1
.SH NAME
esp \- Embedded Support Partner
.SH DESCRIPTION
.I esp\^
is an infrastructure that is integrated into the operating system for
the purposes of support. This infrastructure contains various components
that perform the following:
.P
.B Capture and store system level events 
.br
.B Capture and store system configuration
.br
.B Capture and store system availability information
.br
.B Provide features of proactive notification
.br
.B Generate various reports for supportability
.P

The Embedded Support Partner consists of a set of daemons that perform
various monitoring activities. These include an event monitoring daemon(eventmond),
event management daemon(espemd) and database daemon(espdbd). The Embedded Support
Partner can be pre-programmed for event monitoring and provides flexible throttling
features for the events.  Actions can also be programmed for each
event. 
.P
Event sources include kernel, performance monitoring tools, availability tools,
configuration monitoring tools and user applications. Events are categorized into
classes and types. A class can have many types. Example of a class could be SCSI
and the various types under this class could be SCSI hard error, SCSI Bus reset, etc.
The event types are uniquely sequenced with pre-assigned numbers. The events propagate to the
Embeedded Support Partner through syslogd and captured by the eventmond. The message
string contains the unique sequence number with a special tag which eventmond identifies.
The tag and sequence number also show up in SYSLOG. An example of the message in SYSLOG is:
.P
.B May 24 23:16:34 6D:starwars esphttpd[5722]: |$(0x200120)started - (debug mode)
.P
User defined events can be added using the Embedded Support Partner
user interface.  The sequence numbers are automatically generated. User applications can
log user defined events into the Embedded Support Partner framework by two mechanisms.
Applications can include the \f2EventMonAPI\f1(3X) calls within or could use the command
line driven application \f2esplogger\f1(1M). Both methods would need to use the
unique sequence number generated by the Embedded Support Partner user interface.
.P
Each event can have assoicated actions that can be proactively triggered by the
Embedded Support Partner in reaction to an event. Actions can be pre-programmed and assigned
to events. Examples of actions include: Graphical posts onto the console,
email, chatty paging and numeric paging. Most of the notification features are
incorporated using \f2espnotify\f1(1) utility. Numeric paging needs the use of
modems and uses \f2QuickPage\f1(1M) software. The option of numeric paging must
be \f2chkconfig\f1(1M) on for use.
.P
The Embedded Support Partner also provides the facility to manage multiple
systems in a group environment. Under this environment, one of the systems
can be designated as the Group Manager. The Group Manager can then subscribe to
various events from the member systems. The member systems forward the occurance
and assoicated data of the subscribed events to the Group Manager
for which proactive actions can be set to be taken. Certain class of events have
to be subscribed in full. Examples of this are Availability, Configuration, etc.
The Group Manager also provides the capability to monitor various services
on the member systems. These include: icmp, rpcbind, dns, smtp, nntp, etc. The
services can be configured using the Embedded Support Partner user interface and
requires that pcp_eoe subsystem be installed. The Group Manager capabilities are
licensed.
.P
The Embedded Support Partner supports a html browser based interface and for non-graphics
systems, a Lynx based ASCII interface. The ASCII interface supports single systems
only. The browser interface supports both single systems and multiple systems (Group 
Management) environment. At the time of logging in, one must choose the type from the user 
interface. The interfaces runs from a http based server that is started by inetd on connection
only.
.P
The Embedded Support Partner supports a variety of reports. These include: hardware
and software reports, event reports, actions reports and availability reports. The
Embedded Support Partner user interface, by default, is accessable by localhost only.
The user interface can be started by the \f2launchESPartner\f1(1) or by clicking the icon
for Embedded Support Partner in the icon catalog under the support tools page.
The Embedded Support Partner could then be customized according to the needs at the site. An
online help facility is also provided for reference.
.P
.SH SEE ALSO
pcp(1),
chkconfig(1M),
configmon(1M),
espnotify(1M),
esplogger(1M),
esparchive(1M),
launchESPartner(1),
QuickPage(1M),
EventMonAPI(3X),
availmon(5)
.SH REFERENCES
SGI Embedded Support Partner User Guide

