calmsacibis995/irix-6517-src/eoe/man/man5/hostname.5
'\"macro stdmacro
.\" Copyright (c) 1987 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)hostname.7	6.3 (Berkeley) 12/14/89
.\"
.\".if n .pH g5.hostname @(#)hostname	30.3 of 3/7/86
.\".nr X
.\".if \nX=0 .ds x} HOSTNAME 5 ""  "\&"
.\".if \nX=1 .ds x} HOSTNAME 5 ""
.\".if \nX=2 .ds x} HOSTNAME 5 "" "\&"
.\".if \nX=3 .ds x} HOSTNAME "" "" "\&"
.\".TH \*(x}
.TH hostname 5
.SH NAME
hostname \- hostname resolution description
.SH DESCRIPTION
Hostnames are domains, where a domain is a hierarchical, dot-separated
list of subdomains; for example, the machine monet, in the Berkeley
subdomain of the EDU subdomain of the Internet would be represented as
.PP
.I "monet.Berkeley.EDU"
.PP
(with no trailing dot).
.PP
Hostnames are often used with network client and server programs,
which must generally translate the name to an address for use.
(This function is generally performed by the library routine
.IR gethostbyname (3N).)
Hostnames are resolved by the Internet name resolver in the following
fashion.
.PP
If the name consists of a single component, i.e., contains no dot,
and if the environment variable ``HOSTALIASES'' is set to the name of a file,
that file is searched for a string matching the input hostname.
The file should consist of lines made up of two white-space separated strings,
the first of which is the hostname alias,
and the second of which is the complete hostname
to be substituted for that alias.
For example, to refer to the host ``matisse.painters.org'' with
the alias ``henri'', use
.PP
.I "henri	matisse.painters.org"
.PP
If a case-insensitive match is found between the hostname to be resolved
and the first field of a line in the file, the substituted name is looked
up with no further processing.
.PP
If the input name ends with a trailing dot,
the trailing dot is removed,
and the remaining name is looked up with no further processing.
.PP
If the input name does not end with a trailing dot, it is looked up
by searching through a list of domains until a match is found.
The default search list includes first the local domain,
then its parent domains with at least 2 name components (longest first).
.PP
For example, in the domain CS.Berkeley.EDU, the name
\f2lithium.CChem\f1 will be checked first
as
.PP
.I "lithium.CChem.CS.Berkeley.EDU"
.PP
and then as
.PP
.I "lithium.CChem.Berkeley.EDU."
.PP
Lithium.CChem.EDU will not be tried, as there is only one component
remaining from the local domain.
The search path can be changed from the default
by the
.I resolv.conf
system-wide configuration file.
See the descriptions
of the
.B search
keyword in
.IR resolver (4).
.SH NOTE
Hostnames (and usernames) must be encoded in ASCII.
.SH SEE ALSO
named(1M),
gethostbyname(3N),
resolver(3N),
hosts(4),
resolver(4)
