calmsacibis995/irix-6517-src/eoe/man/man5/langinfo.5
'\"macro stdmacro
.if n .pH g5.langinfo @(#)langinfo	41.3 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} langinfo 5 "" "\&"
.if \nX=1 .ds x} langinfo 5 ""
.if \nX=2 .ds x} langinfo 5 "" "\&"
.if \nX=3 .ds x} langinfo "" "" "\&"
.TH \*(x}
.SH NAME
\f4langinfo\fP \- language information constants
.SH "SYNOPSIS"
.nf
\f4#include <langinfo.h>\f1\f4\f1
.fi
.SH "DESCRIPTION"
This header file contains the constants used to identify items of
\f4langinfo\fP
data.
The mode of
.I items
is given in
\f4nl_types\fP(5).
.P
.TP 15
\f4DAY_1\fP
Locale's equivalent of ``sunday''
.TP 15
\f4DAY_2\fP
Locale's equivalent of ``monday''
.TP 15
\f4DAY_3\fP
Locale's equivalent of ``tuesday''
.TP 15
\f4DAY_4\fP
Locale's equivalent of ``wednesday''
.TP 15
\f4DAY_5\fP
Locale's equivalent of ``thursday''
.TP 15
\f4DAY_6\fP
Locale's equivalent of ``friday''
.TP 15
\f4DAY_7\fP
Locale's equivalent of ``saturday''
.TP 15
\f4ABDAY_1\fP
Locale's equivalent of ``sun''
.TP 15
\f4ABDAY_2\fP
Locale's equivalent of ``mon''
.TP 15
\f4ABDAY_3\fP
Locale's equivalent of ``tue''
.TP 15
\f4ABDAY_4\fP
Locale's equivalent of ``wed''
.TP 15
\f4ABDAY_5\fP
Locale's equivalent of ``thur''
.TP 15
\f4ABDAY_6\fP
Locale's equivalent of ``fri''
.TP 15
\f4ABDAY_7\fP
Locale's equivalent of ``sat''
.TP 15
\f4MON_1\fP
Locale's equivalent of ``january''
.TP 15
\f4MON_2\fP
Locale's equivalent of ``february''
.TP 15
\f4MON_3\fP
Locale's equivalent of ``march''
.TP 15
\f4MON_4\fP
Locale's equivalent of ``april''
.TP 15
\f4MON_5\fP
Locale's equivalent of ``may''
.TP 15
\f4MON_6\fP
Locale's equivalent of ``june''
.TP 15
\f4MON_7\fP
Locale's equivalent of ``july''
.TP 15
\f4MON_8\fP
Locale's equivalent of ``august''
.TP 15
\f4MON_9\fP
Locale's equivalent of ``september''
.TP 15
\f4MON_10\fP
Locale's equivalent of ``october''
.TP 15
\f4MON_11\fP
Locale's equivalent of ``november''
.TP 15
\f4MON_12\fP
Locale's equivalent of ``december''
.TP 15
\f4ABMON_1\fP
Locale's equivalent of ``jan''
.TP 15
\f4ABMON_2\fP
Locale's equivalent of ``feb''
.TP 15
\f4ABMON_3\fP
Locale's equivalent of ``mar''
.TP 15
\f4ABMON_4\fP
Locale's equivalent of ``apr''
.TP 15
\f4ABMON_5\fP
Locale's equivalent of ``may''
.TP 15
\f4ABMON_6\fP
Locale's equivalent of ``jun''
.TP 15
\f4ABMON_7\fP
Locale's equivalent of ``jul''
.TP 15
\f4ABMON_8\fP
Locale's equivalent of ``aug''
.TP 15
\f4ABMON_9\fP
Locale's equivalent of ``sep''
.TP 15
\f4ABMON_10\fP
Locale's equivalent of ``oct''
.TP 15
\f4ABMON_11\fP
Locale's equivalent of ``nov''
.TP 15
\f4ABMON_12\fP
Locale's equivalent of ``dec''
.TP 15
\f4RADIXCHAR\fP
Locale's equivalent of ``.''
.TP 15
\f4THOUSEP\fP
Locale's equivalent of ``,''
.TP 15
\f4YESSTR\fP
Locale's equivalent of ``yes''
.TP 15
\f4NOSTR\fP
Locale's equivalent of ``no''
.TP 15
\f4CRNCYSTR\fP
Locale's currency symbol
.TP 15
\f4D_T_FMT\fP
Locale's default format for date and time
.TP 15
\f4D_FMT\fP
Locale's default format for the date
.TP 15
\f4T_FMT\fP
Locale's default format for the time
.TP 15
\f4AM_STR\fP
Locale's equivalent of ``AM''
.TP 15
\f4PM_STR\fP
Locale's equivalent of ``PM''
.TP 15
\f4CODESET\fP
X/Open Release 4, version 2 locale's code set name.
.TP 15
\f4T_FMT_AMPM\fP
X/Open Release 4, version 2 locales's ``AM'' or ``PM'' time format string.
.TP 15
\f4ERA\fP
X/Open Release 4, version 2 locales's ERA description segments.
.TP 15
\f4ERA_D_FMT\fP
X/Open Release 4, version 2 locales's ERA date format string.
.TP 15
\f4ERA_D_T_FMT\fP
X/Open Release 4, version 2 locales's ERA date and time format string.
.TP 15
\f4ERA_T_FMT\fP
X/Open Release 4, version 2 locales's ERA time format string.
.TP 15
\f4ALT_DIGITS\fP
X/Open Release 4, version 2 locales's alternative symbols for digits.
.TP 15
\f4YESEXPR\fP
X/Open Release 4, version 2 locales's affirmative response expression.
.TP 15
\f4NOEXPR\fP
X/Open Release 4, version 2 locales's negative response expression.
.P
This information is retrieved by
\f4nl_langinfo\fP(3C).
.P
The items
\f4CRNCYSTR\fP, \f4RADIXCHAR\fP,
and
\f4THOUSEP\fP
are extracted from the fields
\f4currency_symbol\fP,
\f4decimal_point\fP,
and
\f4thousands_sep\fP
in the structure returned by
\f4localeconv\fP(3C).
.PP
The items
\f4T_FMT\fP,
\f4D_FMT\fP,
\f4D_T_FMT\fP,
\f4YESSTR\fP,
and
\f4NOSTR\fP
are retrieved from a special message catalog named
\f4Xopen_info\fP
which should be generated for each locale supported and installed
in the appropriate directory (see \f4mkmsgs\fP(1) and \f4gettxt\fP(3C)).
This catalog should have the messages in the order
\f4T_FMT\fP,
\f4D_FMT\fP,
\f4D_T_FMT\fP,
\f4YESSTR\fP,
and
\f4NOSTR\fP.
.PP
All other items are as returned by \f4strftime\fP(3C).
.SH "SEE ALSO"
mkmsgs(1),
gettxt(3C),
localeconv(3C),
nl_langinfo(3C),
strftime(3C),
cftime(4),
nl_types(5)
