calmsacibis995/irix-6517-src/eoe/man/man5/RCSsource.5
'\"macro stdmacro
.TH RCSsource 5
.SH NAME
RCSsource \- directory of RCS sources
.SH DESCRIPTION
The directory
.BR /usr/share/src/gnutools/rcs ,
in the optional inst subsystem
.BR eoe.src.gnutools ,
contains
the compilable
sources for the port of RCS version 5.7 to
Silicon Graphics systems.
This source is provided to you under the terms of
the GNU General Public License, as described below.
.PP
View the file
.B /usr/share/src/gnutools/rcs/README
for instructions
on how to rebuild this product, and for a list
of the changes made to RCS as part
of this port.
.PP
RCS is free software; you can redistribute it and/or modify
it under the terms of the GNU General Public License as published by
the Free Software Foundation; either version 1, or (at your option)
any later version.
.PP
RCS is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
See the
GNU General Public License for more details.
.PP
You should have received a copy of the GNU General Public License
along with RCS; see the file COPYING.
If not, write to
the Free Software Foundation, 675 Mass Ave, Cambridge, MA 02139, USA.
.SH IDENTIFICATION
Author: Walter F. Tichy,
Purdue University, West Lafayette, IN, 47907.
.PP
Copyright \(co 1982, 1988, 1989 by Walter F. Tichy.
Copyright \(co 1990, 1991, 1992, 1993, 1994, 1995 by Paul Eggert
.PP
.SH SEE ALSO
ci(1),
co(1),
ident(1),
merge(1),
rcs(1),
rcsclean(1),
rcsdiff(1),
rcsfreeze(1),
rcsintro(1),
rcsmerge(1),
rlog(1),
rcsfile(4)
.PP
Walter F. Tichy, ``Design, Implementation, and Evaluation of a Revision Control
System,'' in \f2Proceedings of the 6th International Conference on Software
Engineering\f1, IEEE, Tokyo, Sept. 1982.
