calmsacibis995/irix-6517-src/eoe/man/man5/types.5
'\"macro stdmacro
.if n .pH g5.types @(#)types	40.12 of 1/3/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} types 5 "" "\&"
.if \nX=1 .ds x} types 5 ""
.if \nX=2 .ds x} types 5 "" "\&"
.if \nX=3 .ds x} types "" "" "\&"
.TH \*(x}
.SH NAME
\f4types\f1 \- primitive system data types
.SH SYNOPSIS
.nf
\f4#include <sys/types.h>\f1
.fi
.SH DESCRIPTION
The data types defined in \f4types.h\fP
are used in UNIX System code.
Some data of these types are accessible to user code:
.Ex
typedef  struct { int r[1]; } \(**physadr;
typedef  long            clock_t;
typedef  long            daddr_t;
typedef  long            pgno_t;
typedef  char \(**       addr_t;
typedef  char \(**       caddr_t;
typedef  unsigned char   unchar;
typedef  unsigned short  ushort;
typedef  unsigned int    uint;
typedef  unsigned long   ulong;
typedef  unsigned long   ino_t;
typedef  long            uid_t;
typedef  long            gid_t;
typedef  unsigned long   nlink_t;
typedef  unsigned long   mode_t;
typedef  short           cnt_t;
typedef  long            time_t;
typedef  long            swblk_t;
typedef  int             label_t[12];
typedef  unsigned long   dev_t;
typedef  long            off_t;
typedef  long            pid_t;
typedef  long            paddr_t;
typedef  int             key_t;
typedef  unsigned char   use_t;
typedef  short           sysid_t;
typedef  short           index_t;
typedef  unsigned int    lock_t;
typedef  signed char     cpuid_t;
typedef  unsigned int    size_t;
typedef  int             ssize_t;
typedef  long            clock_t;
typedef  long            pid_t;
typedef  long            id_t;
typedef  long            hostid_t;
.Ee
.PP
The form
\f4daddr_t\fP
is used for disk addresses except in an
i-node on disk, see
\f4fs\fP(4).
Times are encoded in seconds since 00:00:00 UTC, January 1, 1970.
The major and minor parts of a device code
specify kind and unit number of a device
and are installation-dependent.
Offsets are measured in bytes from the beginning of a file.
The
\f4label_t\fP
variables are used to save the processor state
while another process is running.
.\"        @(#)types.5        6.2 of 9/6/83
