calmsacibis995/irix-6517-src/eoe/man/man5/ucontext.5
'\"macro stdmacro
.if n .pH g5.ucontext @(#)ucontext	41.1 of 1/30/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} ucontext 5 "" "\&"
.if \nX=1 .ds x} ucontext 5 ""
.if \nX=2 .ds x} ucontext 5 "" "\&"
.if \nX=3 .ds x} ucontext "" "" "\&"
.TH \*(x}
.SH NAME
\f4ucontext\f1 \- user context
.SH SYNOPSIS
.nf
\f4#include <ucontext.h>\f1
.fi
.SH DESCRIPTION
The
\f4ucontext\fP
structure defines the context of a thread of control within an
executing process.
.PP
This structure includes at least the following members:
.PP
.ft 4
.ft 1
.nf
ucontext_t *uc_link
sigset_t    uc_sigmask
stack_t     uc_stack
mcontext_t  uc_mcontext
.fi
.PP
\f4uc_link\fP
is a pointer to the context that is to be resumed when this context returns.
If
\f4uc_link\fP
is equal to 0, then this context is the main context, and the process
exits when this context returns.
The \f4uc_link\fP field is only meaningful
for contexts created using \f4makecontext\fP.
.PP
\f4uc_sigmask\fP
defines the set of signals that are blocked when this context is active (see
\f4sigprocmask\fP(2)).
.PP
\f4uc_stack\fP
defines the stack used by this context (see
\f4sigaltstack\fP(2)).
.PP
\f4uc_mcontext\fP
contains the saved set of machine registers and any implementation specific
context data.
Portable applications should not modify or access
\f4uc_mcontext\fP.
.SH SEE ALSO
getcontext(2),
sigaction(2),
sigaltstack(2),
sigprocmask(2),
makecontext(3C)
