calmsacibis995/irix-6517-src/eoe/man/man5/wstat.5
.if n .pH 5/gen/wstat @(#)wstat	43.4 of 7/17/92
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1990, 1989 AT&T
.TH wstat 5
.SH NAME
\f4wstat\f1 \- wait status
.SH SYNOPSIS
.nf
\f4#include <sys/wait.h>\f1
.fi
.SH DESCRIPTION
When a process waits for status from its children via either the
\f4wait\fP
or
\f4waitpid\fP
function, the status returned may be evaluated with the following
macros, defined in
\f4sys/wait.h\f1.
These macros evaluate to integral expressions.
The \f2stat\fP argument to these macros is the integer value returned from
\f4wait\fP
or
\f4waitpid\fP.
.PP
.TP 20
\f4WIFEXITED(\f2stat\fP)\f1
Evaluates to a non-zero value if status was returned for a child
process that terminated normally.
.TP
\f4WEXITSTATUS(\f2stat\fP)\f1
If the value of
\f4WIFEXITED(\f2stat\fP)\f1
is non-zero, this macro evaluates to the exit code that the child
process passed to
\f4_exit\fP
or
\f4exit\fP,
or the value that the child process returned from
\f4main\f1.
.TP
\f4WIFSIGNALED(\f2stat\fP)\f1
Evaluates to a non-zero value if status was returned for a child process
that terminated due to the receipt of a signal.
.TP
\f4WTERMSIG(\f2stat\fP)\f1
If the value of
\f4WIFSIGNALED(\f2stat\fP)\f1
is non-zero, this macro evaluates to the number of the signal that caused the
termination of the child process.
.TP
\f4WIFSTOPPED(\f2stat\fP)\f1
Evaluates to a non-zero value if status was returned for a child process
that is currently stopped.
.TP
\f4WSTOPSIG(\f2stat\fP)\f1
If the value of
\f4WIFSTOPPED(\f2stat\fP)\f1
is non-zero, this macro evaluates to the number of the signal that caused the
child process to stop.
.TP
\f4WIFCONTINUED(\f1\f2stat\f1\f4)\f1
Evaluates to a non-zero value if status was returned for a child
process that has continued.
.TP
\f4WCOREDUMP\f1(\f2stat\f1\f4)\f1
If the value of \f4WIFSIGNALED(\f2stat\fP)\f1 is non-zero, this
macro evaluates to a non-zero value if a core image of the terminated
child was created.
.SH SEE ALSO
exit(2),
wait(2),
waitpid(2)
