calmsacibis995/irix-6517-src/irix/man/man7m/cl.7m
'\"macro stdmacro
.na
.TH CL 7M
.SH NAME
\f4cl\fP \- CrayLink Driver

.SH SYNOPSIS
.na
\f4/hw/xplink/raw/*/*

.in
.SH DESCRIPTION

The \f4cl\fP module provides a raw device interface to XPC (cross
partition communication).  These devices take advantage of the XPC
rendezvous capabilities to allow DMA transfers directly from the source
to the destination without any intermediate copying if possible.  The
DMA operation is done using the BTE which supports transfers of multiple
cache lines on cache line boundaries.  Therefore, in order to avoid the
overhead of the \f4cl\fP driver copying data to an intermediate buffer,
the source and destination must be 128 byte aligned.  If the transfer is
not a multiple of 128 bytes, only the last part of the cache line will
be copied through an intermediate buffer.

.PP

The cross partition raw devices are located in the directory
\f3/hw/xplink/raw/<remote_partition>/<device_number>\fP, where
\f3<remote_partition>\fP is the partition ID to which a device should be
opened, and the \f3<device_number>\fP specifies which of the 16 possible
devies to open.  These devices appear in the \f4hwgraph\fP(4) the first
time a remote partition is discovered (or activated) as two digit
hexidecimal numbers.  They are never removed.  

.PP

Once a \f4cl\fP device is opened using the \f4open\fP(2) system call
(and closed using \f4close\fP(2)), the file descriptors may be used to
exchanged data with the remote partition using the \f4read\fP(2),
\f4write\fP(2), and \f4select\fP(2) system calls.  The devices provide a
byte stream type interface.

.PP

\f4open\fP(2), \f4close\fP(2), \f4read\fP(2), \f4write\fP(2), or
\f4select\fP(2) will fail for the \f4cl\fP devices and return to the
calling process if one or more of the following are true

.TP 12
\f3EIO\fP
XPC could not be established for the partition requested.

.TP 12
\f3ENODEV\fP
The partition to which communication is requested no longer exists.

.TP 12
\f3ENODEV\fP
The \f4cl\fP raw device requested does not exist on the remote
partition.

.TP 12
\f3EINTR\fP
A synchronous read or write was interrupted before completion.

.TP 12
\f3ENOTCONN\fP
The XPC channel for this raw device has been unexpectedly disconneced.

.TP 12
\f3EWOULDBLOCK\fP
The call would have blocked if the O_NONBLOCK flag had not been 
specified to the \f4open\fP(2) function.

.TP 12
\f3EBUSY\fP
The raw device is currently busy connecting or disconnecting with the
remote partition.

.TP 12
\f3EAGAIN\fP
The XPC layer is still setting up.

.TP 12
\f3ENOTSUP\fP
The partition we are trying to communicate with does not have support
for XPC.

.SH FILES
\f4/hw/xplink/raw/*/*\fP
.br
\f4/var/sysgen/master.d/cl\fP

.SH SEE ALSO
\f4open\fP(2), \f4close\fP(2), \f4select\fP(2), \f4read\fP(2),
\f4write\fP(2), \f4mkpart\fP(1m), \f4hwgraph\fP(4)

