calmsacibis995/irix-6517-src/irix/man/man7m/cserialio.7
'\"! tbl|mmdoc
'\"macro stdmacro
.TH cserialio 7
.SH NAME
cserialio \- character driver interface to serial communication ports
.SH SYNOPSIS
.nf
/dev/ttyc<\f3portno\f1>
.fi
.SH DESCRIPTION
On Origin, O2, Octane and Challenge/Onyx systems, the special files /dev/ttyc* provide
a character based interface (as opposed to a streams based interface)
to the system serial ports. The hardware accessed by each special file
is determined by the \f3portno\f1 portion of the pathname (see
serial(7) for further details). The character based interface is
intended to provide a low cost option for applications wishing to do
bulk data transfer via the serial ports with no character
interpretation. There is no line discipline associated with this port
type and no tty facilities are provided. 
.SH IOCTLS
The ttyc ports support a limited subset of the ioctl set used to
control ordinary tty ports. Specifically, ioctl functions which relate
directly to the hardware are supported, whereas ioctl functions which
relate to software functions of the tty interface such as the line
discipline are not supported and may either fail or be silently
ignored. In addition, streams ioctls will fail since this is not a
streams device.
.PP
For port hardware configuration, the ttyc interface supports the
following ioctls as described in termio(7): TCGETA, TCSETA, TCSETAW,
TCSETAF, TCGETS, TCSETS, TCSETSW, TCSETSF. Not all fields of the
termio struct are relevant to the ttyc interface. The following fields
are supported as described in termio(7): c_ospeed, CSIZE, CSTOPB,
PARENB, PARODD, CNEW_RTSCTS. In addition the port will generate a
SIGINT on reception of a break char if IGNBRK is false and BRKINT is
true. Lastly, reads from ttyc ports will be non-blocking if ICANON is
false, and VMIN and VTIME are 0. All other fields of the termio struct
are silently ignored.
.PP
The ttyc ports also honor the following ioctls as described in
termio(7): TCSBRK, TCFLSH. 
.PP
Lastly, the following ioctls are supported as described in
serial(7): SIOC_RS422, SIOC_EXTCLK, SIOC_ITIMER.
.SH SEE ALSO
serial(7), termio(7)
