calmsacibis995/irix-6517-src/irix/man/man7m/duart.7
'\"macro stdmacro
.TH DUART 7
.SH NAME
duart \- on-board serial ports
.SH SYNOPSIS
.B /dev/tty[dmf][1-4,45-56]
.SH DESCRIPTION
Each IRIS-4D system uses a DUART to connect the mouse and the keyboard.  Most 
models are also equipped with some number of additional `on-board' serial ports.
The Indigo, Indy, Indigo\u2\d, O2 and OCTANE have two ports;
and the Onyx
and the Challenge can be configured with as few as four serial
ports and as many as 16.  The first of these ports,
/dev/ttyd1, is often used for the `serial' or `debugging' console.  Other
ports are commonly used for serial terminal connections, modems, 
a dial-and-button box, or a bit-pad.
.PP
The Indigo, Indy and Indigo\u2\d have only DIN-8 connectors.
Onyx and Challenge
systems with a single IO4 board have 3 RS232 DB-9 ports, 2 DIN-8 powered 
peripheral ports, and 1 RS422 DB-9 port.  Each additional IO4 board provides 
three more RS232 DB-9 ports. All other systems have DB-9 connectors for 
all ports.  See
.IR serial (7)
for the pinout on the connectors.
.PP
Special files for the serial ports exist in the /dev directory.  These files,
tty[dfm][1-4] are created by
.IR MAKEDEV(1M).
The Challenge and the Onyx systems differ from previous systems in that
all of their DUARTS reside on the IO4 boards rather than on the processor
boards.  The ports on the master IO4 board are numbered tty[dfm][1-4].
TTY 4 is an RS422 port, and it provides differential signal lines as 
part of this protocol.  If multiple IO4 boards are installed on an
Onyx or Challenge system, these ports will tty[dfm]45-56.  The
second IO4 provides ports 45-47, the third IO4 provides ports 48-50, etc. 
.PP
Each line may be independently set to run at any of several speeds, as high as
19,200 or even 38,400 bps.  Various character echoing and interpreting
parameters can also be set.  See
.IR stty (1)
and
.IR termio (7)
for details.
.PP
By opening either the ttyd*, ttym*, or ttyf* device name of a port, different
hardware signals are supported.
Ttyd* is typically used for direct connect devices such as terminals;
ttym* is used for devices that use modem control such as modems; and ttyf*
is used for devices that understand hardware flow control such printers 
and high speed modems.
See
.IR serial (7)
for detailed information on supported signals.
.PP
The driver for this device must be configured in the kernel by specifying it 
with `INCLUDE' in the /var/sysgen/system file.
.SH FILES
/dev/tty[dmf][1-4,45-56]
.br
/dev/MAKEDEV
.br
/var/sysgen/system
.SH "SEE ALSO"
stty(1), serial(7), termio(7), keyboard(7), cdsio(7), system(4)
.* .so /pubs/tools/origin.sgi
