calmsacibis995/irix-6517-src/irix/man/man7m/fddi.7
'\"! tbl | mmdoc
'\"macro stdmacro
.TH FDDI 7
.SH NAME
fddi \- IRIS-4D Series FDDI controllers
.SH DESCRIPTION
The IRIS-4D Series supports local-area networking with the 
Fiber Distributed Data Interface (FDDI) token ring.
The FDDI protocol is supported with a hardware controller,
a kernel driver, and a Station Management (SMT) daemon.
Though the controllers may be different among IRIS-4Ds and over time,
their drivers and the daemon provide the same programming interface to
networking routines.
.P
The IRIS-4D FDDI controller is named using the following convention:
.sp
.TS
l l l.
Controller name	Type	IRIS model
ipg0, ipg1, ...	Single MAC,	(Power) Challenge DM/L/XL, (Power) Onyx
	Dual attachment
rns0, rns1, ...	Single MAC,	O2/OCTANE/Origin/Onyx2
	SAS, DAS, CDDI
xpi0, xpi1, ...	Single MAC,	Indy/Indigo/Indigo2/Indigo2 IMPACT
	SAS or DAS
xpi0, xpi1, ...	Single MAC,	(Power) Challenge/DM/L/XL, (Power) Onyx
	SAS or DAS
xpi0, xpi1, ...	Double MAC,	(Power) Challenge/DM/L/XL, (Power) Onyx
	SAS or DAS
.TE
.sp
.P
The FDDI boards are initialized during system startup with
.I smtconfig
from
.I /etc/init.d/network 
(see
.IR network (1M)
for details).
.SH DIAGNOSTICS
Various error messages are printed by the kernel when a problem is encountered.
The message is preceded by the controller name, for example, ipg0.
If they occur repeatedly, contact your product support service for assistance.
Use the 
.IR hinv (1M)
command to determine the hardware revision number.
Counts of FDDI input and output errors can be displayed with the command
.I "netstat \-i"
(see
.IR netstat (1M)).
FDDI status monitoring can be done using
.IR smtstat (1).
.SH "SEE ALSO"
network(1M), smtstat(1), smtd(1M), smtconfig(1M)
