calmsacibis995/irix-6517-src/irix/man/man7m/pcmouse.7
'\"! tbl|mmdoc
'\"macro stdmacro
.TH pcmouse 7
.SH NAME
pcmouse \- mouse specifications
.SH DESCRIPTION
Indy, Indigo2, O2, OCTANE and Onyx2 systems uses an industry
standard PC (6-pin mini-DIN) mouse port.
All newer SGI systems now use this mouse port which allows easy
attachment of third party mice, trackballs, or other pointing
devices.
.SS Compatibility
Third-party mouse-port-compatible (also called "PS/2 compatible,"
"Pointing Device Port" or "PDP") pointing devices commonly
sold into the IBM PC-compatible market can be used.
Note that the common Microsoft-compatible serial mice do not work
on the mouse port.
Three-button devices are preferred, but two-button devices operate
as if the middle button does not exist.
.PP
The following mice have been tested (many only briefly):
.sp .8v
.nf
	SGI PS/2 mice
	IBM PS/2 Model 6450350 (old style)
	IBM PS/2 Model 33G5430 (new style)
	IBM RS/6000 P/N 11F8895 (Logitech M-SB9-6MD)
	Alps Glidepoint (PS/2 mouse port version)
	Logitech MouseMan Serial & Mouseport Version
	Logitech TrackMan Serial & Mouseport Version
	Logitech M-SE9-6MD
	Logitech M-SF15-6MD
	Microsoft Mouse Serial & PS/2 Version (only two buttons)
	MicroSpeed MicroTRAC trackball (only two buttons)
	Mouse Systems White Mouse
	Mouse Systems PC Mouse III (in two button mode only)
.fi
.SS Protocol
The PS/2 mouse uses a three-byte data block.
The first byte is a control byte with the format: YO XO YS XS F M R L
where [XY]O is an overflow indicator, [XY]S is the sign of the delta
bytes, F is floats depending on the particular mouse used,
and M R L are middle, right, and left buttons (1 indicates pressed)
respectively.
Byte two is the X delta and byte three is the Y delta.
.SS Pinout
The mouse connector is a 6 pin mini-DIN connector with the
shield connected to the system chassis:
.sp .8v
.ne 7
.eo
.ce
------
.ce
/ 5 3  \
.ce
| ---  1 |
.ce
| ---  2 |
.ce
\ 6 4  /
.ce
------
.ec
.sp .8v
.TS
center, tab(>);
c s
c|l.
\f3PIN ASSIGNMENTS\f1
_
Pin>Description
_
1>Data
2>Reserved
3>Signal Ground
4>Power +5V
5>Clock
6>Reserved
.TE
.SH NOTES
All Silicon Graphics systems, except those noted above use the mouse
described in \f2mouse\f1(7).
.PP
Some Silicon Graphics mice (particularly Silicon Graphics PN 9150800)
look very similar to the
old style Indigo\u2\d mouse (Silicon Graphics PN 9150809) and even use
the same 6-pin mini-DIN connector, but are not compatible.
.SH SEE ALSO
prom(1M),
keyboard(7),
mouse(7),
pckeyboard(7).
