calmsacibis995/irix-6517-src/irix/man/man7m/tokenring.7
'\"! tbl | mmdoc
'\"macro stdmacro
.TH TOKENRING 7
.SH NAME
tokenring \- IRIS-4D Series Token Ring controllers
.SH DESCRIPTION
The IRIS-4D Series supports local-area networking with the Token Ring.
The Token Ring protocol is supported with a hardware controller,
a kernel driver.
Though the controllers may be different among IRIS-4Ds and over time,
their drivers and the daemon provide the same programming interface to
networking routines.
.P
The IRIS-4D TokenRing controller is named using the following convention:
The suffix is the controller unit number.
.sp
.TS
l l l.
Controller name	Type	IRIS model
mtr0, mtr1, ...	PCI tokenring	O2, OCTANE
.TE
.sp
.P
Depending on the model, an IRIS-4D can support several Tokenring
controllers, allowing it to act as a gateway among different local
networks.
.P
The Token Ring boards are initialized during system startup from
.I /etc/init.d/network 
(see
.IR network (1M)
for details).
.P
The Tokenring boards can be configured to be used in 16Mbit/sec ring or
4Mbit/sec ring. (see
.IR mtrconfig (1M)
for details).
.P
Each Token Ring packet contains a 14-byte MAC(Media Access Control) header,
up to 18-byte Source Route information, 3 or 4 byte LLC header, and
5-byte SNAP(Sub-Network Access Protocol) depending on DSAP value in LLC
header:
.Ex 6
typedef struct tr_mac {
        u_char          mac_ac;         /* access control */
        u_char          mac_fc;         /* frame control */
        u_char          mac_da[6];	/* Destination MAC address */
        u_char          mac_sa[6];	/* Source MAC address */
} TR_MAC;
.Ee
.sp
.Ex 4
typedef struct tr_rii{
        u_short         rii;            /* routing information */
        u_short         sgt_nos[8];	/* variable up to 7 hops */
} TR_RII;
.Ee
.sp
.Ex 5
typedef struct llc {
        u_char          llc_dsap;	/* Dest SAP */
        u_char          llc_ssap;	/* Src SAP */
        u_char          llc_cont[2];	/* Control: up to 2 bytes */
} LLC;
.Ee
.sp
.Ex 4
typedef struct snap {
        u_char snap_org[3];		/* Protocol ID or Org Code */
        u_char snap_etype[2];		/* Ether Type */
} SNAP;
.Ee
.SH DIAGNOSTICS
Various error messages are printed by the kernel when a problem is encountered.
The message is preceded by the controller name, for example, mtr0.
If they occur repeatedly, contact your product support service for assistance.
Use the 
.IR mtrconfig (1M)
command to determine the software revision number.
Counts of Token Ring input and output errors can be displayed with the command
.I "netstat \-i"
(see
.IR netstat (1M)).
.SH NOTE
IEEE 802.5 token ring requires the board plugged in to MAU unit to be
initialized. Thus the tokenring cable must be plugged in to the MAU
unit before any tokenring initilization.
.SH "SEE ALSO"
network(1M), netstat(1), ifconfig(1M), mtrconfig(1M), hinv(1M)
