calmsacibis995/irix-6517-src/eoe/man/man1m/acct.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH acct 1M
.SH NAME
\f4acct\f1:  \f4acctdisk\f1, \f4acctdusg\f1, \f4accton\f1, \f4acctwtmp\f1 \f4closewtmp\f1, \f4utmp2wtmp\f1 \- overview of accounting and miscellaneous accounting commands
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/acctdisk
/usr/lib/acct/acctdusg \f1[\f4-u\f1 \f2file\f1] [\f4-p\f1 \f2file\f1]
\f4/usr/lib/acct/accton\f1 [\f2file\fP]
\f4/usr/lib/acct/acctwtmp\f1 "\f2reason\fP"
\f4/usr/lib/acct/closewtmp
/usr/lib/acct/utmp2wtmp\f1
.fi
.SH DESCRIPTION
Accounting software is structured as a set of tools
(consisting of both C programs and shell procedures)
that can be used
to build accounting systems.
\f4acctsh\fP(1M)
describes the set of shell procedures built on top of
the C programs.
.PP
Connect-time accounting is handled by various programs that write
records into
\f4/var/adm/wtmp\fP,
as described in
\f4utmp\fP(4).
The programs described in
\f4acctcon\fP(1M)
convert this file into session and charging records,
which are then summarized by
\f4acctmerg\fP(1M).
.PP
Process accounting is performed by the
UNIX
system kernel.
Upon termination of a process,
one record per process is written to a file
(normally
\f4/var/adm/pacct\fP).
The programs in
\f4acctprc\fP(1M)
summarize this data for charging purposes;
\f4acctcms\fP(1M)
is used to summarize command usage.
Current process data can be examined using
\f4acctcom\fP(1).
.PP
Process accounting and connect-time accounting (or any accounting records
in the \f4tacct\f1 format described in
\f4acct\fP(4))
can be merged and summarized into total accounting records by
\f4acctmerg\fP
(see \f4tacct\fP format in
\f4acct\fP(4)).
\f4prtacct\fP
(see \f4acctsh\fP(1M))
is used to format any or all accounting records.
.PP
\f4acctdisk\fP
reads lines that contain user
ID,
login name, and number of
disk blocks and converts them to total accounting
records that can be merged with other accounting records.
.PP
\f4acctdusg\fP
reads its standard input (usually from
\f4find / -print\f1)
and computes disk resource consumption
(including indirect blocks) by login.
If \f4-u\fP is given, records consisting of those filenames for which
\f4acctdusg\fP
charges no one are placed in
\f2file\f1
(a potential source for finding users trying to avoid disk charges).
If \f4-p\fP is given,
\f2file\f1
is the name of the password file.
This option is not needed if the password file is
\f4/etc/passwd\fP.
(See \f4diskusg\fP(1M) for more details.)
.PP
\f4accton\fP
alone turns process accounting off.
If
\f2file\f1
is given,
it must be the name of an existing file
to which the kernel appends process accounting records
(see
\f4acct\fP(2)
and
\f4acct\fP(4)).
.PP
\f4acctwtmp\fP
writes a
\f4utmp\fP(4)
record to its standard output.
The record contains the current time
and
a string of characters that describe the
\f2reason\f1.
A record type of
ACCOUNTING
is assigned (see
\f4utmp\fP(4)).
\f2reason\f1
must be a string of 11 or fewer characters, numbers,
\f4$\f1,
or spaces.
The accounting startup and shutdown scripts
\f4/usr/lib/acct/startup\fP
and
\f4/usr/lib/acct/shutacct\fP
use the
\f4acctwtmp\fP command to record system startup and shutdown events.
.PP
For each user currently logged on, \f4closewtmp\f1 puts a false
\f4DEAD_PROCESS\f1 record in the \f4/var/adm/wtmp\f1 file.
\f4runacct\f1 (see \f4runacct\f1(1M)) uses this false \f4DEAD_PROCESS\f1
record so that the connect-time accounting procedures can track the time
used by users logged on before \f4runacct\f1 was invoked.
.PP
For each user currently logged on, \f4runacct\f1 uses \f4utmp2wtmp\f1
to create an entry in the file \f4/var/adm/wtmp\f1, created by \f4runacct\f1.
Entries in \f4/var/adm/wtmp\f1 enable subsequent invocations of
\f4runacct\f1 to account for connect times of users currently logged in.
.SH "ENVIRONMENT"
The file
\f4/etc/config/acct\fP
controls the automatic startup and periodic report generation
of the accounting subsystem.
If this file contains the flag
value \f4on\f1, process accounting is enabled by
\f4/etc/init.d/acct\fP
each time the system is brought up, and nightly reports are
generated and placed in the directory
\f4/var/adm/acct/sum\fP.
\f4chkconfig\fP(1M)
should be used to modify the contents of the \f4/etc/config/acct\fP file.
.PP
The accounting software consists of accounting report generation software
with built-in tables of fixed
size that might need to be increased on larger systems.
All of these programs now check the environment when they are invoked
for the requested table sizes.
The accepted environment variables are
.TP 16
\f2ACCT_MAXUSERS\fP
Indicates the number of different users that can be reported by
\f4diskusg\fP(1M) or \f4acctdusg\fP(1M).
.TP
\f2ACCT_MAXIGN\fP
Indicates the number of different filesystem names to be ignored
by \f4diskusg\fP(1M) in its report.
.TP
\f2ACCT_A_SSIZE\fP
Indicates the maximum number of sessions that can be reported by
\f4acctprc1\f1(1M)
in one accounting run.
.TP
\f2ACCT_A_TSIZE\fP
Indicates the maximum number of login lines that can be reported by
\f4acctcon\fP(1M) and \f4acctcon1\fP(1M).
.TP
\f2ACCT_A_USIZE\fP
Indicates the number of distinct login names in one accounting run of
\f4acctprc\fP(1M), \f4acctprc1\fP(1M), \f4acctprc2\fP(1M), and \f4acctcon\fP(1M).
.TP
\f2ACCT_CSIZE\fP
Indicates the maximum number of distinct commands in one accounting run
of \f4acctcms\fP(1M).
.PP
These environment variables can be specified in the accounting-related
entries of the appropriate
\f2crontab\fP files.
.SH FILES
.nf
.ta 19
\f4/etc/passwd\fP	used for login name to user ID conversions
\f4/usr/lib/acct\fP	holds all accounting commands listed in section 1M
	of this manual
\f4/var/adm/pacct\fP	current process accounting file
\f4/var/adm/wtmp\fP	login/logoff history file
\f4/etc/config/acct\fP	if it contains \f4on\f1, accounting runs automatically
.fi
.SH REFERENCES
acctcms(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctprc(1M),
acctsh(1M),
chkconfig(1M),
diskusg(1M),
fwtmp(1M),
runacct(1M),
acct(2),
acct(4),
utmp(4).
