calmsacibis995/irix-6517-src/eoe/man/man1m/acctcms.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH acctcms 1M
.SH NAME
\f4acctcms\f1 \- command summary from per-process accounting records
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/acctcms\f1 [\f4-a\f1 [\f4-p\f1] [\f4-o\f1]] [\f4-c\f1] \c
[\f4-j\f1] [\f4-n\f1] [\f4-s\f1] [\f4-t\f1] \f2files\fP
.fi
.SH DESCRIPTION
\f4acctcms\fP
reads one or more
\f2files\f1,
normally in the form described in
\f4acct\fP(4).
It adds all records for processes that
executed identically named commands,
sorts them,
and writes them to the standard output,
normally using an internal summary format.
The options are:
.TP
\f4-a\f1
Print output in
ASCII
rather than in the internal summary format.
The output includes command name,
number of times executed, total kcore minutes, total CPU minutes,
total real minutes, mean size (in kilobytes), mean CPU
minutes per invocation, hog factor,
characters transferred, and blocks read and written, as in
\f4acctcom\fP(1).
Output is normally sorted by total kcore minutes.
.TP
\f4-c\f1
Sort by total CPU time, rather than by total kcore minutes.
.TP
\f4-j\f1
Combine all commands invoked only once under ``***other.''
.TP
\f4-n\f1
Sort by number of command invocations.
.TP
\f4-s\f1
Any filenames encountered hereafter are already in internal summary format.
.TP
\f4-t\f1
Process all records as total accounting records.
The default internal summary format splits
each field into prime- and nonprime-time parts.
This option combines the prime- and nonprime-time parts into a
single field that is the total of both
and provides upward compatibility with old-style
(that is, pre-UNIX System V Release 4.0)
\f4acctcms\fP
internal summary format records.
.PP
The following options can be used only with
the
\f4-a\f1
option.
.TP
\f4-p\f1
Output a prime-time-only command summary.
.TP
\f4-o\f1
Output a nonprime-time only (offshift) command summary.
.PP
When
\f4-p\f1
and
\f4-o\f1
are used together,
a combination prime- and nonprime-time report
is produced.
All the output summaries are
total usage except
number of times executed, CPU minutes,
and real minutes, which are
split into prime and nonprime.
.PP
\f4acctcms\fP
checks the environment variable
\f2ACCT_CSIZE\fP
to figure out the maximum number of distinct commands it might need to report.
.PP
A typical sequence for performing daily command accounting and
for
maintaining a running total is:
.Ex
acctcms file ... > today
cp total previoustotal
acctcms -s today previoustotal > total
acctcms -a -s today
.Ee
.SH REFERENCES
acct(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctprc(1M),
acctsh(1M),
fwtmp(1M),
runacct(1M),
acct(2),
acct(4),
utmp(4).
.SH NOTICES
Unpredictable output results if
\f4-t\f1
is used on new-style internal summary format files
or if it is not used with old-style internal summary format files.
