calmsacibis995/irix-6517-src/eoe/man/man1m/acctcon.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH acctcon 1M
.SH NAME
\f4acctcon\f1, \f4acctcon1\f1, \f4acctcon2\f1 \- connect-time accounting
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/acctcon\f1 [\f2options\fP]
\f4/usr/lib/acct/acctcon1\f1 [\f2options\fP]
\f4/usr/lib/acct/acctcon2\f1
.fi
.SH DESCRIPTION
\f4acctcon\f1 converts a sequence of login/logoff records to total
accounting records (see the \f4tacct\f1 format in \f4acct\f1(4)).
Login/logoff records are read from standard input.
The file
\f4/var/adm/wtmp\f1 is usually the source of the login/logoff
records; however, because it may contain corrupted
records or system date changes, it should first be fixed using
\f4wtmpfix\f1.
The fixed version of file \f4/var/adm/wtmp\f1 can then
be redirected to \f4acctcon\f1.
The \f4tacct\f1 records are written to
standard output.
Here are the options for \f4acctcon\f1:
.TP 10
\f4-l\f1 \f2file\f1
\f2file\f1
is created to contain a summary of line usage showing
line name, number of minutes used, percentage of total elapsed time used,
number of sessions charged, number of logins,
and number of logoffs.
This file helps track line usage,
identify bad lines, and find software and hardware oddities.
Hangup, termination of
\f4login\fP(1),
and termination of the login shell each generate logoff records, so that
the number of logoffs is often three to four times the number of sessions.
See
\f4init\fP(1M)
and
\f4utmp\fP(4).
.TP
\f4-o\f1 \f2file\f1
\f2file\f1
is filled with an overall record for the accounting period,
giving starting time,
ending time,
number of reboots,
and number of date changes.
.PP
\f4acctcon\f1 is a combination of the programs \f4acctcon1\f1 and
\f4acctcon2\f1.
\f4acctcon1\f1 converts login/logoff records, taken from
the fixed \f4/var/adm/wtmp\f1 file, to ASCII output.
\f4acctcon2\f1 reads the ASCII records produced by \f4acctcon1\f1 and
converts them to \f4tacct\f1 records.
\f4acctcon1\f1 can be
used with the \f4-l\f1 and \f4-o\f1 options, described above, as well as
with the following options:
.TP 10
\f4-p\f1
Print input only,
showing line name,
login name,
and time (in both numeric and date/time formats).
.TP
\f4-t\f1
\f4acctcon1\fP
maintains a list of lines on which users are logged in.
When it reaches the end of its input,
it emits a session record for each line that still appears to be active.
It normally assumes that its input is a current file,
so that it uses the current time as the ending time for
each session still in progress.
The
\f4-t\f1
flag causes it to use, instead, the last time found in its input,
thus assuring reasonable and repeatable numbers for noncurrent files.
.PP
\f4acctcon1\fP and \f4acctcon\fP
check the environment variable
\f2ACCT_A_TSIZE\fP
to figure out the maximum number of login lines that it might need to report.
\f4acctcon\fP
checks the environment variable
\f2ACCT_A_USIZE\fP
to figure out the maximum number of distinct login names it might need
to report.
.SH "EXAMPLES"
The \f4acctcon\f1 command is typically used as follows:
.Ex
\f4acctcon -l lineuse -o reboots < tmpwtmp > ctacct\f1
.Ee
The \f4acctcon1\f1 and \f4acctcon2\f1 commands are typically
used as follows:
.Ex
\f4acctcon1 -l lineuse -o reboots < tmpwtmp | sort +1n +2 > ctmp
acctcon2 < ctmp > ctacct\f1
.Ee
.SH FILES
\f4/var/adm/wtmp\f1
.SH REFERENCES
acct(1M),
acctcms(1M),
acctcom(1),
acctmerg(1M),
acctprc(1M),
acctsh(1M),
fwtmp(1M),
init(1M),
login(1),
runacct(1M),
acct(2),
acct(4),
utmp(4).
.SH NOTICES
The line-usage report is confused by date changes.
Use \f4wtmpfix\fP (see \f4fwtmp\fP(1M)), with the \f4/var/adm/wtmp\f1
file as an argument, to correct this situation.
