calmsacibis995/irix-6517-src/eoe/man/man1m/acctsh.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH acctsh 1M
.SH NAME
\f4acctsh\f1:  \f4chargefee\f1, \f4ckpacct\f1, \f4dodisk\f1, \f4lastlogin\f1, \f4monacct\f1, \f4nulladm\f1, \f4prctmp\f1, \f4prdaily\f1, \f4prtacct\f1, \f4shutacct\f1, \f4startup\f1, \f4turnacct\f1 \- shell procedures for accounting
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/chargefee\f1 \f2login-name number\fP
\f4/usr/lib/acct/ckpacct\f1 [\f2blocks\fP]
\f4/usr/lib/acct/dodisk\f1 [\f4-o\f1] [\f2files\fP ...]
\f4/usr/lib/acct/lastlogin
/usr/lib/acct/monacct\f1 \f2number\fP
\f4/usr/lib/acct/nulladm\f1 \f2file\fP
\f4/usr/lib/acct/prctmp
/usr/lib/acct/prdaily\f1 [\f4-l\f1] [\f4-c\f1] [\f2mmdd\fP]
\f4/usr/lib/acct/prtacct\f1 \f2file\fP ["\f2heading\fP"]
\f4/usr/lib/acct/shutacct\f1 ["\f2reason\fP"]
\f4/usr/lib/acct/startup
/usr/lib/acct/turnacct on\f1 | \f4off\f1 | \f4switch\f1
.fi
.SH DESCRIPTION
\f4chargefee\fP
can be invoked to charge a
\f2number\f1
of units to \f2login-name\f1.
A record is written to \f4/var/adm/fee\f1,
to be merged with other accounting records by \f4runacct\f1.
.PP
\f4ckpacct\fP
should be initiated via \f4cron\fP(1M) to
periodically check the size of \f4/var/adm/pacct\f1.
If the size exceeds \f2blocks\fP, 1000 by default,
\f4turnacct\fP
is invoked with argument \f2switch\f1.
If the number of free disk blocks in the
\f4/var\fP
filesystem
falls below 500,
\f4ckpacct\fP
automatically turns off the collection of
process accounting records via
the
\f2off\f1
argument to \f4turnacct\fP.
When at least 500 blocks are restored,
the accounting is activated again
on the next invocation of \f4ckpacct\f1.
This feature is sensitive to the frequency at which
\f4ckpacct\fP
is executed, usually by \f4cron\fP.
.PP
\f4dodisk\fP
should be invoked by
\f4cron\fP
to perform the disk accounting functions.
By default, it uses
\f4diskusg\fP to do accounting on \f4efs\fP and \f4xfs\fP
filesystems in \f4/etc/fstab\fP.
Note that \f4dodisk\f1
reports accounting information in \f4/var/adm/dtmp\fP.
.\"\f4diskusg\f1,
.\"\f4bfsdiskusg\f1,
.\"\f4sfsdiskusg\f1,
.\"\f4vxdiskusg\f1,
.\"and
.\"\f4ufsdiskusg\f1
.\"[see \f4diskusg\f1(1M)] to do
.\"disk accounting on the \f4S5\f1,
.\"\f4bfs\fP, \f4sfs\fP, \f4vxfs\fP, and \f4ufs\fP
.\"file systems in \f4/etc/vfstab\f1
.\"and \f4acctdusg\fP [see \f4acct\f1(1M)] on other file systems.
Further note that when \f4dodisk\f1 uses \f4/etc/fstab\f1, it
skips remote resources.
If the
\f4-o\f1
flag is used, it uses \f4acctdusg\f1 (see \f4acct\f1(1M)) to do a
slower version of disk accounting by login directory for all filesystems.
\f2files\f1
specifies the one or more filesystem names where disk accounting
is to be done.
If
\f2files\f1
are used, disk accounting is done on these
filesystems only.
If the
\f4-o\f1
flag is used,
\f2files\f1
should be mount points of mounted filesystems.
If the \f4-o\f1 option is omitted, \f2files\f1 should be the special
filenames of mountable filesystems.
.PP
\f4lastlogin\fP
is invoked by
\f4runacct\fP
to update \f4/var/adm/acct/sum/loginlog\f1,
which shows the last date on which each person logged in.
.PP
\f4monacct\fP
should be invoked once each month or each accounting
period.
\f2number\f1
indicates
which month or period it is.
If
\f2number\f1
is not given, it defaults to the
current month (01\-12).
This default is useful if
\f4monacct\fP
is to execute via
\f4cron\fP(1M)
on the first day of each month.
\f4monacct\fP
creates summary files in
\f4/var/adm/acct/fiscal\f1
and restarts the summary files in \f4/var/adm/acct/sum\f1.
.PP
\f4nulladm\fP
creates
\f2file\f1
with mode 664 and ensures that owner and group are \f4adm\f1.
It is called by
various accounting shell procedures.
.PP
\f4prctmp\fP
can be used to print the session record file (normally
\f4/var/adm/acct/nite/ctmp\f1 is
created by
\f4acctcon1\f1 (see \f4acctcon\f1(1M)).
.PP
\f4prdaily\fP
is invoked by
\f4runacct\fP
to format a report of the previous day's accounting data.
The report resides in
\f4/var/adm/acct/sum/rprt/mmdd\f1
where
\f2mmdd\f1
is the month and day of the report.
The current daily accounting reports can be printed by typing \f4prdaily\fP.
Previous days' accounting reports can be printed by using the
\f2mmdd\f1
option and specifying the exact report date desired.
The
\f4-l\f1
flag prints a
report of exceptional usage by login ID for
the specified date.
Previous daily reports are cleaned up
and therefore inaccessible after each invocation of \f4monacct\fP.
The
\f4-c\f1
flag prints a report
of exceptional resource usage by command
and can be used on the current day's accounting data only.
.PP
\f4prtacct\fP
can be used to format and print any total accounting (\f4tacct\fP) file.
.PP
\f4shutacct\fP
is invoked during a system shutdown
to turn process accounting
off and append a reason record to \f4/var/adm/wtmp\f1.
.PP
\f4startup\fP
can be invoked when the system is brought to a multiuser state to
turn process accounting on.
.PP
\f4turnacct\fP
is an interface to
\f4accton\fP
(see
\f4acct\fP(1M))
to turn process accounting \f4on\fP or \f4off\fP.
The
\f4switch\fP
argument moves the current
\f4/var/adm/pacct\f1
to the next free name in
\f4/var/adm/pacct\f2incr\fP\f1
(where
\f2incr\f1
is a number starting with \f41\f1
and incrementing by one
for each additional \f4pacct\f1 file),
then turns accounting back on again.
This procedure is called by
\f4ckpacct\fP
and thus can be taken care of by
the \f4cron\fP and used to keep \f4pacct\fP
to a reasonable size.
\f4shutacct\f1 uses \f4turnacct\f1 to stop
process accounting.
\f4startup\f1 uses \f4turnacct\f1 to start
process accounting.
.SH FILES
.PD 0
.TP 27
\f4/var/adm/fee\f1
accumulator for fees
.TP
\f4/var/adm/pacct\f1
current file for per-process accounting
.TP
\f4/var/adm/pacct\f2incr\fP\f1
used if \f4pacct\f1 gets large and during
execution of daily accounting procedure
.TP
\f4/var/adm/wtmp\f1
login/logoff summary
.TP
\f4/usr/lib/acct/ptelus.awk\f1
contains the limits for exceptional
usage by login ID
.TP
\f4/usr/lib/acct/ptecms.awk\f1
contains the limits for exceptional
usage by command name
.TP
\f4/var/adm/acct/nite\f1
working directory
.TP
\f4/usr/lib/acct\f1
holds all accounting commands in
section 1M
.TP
\f4/var/adm/acct/sum\f1
summary directory contains information
for \f4monacct\f1
.TP
\f4/var/adm/acct/fiscal\f1
fiscal reports directory
.PD
.SH REFERENCES
acct(1M),
acctcms(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctprc(1M),
cron(1M),
diskusg(1M),
fwtmp(1M),
runacct(1M),
acct(2),
acct(4),
utmp(4).
