calmsacibis995/irix-6517-src/eoe/man/man1m/acctprc.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH acctprc 1M
.SH NAME
\f4acctprc\f1, \f4acctprc1\f1, \f4acctprc2\f1 \- process accounting
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/acctprc
/usr/lib/acct/acctprc1\f1 [\f2ctmp\fP]
\f4/usr/lib/acct/acctprc2\f1
.fi
.SH DESCRIPTION
\f4acctprc\f1 reads standard input, in the form described by
\f4acct\f1(4), and converts it to total accounting records
(see the \f4tacct\f1 record in \f4acct\f1(4)).
\f4acctprc\f1 divides CPU time into prime time and nonprime time and
determines mean memory size (in memory segment units).
\f4acctprc\f1 then summarizes the \f4tacct\f1 records, according
to user IDs, and adds login names corresponding to the user IDs.
The summarized records are then written to standard output.
\f4acctprc1\fP
reads input in the form described by
\f4acct\fP(4),
adds login names corresponding to user IDs,
then writes for each process an ASCII line giving user ID, login name,
prime CPU time (tics), nonprime CPU time (tics),
and mean memory size (in memory segment units).
If \f2ctmp\f1 is given,
it is expected to contain a list of login sessions
sorted by user ID and login name.
If this file is not supplied,
it obtains login names from the password file, just as
\f4acctprc\f1 does.
The information in \f2ctmp\f1
helps it distinguish between different login names sharing the same user
ID.
.PP
From standard input,
\f4acctprc2\fP
reads records in the form written by
\f4acctprc1\fP,
summarizes them according to user ID and name,
then writes the sorted summaries to the standard output
as total accounting records.
.PP
\f4acctprc1\fP
checks the environment variable
\f2ACCT_A_SSIZE\fP
to figure out the maximum number of sessions that it might need to report
in one accounting run.
.PP
All three of these commands check the environment variable
\f2ACCT_A_USIZE\fP
to figure out the maximum number of distinct login names that need to be reported in one accounting run.
.SH "EXAMPLES"
The \f4acctprc\f1 command is typically used as shown below:
.Ex
\f4acctprc < /var/adm/pacct > ptacct\f1
.Ee
The \f4acctprc1\f1 and \f4acctprc2\f1 commands are typically used as
shown below:
.Ex
\f4acctprc1 ctmp < /var/adm/pacct \(bv acctprc2 > ptacct\f1
.Ee
.SH FILES
\f4/etc/passwd\fP
.SH REFERENCES
acct(1M),
acctcms(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctsh(1M),
cron(1M),
fwtmp(1M),
runacct(1M),
acct(2),
acct(4),
utmp(4).
.SH NOTICES
Although it is possible for \f4acctprc1\f1 to distinguish among login names
that share user IDs for commands run normally,
it is difficult to do this for those commands run from
\f4cron\fP(1M), for example.
A more precise conversion can be done using the
\f4acctwtmp\fP program in \f4acct\fP(1M).
\f4acctprc\f1 does not distinguish between users with identical user IDs.
.P
A memory segment of the mean memory size is a unit of measure
for the number of bytes in a logical memory segment on a particular
processor.
