calmsacibis995/irix-6517-src/eoe/man/man1m/amconfig.1m
'\"macro stdmacro
.if n .pH man1.amconfig @(#)amconfig	30.3 of 06/28/99
.nr X
.if \nX=0 .ds x} amconfig 1m "" "\&"
.if \nX=1 .ds x} amconfig 1m ""
.if \nX=2 .ds x} amconfig 1m "" "\&"
.if \nX=3 .ds x} amconfig "" "" "\&"
.TH \*(x}
.SH NAME
amconfig \- check or modify availmon configuration values
.SH SYNOPSIS

\f3/usr/etc/amconfig\f1 [ {\f3autoemail\f1|\f3shutdownreason\f1|
                     \f3tickerd\f1|\f3hinvupdate\f1} [ {\f3on\f1|\f3off\f1} ] ]
.br                      
\f3/usr/etc/amconfig\f1 \f3statusinterval\f1 [ \f2days\f1 ]
.br 
\f3/usr/etc/amconfig\f1 \f3tickduration\f1   [ \f2seconds\f1 ]
.br
\f3/usr/etc/amconfig autoemail.list\f1
.fi
.SH DESCRIPTION
.I amconfig
is used to configure \f2availmon\f1(5) via four configuration flags, two
configuration values, and a list of email addresses.
If no argument is given,
\f2amconfig\f1 shows the status of all flags and values and the content of the
email lists.
.P
The first synopsis is for configuration flags.  In this case,
usage for showing status and turning flags on or off is
the same as for \f2chkconfig\f1(1M).
.P
The \f3autoemail\f1 flag controls automatic
distribution of availmon reports according to \f3autoemail.list\f1.
.P
The \f3shutdownreason\f1 flag enables prompting for the reason for taking
the system down.  
.P
The \f3tickerd\f1 flag enables system uptime monitoring.  
.P
The \f3hinvupdate\f1 flag enables checking for
hardware inventory changes on each reboot and include such information
in diagnosis reports.   
.P
The second synopsis is for modifying the interval of
sending status reports. Availmon will send status reports periodically 
if the system is up for an extended period of time, according to the 
value of \f3statusinterval\f1. If the interval is zero, no status reports will be
sent. The status reports will be sent only if \f3tickerd\f1 is \f3on\f1.
.P
The third synopsis is for modifying \f3tickduration\f1 value. \f2Eventmond\f1(1M) records system 
uptime in tickfile (/var/adm/avail/.save/lasttick) every \f3tickduration\f1 seconds.
This information is used to estimate uptime in the case of a system hang.
.P
The fourth synopsis is for modifying email lists for automatic
distribution of availmon reports. There are three kinds of reports: 
availability, diagnosis and pager.
Availability and diagnosis reports can be sent in any of three
formats: compressed and encrypted, compressed, and plain text.
Pager reports are formatted only as concise plain text.
\f2amconfig\f1 invokes \f2vi\f1(1) to edit the email lists, which
consist of report format specifications and associated address lists.
The address lists can be edited, but the report format specifications should not be modified.
If an address list is long, it can be split into several entries (lines) with the
same report format specification, but and the total length of the addresses 
list cannot exceed 1024 characters. An alias can be used to shorten the total length.
.P
If an address is added to \f3autoemail.list\f1 and \f3autoemail\f1 is
\f3on\f1, \f2amconfig\f1 will send a registration report to the newly
configured address.  Or if an existing address is deleted (and
\f3autoemail\f1 is \f3on\f1), \f2amconfig\f1 will send a deregistration
report to the deleted address.  For either action, there is no need
to change the \f3autoemail\f1 setting.
.P
Default configuration upon installation is:
.TP
.I autoemail
\f3off\f1   
.TP
.I shutdownreason
\f3on\f1     for high-end systems
.br
\f3off\f1    otherwise
.TP
.I tickerd
\f3on\f1     for high-end systems
.br
\f3off\f1    otherwise
.TP
.I hinvupdate
\f3on\f1     for high-end systems
.br
\f3off\f1    otherwise
.TP
.I statusinterval
\f360\f1     (disabled if tickerd is off)
.TP
.I tickduration
\f3300\f1    (disabled if tickerd is off)
.TP
.I autoemail.list
availability (compressed,encrypted):
.br
availability (compressed):
.br
availability (text):
.br
diagnosis (compressed,encrypted): \f3availmon@csd.sgi.com\f1
.br
diagnosis (compressed):
.br
diagnosis (text):
.br
pager (text):
.PD
.SH SEE ALSO
esp(5),
availmon(5),
eventmond(1M),
chkconfig(1M),
vi(1).
