calmsacibis995/irix-6517-src/eoe/man/man1m/arp.1m
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)arp.1m	6.2 (Berkeley) 5/20/86
.\"
.nr X
.if \nX=0 .ds x} arp 1M "Silicon Graphics" "\&"
.TH \*(x}
.SH NAME
arp \- address resolution display and control
.SH SYNOPSIS
.nf
\f3arp \f1[ \f3\-nv\f1 ] \f2hostname\f1
\f3arp \f1[ \f3\-nv\f1 ] \f3\-a\f1
\f3arp \f1[ \f3\-nv\f1 ] \f3\-c\f1
\f3arp \-d\f1 \f2hostname\f1
\f3arp \-s\f1 \f2hostname ether_addr\f1 [ \f3temp\f1 ] [ \f3pub\f1 ] [ \f3proxy-only\f1 ]
\f3arp \-f\f1 \f2filename\f1
.fi
.SH DESCRIPTION
The
.I arp
program displays and modifies the Internet-to-Ethernet address translation
tables used by the address resolution protocol
.RI ( arp (7P)).
.LP
With no flags, the program displays the current ARP entry for
.IR hostname .
The host can be specified by name or by number,
using Internet dot notation.
.LP
The
.I arp
flags are:
.TP 4 4
.B \-a
Display all of the current ARP entries by reading the table
from the routing socket.
.TP
.B \-c
Clear all of the current non-permanent ARP entries from the table.
.TP
.BI \-d " hostname"
A superuser can delete an entry for the host called
.IR hostname .
.TP
.BI \-s " hostname ether_addr"
Creates an ARP entry for the host called
.I hostname
with the Ethernet address
.IR ether_addr .
The Ethernet address is given as six hexadecimal bytes separated by colons.
The entry is permanent unless the word
.B temp
is given in the command.
If the word
.B pub
is given, the entry is published, that is, this system will
act as an ARP server
responding to requests for
.I hostname
even though the host address is not its own.
If
.B proxy\-only
is given, the entry is published, but it will not be used by this system
for packets send to
.IR hostname ,
which can be useful when
.I hostname
is reached by other means such as a PPP link.
.TP
.BI \-f " filename"
Causes the file
.I filename
to be read and multiple entries to be set in the ARP tables.
Entries in the file should be of the form:
.IP
.RS
  \f2hostname ether_addr\f1 [ \f3temp\f1 ] [ \f3pub\f1 ] [ \f3proxy-only\f1 ]
.RE
.IP
with argument meanings as given above.
.TP
.B \-n
Causes mapping of IP addresses to hostnames to be suppressed.
.TP
.B \-v
Causes additional information to be displayed, such as the interface
associated with entries and the age of the arp entries. Only a
superuser may use this flag.
.SH EXAMPLES
Command lines are followed by the output.
.PP
A completed successful entry:
.Ex
# \f4arp moose\f1
moose (192.26.72.5) at 8:0:69:2:24:3e
.Ee
A completed successful entry that is marked \f3permanent\f1 and
\f3published\f1:
.Ex
# \f4arp rainbow\f1
rainbow (192.26.72.3) at 8:0:69:2:4:94 permanent published
.Ee
An incomplete entry:
.Ex
# \f4arp ender\f1
ender (192.26.72.246) at (incomplete)
.Ee
A nonexistent entry:
.Ex
# \f4arp foobar\f1
foobar (192.26.72.1) -- no entry
.Ee
.SH "SEE ALSO"
ifconfig(1M),
arp(7P),
inet(7F).
