calmsacibis995/irix-6517-src/eoe/man/man1m/attrinit.1m
.TH ATTRINIT 1M
.SH NAME
attrinit \- Set file attributes
.SH SYNOPSIS
\fBattrinit\fP
[\fB-\fP\fIoption\fP[\fB=\fP\fIvalue\fP]]... 
[\fB-\fP\fIattr\fP\fB=\fP\fIvalue\fP]... 
[\fIpath\fP]...
.SH DESCRIPTION
.I attrinit
verifies or modifies the attributes associated with files.
.SH OPTIONS
.TP
.B \-verify
If
.I value
is
.B installed
don't set the attributes,
just report any differences between the attributes specified
and those which are set for each of the specified
.IR path s.
Ignore
.IR path s
which do not exist.
A
.I value
of
.B all
differs only in that
.IR path s
which do not exist are reported.
If
.I value
is
.B also
the attributes are set after they are checked.

If this option is not specified the attributes are set.
.TP
.B \-script
A script file named by
.I value
is read for additional directives.
Each line of the script file must have the form

.nf
	\fB-\fP\fIattr\fP\fB=\fP\fIvalue\fP... \fIpath\fP
.fi

where valid 
.I attr
and 
.IR value s
are described below.
Any
.I attr
.IR value s
which are specified on the command line override those in the script.
.TP
.B \-verbose
Keep a running count of the fraction of the operation which has completed.
.SH "VERIFIABLE ATTRIBUTES"
These attributes may always be specified,
but are only used for verification.
They are never changed by
.IR attrinit .
.TP
.B \-mode
.I value
specifies the file permission bits to look for.
.TP
.B \-user
.I value
specifies the user name or numeric user id of the file's owner.
.TP
.B \-group
.I value
specifies the group name or numeric group id of the file's owning group.
.TP
.B \-type
Permitted
.IR value s
are
.B directory
.RB "(also " d )
.B tree
.RB "(also " t )
.B file
.RB "(also " f )
.B symlink
.RB "(also " l " or " link )
.B fifo
.RB "(also " p " or " pipe )
.B chardev
.RB "(also " c " or " char )
.B blockdev
.RB "(also " b " , " blk
.RB "or " block )
and
.B socket
.RB "(also " s )
.PP
A special case is the
.I value
.BR tree .
If this is used the attribute and
.I value
specified are applied to the tree rooted at
.IR path .
.SH "MODIFIABLE ATTRIBUTES"
These attributes may be specified for modification or verification.
.TP
.B \-mac
Set the mandatory access control (
.SM MAC
) label to the specified
.IR value .
.TP
.B \-cap
Set the capabilities of the file to those listed in
.IR value .
.TP
.B -acl
Set the access control list of the file to the specified
.IR value .
.TP
.B -acldefault
Set the default access control list of a directory to the specified
.IR value .
.SH "NOTES"
In most cases,
.IR chacl (1),
.IR chcap (1),
or
.IR chlabel (1)
should be used in preference to
.IR attrinit .
.SH "SEE ALSO"
.IR chacl (1)
.IR chcap (1)
.IR chlabel (1)
.br
.IR "IRIX Advanced Site and Server Administration Guide" .
