calmsacibis995/irix-6517-src/eoe/man/man1m/audit.1m
.TH audit 1M
.SH NAME
audit \- system audit trail startup and shutdown script
.SH SYNOPSIS
.nf
\f3/etc/init.d/audit\f1 [ \f3start\f1 | \f3stop\f1 ]
.fi
.SH DESCRIPTION
The
.I audit
shell script is called during system startup from
.I /etc/rc2
to start the system audit trail daemon,
.IR satd (1M),
and enable auditing of predefined audit events (using
.IR sat_select (1M)).
The script is called during system shutdown from
.I /etc/rc0
to kill the daemon gracefully and disable auditing.
.P
Note that, as installed, auditing is off by default and must be enabled
as described in configuration flags, below.
In addition, once auditing has
been enabled via
.IR chkconfig (1M),
the system should be rebooted to enable auditing from system startup.
At a
minimum, \f3/etc/init.d/audit start\f1 must be executed by root before any
auditing actually takes place.
.P
When called with the
.B start
argument, the
.I audit
script does the following (provided that auditing has been enabled):
.PP
.PD 0
.IP \(bu 2
Looks for any "emergency files" (see
.IR satd (1M))
and issues a warning if it finds any.
.IP \(bu 2
Ensures that \f2satd\f1 and \f2sat_select\f1 are executable.
.IP \(bu 2
Starts the audit daemon, \f2satd\f1.
.IP \(bu 2
Enables auditing of predefined audit events.
.PD
.P
When called with the
.B stop
argument, the
.I audit
script gracefully terminates the
.I sat
daemon and disables auditing of all
events.
.SH "CONFIGURATION FLAGS"
The audit subsystem is enabled if its configuration flag in the
\f2/etc/config\f1 directory is in the \f3on\f1 state.
The configuration flag
file for auditing is \f2/etc/config/audit\f1.
If a flag file is missing, the flag is considered off.
Use the
.IR chkconfig (1M)
command to turn a flag \f3on\f1 or \f3off\f1.
For example,
.Ex
\f4chkconfig audit on\f1
.Ee
enables auditing.
When invoked without arguments,
.I chkconfig
prints the state of all known flags.
.P
There is a special flag, \f3verbose\f1.
The \f3verbose\f1 flag controls the printing of the names of daemons as they
are started.
.SH "OPTIONS FILES"
Site-dependent options for
.I satd
and
.I sat_select
belong in options files in
.IR /etc/config .
The option file for \f2satd\f1 is \f2satd.options\f1, and the option file
for \f2sat_select\f1 is \f2sat_select.options\f1.
These files contain
options that their respective commands will be run with to override the
defaults.
.P
To add filters to the \f2satd\f1 command line invoked by the
.I audit
shell script, place the filter command lines into \f2/etc/config\f1
in files with
names that begin with \f3satd.filter\f1.
If any of these files are found, the
output of
.I satd
is piped to them in the order that they are
found using \f2ls\f1.
For more information, see
.IR "audit_files" "(5)."
See the document
.I "IRIX Admin: Backup, Security, and Accounting"
and \f2satd\f1(1M) for details on valid options.
.P
Note that if audit filters are used, it may be necessary for the
.I audit
script to pause for several seconds to allow \f2satd\f1 to completely
initialize the audit system before any events can be enabled.
The default delay in this case is 2 seconds.
To override this delay, for example in the case where a particular audit
filter takes some additional time to start up, place the delay time (in
seconds) in the file \f2/etc/config/satd.delay\f1.
.SH FILES
.ta \w'/etc/rc0.d/K40auditXXX'u
.nf
/etc/init.d/audit
/etc/rc0.d/K40audit	linked to \f2/etc/init.d/audit\f1
/etc/rc2.d/S30audit	linked to \f2/etc/init.d/audit\f1
/etc/config	configuration flags and options files
.fi
.SH "SEE ALSO"
rc0(1M),
rc2(1M),
sat_echo(1M),
sat_interpret(1M),
sat_reduce(1M),
sat_select(1M),
sat_summarize(1M),
satconfig(1M),
satd(1M),
audit_files(5).
.PP
\f2IRIX Admin: Backup, Security, and Accounting\f1.
