calmsacibis995/irix-6517-src/eoe/man/man1m/autopush.1m
.\" Copyright 1989 AT&T
.TH autopush 1M
.SH NAME
autopush \- configure lists of automatically pushed STREAMS modules
.SH SYNOPSIS
.nf
\f3autopush \-f\f1 file
\f3autopush \-r \-M\f1 major \f3\-m\f1 minor
\f3autopush \-g \-M\f1 major \f3\-m\f1 minor
.fi
.SH DESCRIPTION
\f2autopush\f1 allows you to configure the list of modules to be automatically
pushed onto the stream when a device is opened.
It can also be used
to remove a previous setting or get information on a setting.
.P
The following options apply to \f2autopush\f1:
.TP 10
\f3\-f\f1 \f2file\f1
This option sets up the \f2autopush\f1 configuration for each driver according
to the information stored in the specified file.
An \f2autopush\f1 file consists of lines of at least four fields each,
where the fields are
separated by a space as shown below:
.IP
.RS
	\f2maj  min  last_min  mod1 mod2 ... modn\f1
.RE
.IP
The first three fields are integers that specify
the major device number, minor device number, and last
minor device number.
The fields following represent the names of modules.
If \f2min\f1 is \-1, then all minor devices of a major
driver specified by \f2maj\f1 are configured and the value for
\f2last_min\f1 is ignored.
If \f2last_min\f1 is 0,
then only a single minor device is configured.
To configure a range of minor devices for a particular major,
\f2min\f1 must be less than \f2last_min\f1.
.IP
The last fields of a line in the \f2autopush\f1 file
represent the list of module names where each is separated
by a space.
The maximum number of modules that can be automatically
pushed on a stream is defined to be eight.
The modules are pushed in the order they are specified.
Comment lines start with a # sign.
.TP
\f3\-r\f1
Remove the previous configuration setting of the particular
\f2major\f1 and \f2minor\f1 device number specified with the \f3\-M\f1 and \f3\-m\f1
options respectively.
If the values of \f2major\f1 and \f2minor\f1 correspond to a
setting of a range of minor devices where \f2minor\fP matches the first minor
device number in the range,
the configuration would be removed for the entire range.
.TP
\f3\-g\f1
Get the current configuration setting of a particular
\f2major\f1 and \f2minor\f1 device number specified with the \f3\-M\f1 and \f3\-m\f1
options, respectively.
It also returns the starting minor device number
if the request corresponds to a setting of a range (as described with the
\f3\-f\f1 option).
.SH SEE ALSO
streamio(7).
