calmsacibis995/irix-6517-src/eoe/man/man1m/automount.1m
'\"macro stdmacro
.\" @(#)automount.8	1.3 89/04/26 4.0NFSSRC; from 1.11 88/03/07 SMI;
.TH AUTOMOUNT 1M
.SH NAME
automount \- automatically mount NFS filesystems
.SH SYNOPSIS
.B /usr/etc/automount
[
.B \-mnTv
] [
.BI \-D " name=value"
] [
.BI \-f " master-file"
]
.if t .ti +.5i
[
.BI \-p " priority"
]
.if t .ti +.5i
[
.BI \-M " mount-directory"
] [
.BI \-tl " duration"
]
[
.BI \-tm " interval"
]
.if t .ti +.5i
[
.BI \-tp " duration"
] [
.BI \-tw " interval"
]
.if t .ti +.5i
[
.I directory
.I mapname
.RI [ " \-mount-options " ]
] .\|.\|.
.SH DESCRIPTION
.IX "automount command" "" "\fLautomount\fP command"
.I Automount
is a daemon that automatically and transparently mounts
.SM NFS
filesystems as needed.  
Whenever a user on a client machine running
.I automount
invokes a command that needs to access a remote
file or directory,
the hierarchy to which that file or directory belongs is mounted
and remains mounted for as long as it is needed. 
When a certain amount of time has elapsed during which the hierarchy
is not accessed, it is automatically unmounted.  No mounting
of unaccessed remote filesystems is done at boot\(hytime, and the user 
doesn't need special privilege to mount a directory.
.LP
The
.I automount
daemon is started during system initialization from
the
.I /etc/init.d/network
script if the configuration flags ``nfs'' and ``automount'' are set ``on.''
Do the following commands as super-user to enable 
.IR automount :
.Ex
/etc/chkconfig nfs on
/etc/chkconfig automount on
.Ee
Rebooting will start 
.I automount 
with the options and arguments contained in the file
.IR /etc/config/automount.options .
The default version of this file lets you access exported directories
on another host with the filename prefix of
.Ex
/hosts/<\f2hostname\fP>/
.Ee
.if n .sp
For example, if host
.I springfield
exports
.IR /usr ,
then
.Ex
ls /hosts/springfield/usr
.Ee
will show the contents of that directory.
You may want to customize this file for your site.
.LP
Unlike 
.IR mount ,
.I automount 
does not consult the file
.I /etc/fstab
for a list of hierarchies to mount.  Rather, it consults a series of maps, which can be either direct or indirect.  The names of the maps can be passed to 
.I automount
from the command line (via the
.I /etc/config/automount.options 
file), or from another (\f2master\fP) map.
.LP
The master map lists (as if from the command line)
all other maps, applicable options, and mount points.
.LP
An indirect map
allows you to specify mappings for the subdirectories you wish to
mount under the
.I directory
indicated on the command line.  
In an indirect map, each
.I directory
field consists of the basename of a subdirectory to be mounted as needed.
.LP
A direct map contains mappings for any number of directories.
Each directory listed in the map is automatically mounted as needed.
The direct map as a whole is not associated with any single directory.
.LP
.I automount
appears to be an
.SM NFS
server to the kernel.
.I automount
uses the map contained in the
.I mapname
argument to 
locate an appropriate
.SM NFS
file server, exported filesystem, and mount options.
It then mounts the filesystem in a temporary location, and creates a symbolic
link to the temporary location.
If the filesystem is not accessed within an appropriate interval (five minutes
by default), the daemon unmounts the filesystem and removes the symbolic link.
If the indicated
directory has not already been created, the daemon creates it, and then
removes it upon exiting.
.LP
By default,
.I automount
mounts everything under the directory
.IR /tmp_mnt .
For instance, if a user wants to mount a remote directory
.I src
under
.IR /usr/src ,
the actual mount point will be
.IR /tmp_mnt/usr/src ,
and
.I /usr/src
will be a symbolic link to that location.
.LP
As with any other kind of mount,
a mount effected through the automounter on a non-empty
mount point will hide the original contents of the mount
point for as long as the mount is in effect.
.LP
Since the name-to-location binding is dynamic, updates to an
.I automount
map are transparent to the user.
This obviates the need to ``pre-mount'' shared file
systems for applications that have ``hard-coded'' references to files.
Nor is there a need to maintain records of which hosts
must be mounted for what applications.
.LP
If the
.I directory
argument is a pathname, the
.I map
argument points to an 
.I indirect 
map.  An indirect map
contains a list of the subdirectories contained within the
indicated
.IR directory .
With an indirect map, it is these
subdirectories that are mounted automatically.
.LP
If the
.I directory
argument is
.RI ` /\- ',
.I automount
treats the
.I map
argument that follows as the name of a 
.I direct 
map.  In a direct map,
each entry associates the full pathname of a mount point with a
remote filesystem to mount.
.LP
A map can be a file or a 
network information service
(\s-1NIS\s0)
map; if a file, the
.I map
argument must be a full pathname.
.LP
The
.I \-mount-options
argument, when supplied,
consists of the leading dash
and a comma-separated list of options to
.IR mount (1M),
as described in
.IR fstab (4).
If these options are supplied,
they become the default mount options for all entries
in the map.
Mount options provided within a map entry
override these defaults.
.SH OPTIONS
.TP
.BI \-D " var=value"
Assign
.I value
to the indicated automount (environment) variable.
.TP
.BI \-f "  master-file"
Read a local file for initialization, before reading the
.I auto.master
.SM NIS 
map.
The information in
.I master-file
will take precedence.
.TP
.B \-m
Suppress initialization of
.IR directory \- mapname
pairs listed in the
.I auto.master
.SM NIS
database.
.TP
.BI \-M "  mount-directory"
Mount temporary filesystems in the named directory,
instead of
.IR /tmp_mnt .
.TP
.B \-n
Disable dynamic mounts.
With this option, references through the
.I automount
daemon only succeed when the target filesystem has been previously
mounted.  This can be used to prevent
.SM NFS
servers from cross-mounting each other.
.TP
.B \-T
Trace.
Expand each
.SM NFS
call and display it on standard error.
.TP
.BI \-p "  priority"
Set the (non-degrading) priority of the automount process.
The default is NDPNORMAX (40).
.TP
.BI \-tl "  duration"
Specify a
.IR duration ,
in seconds, that a filesystem is to remain mounted
when not in use.
The default is 300 seconds (5 minutes).
.TP
.BI \-tm "  interval"
Specify an
.IR interval ,
in seconds, between attempts
to mount a filesystem.
The default is 30 seconds.
.TP
.BI \-tp "  duration"
Specify the
.IR duration ,
in seconds, that the results of a probe
of a server's availability will remain cached.
The default is 5 seconds.
.TP
.BI \-tw "  interval"
Specify an
.IR interval ,
in seconds, between attempts to unmount
filesystems that have exceeded their cached times.
The default is 60 seconds.
.TP
.B \-v
Verbose.
Log status and/or warning messages through 
.IR syslog (3B) 
or to the console.
.SH "ENVIRONMENT"
Environment variables can be used within an automount map.
For instance, if $HOME appeared within a map,
.I automount
would expand it to its current value for the HOME variable.
Environment variables are expanded only for the
automounter's environment \(em not for the environment of a
user using the automounter's services.
.LP
If a variable reference needs to be protected from affixed characters, you can
surround the variable name with curly braces.
.SH "USAGE"
.SS "Map Entry Format"
A simple map entry (mapping) takes the form:
.IP
.I directory
[
.BI \- mount-options
]
.I location\ .\|.\|.
.LP
where
.I directory
is the full pathname of the directory to mount when used in a direct
map, or the basename of a subdirectory in an indirect map.
.I mount-options
is a comma-separated list of options to
.IR mount (1M), 
as described in
.IR fstab (4),
and
.I location
specifies a remote filesystem from which the directory may be mounted.
In the simple case,
.I location
takes the form:
.IP
.I hostname\|:\|pathname
.LP
.SS "\f2Replicated Filesystems\fP"
Multiple
.I location
fields can be specified for replicated read-only filesystems,
in which case
.I automount
sends multiple mount requests;
.I automount
mounts the filesystem from the first host that replies
to the mount request.
This request is first made to the local net or subnet.
If there is no response, any connected server may respond.
Since
.I automount
does not monitor the status of the server while the filesystem
is mounted, it will not use another location in the list
if the currently mounted server crashes.
This support for replicated filesystems is available only at mount time.
Once unmounted, another location may be used for subsequent mounts of the
filesystem.
.LP
If each
.I location
in the list shares the same
.I pathname
then a single
.I location
may be used with a comma-separated list of hostnames:
.IP
.I hostname1,\|hostname2\|:\|pathname
.SS "\f2Sharing Mounts\fP"
If
.I location
is specified in the form:
.IP
.I hostname\|:\|pathname\|:\|subdir
.LP
.I hostname
is the name of the server from which to mount the
filesystem,
.I pathname
is the pathname of the directory to
mount, and
.IR subdir ,
when supplied, is the name of a subdirectory to which
the symbolic link is made.
This can be used to prevent
duplicate mounts when multiple directories in the same
remote filesystem may be accessed.
With an indirect map for
.I /home
such as:
.Ex
bart		springfield:/home/simpsons:bart
maggie		springfield:/home/simpsons:maggie
.Ee
and a user attempting to access a file in 
.IR /home/bart ,
.I automount
mounts
.IR springfield\|:\|/home/simpsons ,
but creates a symbolic link called
.I /home/bart
to the
.I bart
subdirectory in the
temporarily-mounted filesystem.
If a user immediately tries
to access a file in
.IR /home/maggie ,
.I automount
needs only to create a symbolic link that points to the
.I maggie
subdirectory;
.I /home/simpsons
is already mounted.
.LP
With the following map:
.Ex
bart 		springfield:/home/simpsons/bart
maggie		springfield:/home/simpsons/maggie
.Ee
.LP
.I automount
would have to mount the filesystem twice.
.SS "\f2Comments and Quoting\fP"
A mapping can be continued across input lines by escaping the
.SM NEWLINE
with a backslash.
Comments begin with a # and end at
the subsequent 
.SM NEWLINE\s0.
.LP
Characters that have special significance to the automount
map parser may be protected either with double quotes (") or
by escaping with a backslash (\e).
Pathnames with embedded
whitespace, colons (\|:\|) or dollars ($) should be protected.
.SS "\f2Directory Pattern Matching"
The `&' character is expanded to the value of the
.I directory
field for the entry in which it occurs.
In this case:
.IP
bart	springfield:/home/simpsons:&
.LP
the & expands to
.IR bart .
The `*' character, when supplied as the
.I directory
field, is recognized as the catch-all entry.
Such an entry
will be used if any previous entry has not successfully matched
the key being searched for.
For instance, if the following entry
appeared in the indirect map for
.IR /home :
.Ex
*    &:/home/&
.Ee
this would allow automatic mounts in
.I /home
of any remote filesystem whose location could be specified as:
.IP
.I hostname\|:\|/home/hostname
.SS "\f2Multiple Mounts\fP"
A multiple mount entry takes the form:
.IP
.I directory
[ /[
.I subdirectory 
[
.BI \- mount-options
]
.I location\ .\|.\|.
] .\|.\|.
.LP
The initial / preceding the
.I "subdirectory"
is required; the optional
.I subdirectory
is taken as a pathname relative to the 
.IR directory .
If
.I subdirectory
is omitted in the first occurrence, the /
refers to the directory itself.
.LP
Given the direct map entry:
.Ex
/tools \e
   /         \-ro  dill:/tools          mint:/tools \e
   /1.0      \-ro  mint:/tools/1.0      dill:/tools/1.0 \e
   /1.0/man  \-ro  dill:/tools/1.0/man  mint:/tools/1.0/man
.Ee
.I automount
would automatically mount
.IR /tools ,
.I /tools/1.0
and
.IR /tools/1.0/man ,
as needed, from either
.I dill
or
.IR mint ,
whichever host responded first.
If the mounts are hierarchically
related, mounts closer to the root must appear before submounts.
All the mounts of a multiple mount entry will
occur together and will be unmounted together.
This is important if the filesystems reference each other with relative
symbolic links.
Multiple mount entries can be used both in direct maps and in indirect maps.
.SS "Included Maps"
The contents of another map can be included within a map
with an entry of the form:
.IP
.I +mapname
.LP
.I mapname
can either be a filename, or the name of an
.SM NIS 
map, or one of the
special maps described below.
If the directory being searched for is not
located in an included map, the search continues with the next entry.
.SS "Special Maps"
There are two special maps currently available:
.IR \-hosts 
and
.IR \-null .
The
.I \-hosts
map uses the 
.SM NIS
.I hosts.byname
map to locate a remote host when the hostname is specified.
This map specifies mounts of all exported filesystems from any host.
For instance, if the following
.I automount
command is already in effect:
.IP
automount  /hosts  -hosts
.LP
then a reference to
.I /hosts/springfield/usr
would initiate an
automatic mount of all filesystems from
.I springfield
that
.I automount
can mount; references to a directory under
.I /hosts/springfield
will refer to the corresponding directory relative
to
.IR springfield 's
root.
.LP
The
.I \-null
map, when indicated on the command line, cancels
any subsequent map for the directory indicated.
It can be used to cancel a map given in
.I auto.master
or for a mount
point specified as an entry in a direct map.
.SS "Configuration and the auto.master Map"
.I automount
normally consults the
.I auto.master
.SM NIS 
configuration
map for a list of initial automount maps, and sets up
automatic mounts for them in addition to those given on the
command line.
If there are duplications, the command-line arguments take precedence
over a local
.B \-f
master map and they both take precedence over an 
.SM NIS
.I auto.master
map.
This configuration database contains arguments to the
automount command, rather than mappings; unless
.B \-f
is in effect,
.I automount
does
.I not
look for an
.I auto.master
file on the local host.
.LP
Maps given on the command line, or those given in a local
.I auto.master
file specified with
.B \-f
override those in the
.SM NIS
.I auto.master
map.  For instance, given the command:
.Ex
automount -f /etc/auto.master /home -null /- /etc/auto.direct
.Ee
and a file named
.I /etc/auto.master
that contains:
.Ex
/homes  auto.home
.Ee
.I automount
would mount home directories under
.I /homes
instead of
.IR /home ,
in addition to the various directories specified in the
.I /etc/auto.direct
file.
.SH "FILES"
.TP
/tmp_mnt
directory under which filesystems are
dynamically mounted
.TP
/etc/config/automount.options
site-dependent options and arguments
.SH "SEE ALSO"
mount(1M), network(1M), chkconfig(1M), fstab(4), exports(4), schedctl(2)
.SH "NOTES"
.LP
The 
.I \-hosts 
map mounts all of the exported filesystems, for which the client
has access, from a server. Use of the
.I nohide
export option on the server (see exports(4)) may be used to 
minimize the number of mounts performed by clients. Automount
will not request a separate mount for a
.I nohide
filesystem, if the client has access via the parent filesystem.
If frequent access to just a single filesystem is
required, it is more efficient to access the filesystem with
a map entry that is tailored to mount just the filesystem of
interest.
.LP
When it receives signal number 1, SIGHUP,
.I automount
rereads the
.I /etc/mtab
file to update its internal record of
currently-mounted filesystems.
If a filesystem mounted with
.I automount
is unmounted with the
.IR umount (1M)
command,
.I automount
should be forced to reread the file by using the command
.IP
/etc/killall -HUP automount
.LP
An
.IR ls (1)
listing of the entries in the directory for an
indirect map shows only the symbolic links for currently
mounted filesystems.
This restriction is intended to avoid
unnecessary mounts as a side effect of programs that read
the directory and
.IR stat (2)
each of the names.
.LP
Mount points for a single automounter must not be hierarchically
related.
.I automount
will not allow an automount mount
point to be created within an automounted filesystem.
.LP
The recommended way to terminate
automount services is to send a SIGTERM signal to the daemon:
.Ex
/etc/killall \-TERM automount
.Ee
This allows the automounter to catch
the signal and unmount not only its daemon but also any
mounts in
.IR /tmp_mnt .
Mounts in
.I /tmp_mnt
that are busy will not be unmounted.
.I automount
must not be terminated with the SIGKILL signal.
Without an opportunity to unmount itself, the
automount mount points will appear to the kernel to belong
to a non-responding
.SM NFS
server.
.LP
Since each direct map entry results in a separate mount for
the mount daemon, such maps should be kept short.
Although both direct and indirect maps can be modified at any time,
entries added to a direct map will have no effect until the automounter
is restarted.
.LP
Automount mount points are mounted with type
.IR ignore ;
they do not appear in the output of either
.IR mount (1M)
or
.IR df (1).
Automatically-mounted filesystems, on the other hand, are mounted with type
.I nfs
and are reported along with other NFS-mounted filesystems.
.SH "BUGS"
.LP
Shell filename expansion does not apply to objects not currently
mounted.
.LP
The 
.I bg 
mount option is not recognized by the automounter.
.LP
Since
.I automount
is single-threaded, any request that is delayed by a slow
or non-responding
.SM NFS
server will delay all subsequent
automatic mount requests until it completes.
.LP
Programs that read
.I /etc/mtab
and then touch files that reside under
automatic mount points will introduce further
entries to the file.
