calmsacibis995/irix-6517-src/eoe/man/man1m/autofsd.1m
.\" @(#)autofsd.1m 1.16 92/07/23 SMI; from SVr4
'\"macro stdmacro
.\" Copyright 1989 AT&T
.nr X
.TH autofsd 1M "14 Mar 1994"
.SH NAME
autofsd \- autoFS mount/unmount daemon
.SH SYNOPSIS
.nf
\f3autofsd\f1 [ \f3\-vT\f1 ] [ \f3\-p\f1\f2 priority\f1 ] [ \c
\f3\-tp\f1\f2 duration\f1 ] [ \f3\-D\f1\f2 name=value\f1 ] 
        [\f3\-m\f1\f2 maxthreads\f1 ]  [\f3\-E\f1\f2 user\f1 ]
.fi
.SH DESCRIPTION
\f2autofsd\f1
is an
RPC
server that answers filesystem mount and unmount requests
from the
.B AutoFS
filesystem.
It uses local files or name service maps to locate filesystems
to be mounted.
These maps are described with the
.BR autofs (1M)
command.
.LP
The
.I autofsd
daemon is started during system initialization from the
.I /etc/init.d/network
script if the configuration flags
.B nfs
and
.B autofs
are set
.BR on .
Type the following commands as superuser
to enable
.BR AutoFS :
.Ex
\f4/etc/chkconfig nfs on
/etc/chkconfig autofs on\f1
.Ee
Rebooting invokes the
.I autofs
command and start the
.I autofsd
daemon with the options contained in the file
.IR /etc/config/autofs.options .
The
.I autofs
command passes mount point configuration information found
in the file
.I /etc/auto_master
to
.IR autofsd .
Do not kill
.I autofsd
to change the
.B AutoFS
configuration.
Run the
.I autofs
command to cause changes in the configuration maps to take affect.
.SH OPTIONS
.TP 16
\f3\-v\f1
Verbose.
Log status messages to the console.
.TP
\f3\-T\f1
Trace.
Expand each
RPC
call and display it on the standard output.
.TP
.BI \-p " priority"
Set the
.I priority
of the daemon process.  The daemon will run at the priority specified,
with a scheduling policy of 
.I SCHED_TS.
The default priority is 30.
.TP
.BI \-tp " duration"
Specify the
.IR duration ,
in seconds, that the results of a probe
of a server's availability will remain cached.
The default is 5 seconds.
.TP
\f3\-D\f2 name\f3=\f2value\f1
Assign
.I value
to the indicated \f3AutoFS\f1 map substitution variable.
These assignments cannot be used to substitute variables
in the master map, \f2auto_master\f1.
.TP
\f3\-m\f2 maxthreads\f1
Set the maximum number of threads that
.I autofsd
will create to handle autofs mount or unmount requests.
.I autofsd 
will create the threads only when needed. At this time the user cannot specify
a number greater than 16 for 
.I maxthreads.
The default is to run autofsd multi-threaded with the maximum, 16 threads. Setting this option to the value 1 will cause autofsd to run as a single threaded process.
.TP
\f3\-E\f2 user\f1
.I autofsd
will first do a setuid to the specified 
.I user
before executing any autofs maps. This is done for security reasons, to allow the system administrator to specify that autofsd should execute autofs maps, if any, as a user who does not have any superuser privileges.
.SH FILES
.PD 0
.TP 29
\f4/etc/auto_master\f1
master map for \f3AutoFS\f1
.TP
\f4/etc/config/autofs.options\f1
options and arguments for the
.I autofs
command and the
.I autofsd
daemon
.PD
.SH SEE ALSO
autofs(1M),
chkconfig(1M),
mount(1M),
sched_setscheduler(2).
.SH CAVEATS
For security reasons, the user should be extremely wary using the 
.I -E
option. It's use is deprecated. Support for executable autofs maps may go away in the future.
