calmsacibis995/irix-6517-src/eoe/man/man1m/autoconfig.1m
.TH autoconfig 1M
.SH NAME
autoconfig \- configure kernel
.SH SYNOPSIS
.nf
\f3/etc/autoconfig\f1 [\f3\-vnf\f1] [\f3\-p\f1 toolroot] [\f3\-d\f1 /var/sysgen]
	[\f3\-o\f1 lbootopts] [\f3start\f1|\f3stop\f1]
.fi
.SH DESCRIPTION
The
.I autoconfig
command is used invoke \f2lboot\fP and other commands to generate a
UNIX kernel.
The
.I autoconfig
command is also a startup script in \f2/etc/init.d\fP.
.PP
The options are as:
.TP 8
.B \-v
Requests verbose output from \f2lboot\fP and other
commands.
.TP
.B \-f
Generates a new kernel even if it appears that no
hardware or software changes have been made.
Use of
.B \-f
will clear any options set
in the \f2/var/config/autoconfig.options\fP file.
.TP
.BI \-p " toolroot"
Specifies the directory tree containing the compiler
and other tools needed to generate the kernel.
.TP
.BI \-d " /var/sysgen"
Specifies the directory tree containing the system configuration
modules and binaries.
.TP
.B \-n
Performs a dry run of \f2lboot\f1 and reports if a new kernel
would be created.  If
.B \-f
is also given, it overrides this option.
.TP
.B start
Used by \f2rc2\fP when the system is starting.
.TP
.B stop
Used by \f2rc0\fP when the system is stopping.
.PP
The
.I autoconfig
command also uses the \f2/var/config/autoconfig.options\fP file to tell
\f2lboot\f1 to configure a new kernel automatically or to prompt
for permission before configuring a new kernel.
The
\f2/var/config/autoconfig.options\fP file contains a \f3\-T\fP by
default, which indicates to \f2lboot\f1 to configure the kernel
automatically if necessary.
This option can be changed to a
\f3\-t\fP to force \f2lboot\f1 to prompt for permission before configuring
a new kernel.
.SH ENVIRONMENT VARIABLES
In addition to the environment variables used by
.IR lboot ,
.I autoconfig
itself uses some environment variables.
If you have these variables
set for some other purpose, you may need to unset them before running
.IR autoconfig .
.PP
NOTE:  This means that they should not be set in the global shell startup
files in \f2/etc\f1.
.IP UNIX 12
The file to check to see if it is out of date (defaults to
.IR /unix )
and also what the basename of the newly built kernel will be, if
necessary.
.IP SYSGEN 12
Passed as the base directory for the kernel files (see also
WORKDIR
below) and as the base directory name for the arguments below,
if they are not set in the environment.
.IP BOOTAREA 12
Passed as the
.B \-b
argument to
.IR lboot .
.IP SYSTEM 12
Passed as the
.B \-s
argument to
.IR lboot .
.IP MASTERD 12
Passed as the
.B \-m
argument to
.IR lboot .
.IP STUNEFILE 12
Passed as the
.B \-c
argument to
.IR lboot .
.IP MTUNEDIR 12
Passed as the
.B \-n
argument to
.IR lboot .
.IP WORKDIR 12
Passed as the
.B \-w
argument to
.IR lboot .
.SH SEE ALSO
lboot(1M),
rc0(1M),
rc2(1M),
setsym(1M).
