calmsacibis995/irix-6517-src/eoe/man/man1m/captoinfo.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} captoinfo 1M "Terminal Information Utilities" "\&"
.TH \*(x}
.SH NAME
\f4captoinfo\f1 \- convert a termcap description into a terminfo description
.SH SYNOPSIS
.nf
\f4captoinfo\f1 [\f4-v\f1 ...] [\f4-V\f1] [\f4-1\f1] [\f4-w\f1 \f2width\fP] \c
\f2file\f1 ...
.fi
.SH DESCRIPTION
\f4captoinfo\f1
looks in
.I file
for \f4termcap\f1 descriptions.
For each one found,
an equivalent \f4terminfo\f1
description is written to standard output, along with any comments found.
A description that is expressed as relative to another description (as
specified in the
\f4termcap tc = field\f1)
is reduced to the minimum superset before being output.
.P
If no
.I file
is given, the environment variable
TERMCAP
is used for the filename or entry.
If
TERMCAP
is a full pathname to a file,
only the terminal whose name is specified in the environment variable
TERM
is extracted from that file.
If the environment variable
TERMCAP is not set,
then the file \f4/usr/share/lib/termcap\f1 is read.
.TP 11
\f4-v\f1
Print out tracing information on standard error as the program runs.
Specifying additional \f4-v\f1 options
causes more detailed information to be printed.
.TP
\f4-V\f1
Print out the version of the program in use on standard error and exit.
.TP
\f4-1\f1
Print out fields one to a line.
Otherwise, the fields are printed several to a line to a maximum width
of 60 characters.
.TP
\f4-w\f1 \f2width\f1
Change the output to \f2width\f1 characters.
.SH FILES
\f4\&/usr/share/lib/terminfo/?/*\f1   Compiled terminal description database.
.SH NOTES
\f4captoinfo\f1 should be used to convert \f4termcap\f1
entries to \f4terminfo\f1 entries because the
\f4termcap\f1 database (from earlier versions of UNIX System V)
may not be supplied in future releases.
.SH SEE ALSO
infocmp(1M),
curses(3X),
terminfo(4).
