calmsacibis995/irix-6517-src/eoe/man/man1m/cfsstat.1m
'\"macro stdmacro
.if n .pH man1.cfsstat @(#)cfsstat	30.3 of 8/24/95
.TH CFSSTAT 1M
.SH NAME
cfsstat \- display Network File System statistics
.SH SYNOPSIS
.B /usr/etc/cfsstat
[
.B \-Cfbz
] [ 
.I interval
]
.SH DESCRIPTION
.IX  "cfsstat command"  ""  "\fLcfsstat\fP \(em display filesystem statistics"
.IX  "CacheFS statistics"  "display"  ""  "display \(em \fLcfsstat\fP"
.IX  "statistics of CacheFS"  display  ""  "display \(em \fLcfsstat\fP"
.I Cfsstat
displays statistical information about the
Cache File System (CacheFS).
It can also be used to reinitialize this information.
If no options are given the default is to print everything 
and reinitialize nothing.
The optional argument
.I interval
may be used to indicate the interval in seconds between display updates
in the "full-screen" mode described below.  The default value is 1.
.SH OPTIONS
.TP
.B \-C
Display using a "full-screen" form which is updated every
.I interval
seconds.
The values can be displayed as simple totals (\f2r\fP or "raw"),
changes during the previous interval (\f2d\fP or "delta"),
or changes since a fix moment (\f2z\fP or "zero").
.TP
.B \-f
Display statistics for the file header cache.
This cache is used to
hold in memory copies of cached file attributes read from the front file
system.  These statistics are provided primarily to assist in tuning the
size of the file header cache.
.TP
.B \-b
Display back file system operation statisics.
This option is ignored with the
.B \-f
option.
.TP
.B \-z
Zero (reinitialize) statistics.
Can be combined with any of the above options to
zero particular sets of statistics after printing them.
.SH GENERAL STATISTICS
The meanings of the primary display fields are given below.  These
fields appear in both the full-screen and default display forms.
.TP
.B inval
the number of cache invalidations
.TP
.B nocache
the number of files marked as not being cached
.TP
.B reclaim
the number of CacheFS vnodes reclaimed by the system
.TP
.B dnlchit
the number of lookups which hit in the Directory Name Lookup Cache (DNLC)
.TP
.B shorthit
the number of lookups which do not hit in the DNLC but for which an
existing cnode is found (i.e., the file system dependent data has not
been reclaimed)
.TP
.B shortmiss
the number of lookups for which there is a front file but for which
there is no cnode data
.TP
.B lookuphit
the number of lookups which find a front file (cache hits)
.TP
.B lookupstale
the number of lookups which find a front file with a stale back file ID
.TP
.B lookupmiss
the number of lookups for which no front file was found (cache misses)
.TP
.B nocachelook
the number of lookups for uncached files or directories
.TP
.B lookups
total number of lookups
.TP
.B readhit
the number of reads which hit in the cache
.TP
.B readmiss
the number of reads which miss (i.e., the read goes to the back filesystem)
.TP
.B reads
total number of reads
.TP
.B nocachereads
the number of reads on uncached files
.TP
.B readerrors
the number of read errors (either reading from the front or back file)
.TP
.B writes
total number of writes
.TP
.B nocachewrite
the number of writes to uncached files
.TP
.B writeerrors
the number of write errors (either writing to the front or back file)
.TP
.B asyncreqs
total number of requests to the CacheFS asynchronous operation daemon(s)
.TP
.B replacements
total number of file replacements (files removed from the cache to make
room for new files)
.TP
.B rdirhit
the number of readdir requests which hit in the cache
.TP
.B rdirmiss
the number of readdir requests which miss
.TP
.B readdirs
total number of readdir requests
.TP
.B short rdlink
the number of reads of symbolic links which get data from the file header
and so do not require a further read of the front file
.TP
.B long rdlink
the number of reads of symbolic links which must get data from the front
file
.TP
.B vnops
total number of vnode operations
.TP
.B vfsops
total number of vfs operations
.TP
.B back vnops
total number of vnode operations to the back file system
.TP
.B back vfsops
total number of vfs operations to the back file system
.TP
.B getbackvp
the total number of times a back vnode must be gotten using the
file ID
.TP
.B objchecks
total number of cache consistency checks
.TP
.B back checks
the number of cache consistency checks which go to the back file system
.TP
.B objinits
total number of cache object initializations
.TP
.B objmods
total number of cache object modifications (this occurs for writes)
.TP
.B objinvals
total number of cache object invalidations
.TP
.B newcnodes
number of new cnodes created
.TP
.B makecnode
number of calls to makecachefsnode (the function which looks up and creates
cnodes)
.TP
.B nocnode
the number of times makecachefsnode returns ENOENT when given a back
file ID and no front and back vnodes
.TP
.B cnodehit
the number of times a cnode was found (not created) by makecachefsnode
.TP
.B cnrestart
the number of times cnode lookup has been restarted due to a cnode bein
destroyed or failure to get the vnode
.TP
.B cnlookagain
the number of times cnode lookup has been restarted after creating a
new cnode
.TP
.B cntoss
the number of cnodes freed due to duplication
.TP
.B reclaim race
the number of collisions between cnode lookup and reclaiming
.TP
.B destroy race
the number of collisions between cnode lookup and destruction
.SH BACK FILE SYSTEM OPERATIONS
In addition to the primary fields, the full-screen form offers some
additional fields.  These fields provide a summary of back file
system operations.  These appear in all of the display modes (delta,
zero, or raw) but are most useful in "delta" mode.
.P
The statistics are not printed if the
.B \-f
option is supplied.
.TP
.B lku
the number of lookups
.TP
.B fsy
the number of file syncs
.TP
.B rdl
the number of readlinks
.TP
.B acc
the number of access checks
.TP
.B get
the number of getattrs
.TP
.B set
the number of setattrs
.TP
.B clo
the number of closes
.TP
.B opn
the number of opens
.TP
.B rdd
the number readdirs
.TP
.B cre
the number of creates
.TP
.B rem
the number of removes
.TP
.B lnk
the number of links
.TP
.B ren
the number of renames
.TP
.B mkd
the number of mkdirs
.TP
.B rmd
the number of rmdirs
.TP
.B sym
the number of symlinks
.TP
.B frl
the number of file locks
.TP
.B rdv
the number of reads
.TP
.B wrv
the number of writes
.SH FILE HEADER CACHE STATISTICS
.I Cfsstat
can also be instructed to display statistics for the file header cache.
The fields displayed are described below.
.TP
.B hits
the percentage of file header reads that hit in the cache
.TP
.B misses
the percentage of file header reads that miss in the cache
.TP
.B reads
total number of file header reads
.TP
.B writes
total number of file header writes
.TP
.B cache enter
number of file headers entered into the cache
.TP
.B cache remove
number of file headers removed from the cache
.TP
.B LRU enter
number of file headers placed onto the LRU list
.TP
.B LRU remove
number of file headers removed from the LRU list
.TP
.B purges
number of file headers purged from the cache
.TP
.B releases
number of file header releases
.SH FILES
.ta \w'/dev/kmem\0\0\0'u
/unix 	system namelist
.br
/dev/kmem	kernel memory
.SH SEE ALSO
cachefs(4),
osview(1),
nfsstat(1M),
sar(1),
systune(1M)
