calmsacibis995/irix-6517-src/eoe/man/man1m/chkutent.1m
'\"macro stdmacro
.nr X
.if \nX=0 .ds x} chkutent 1M "Essential Utilities" "\&"
.if \nX=1 .ds x} chkutent 1M "Essential Utilities"
.if \nX=2 .ds x} chkutent 1M "" "\&"
.if \nX=3 .ds x} chkutent "" "" "\&"
.TH \*(x}
.SH NAME
\f4chkutent\f1 \- check and repair utmp entries
.SH SYNOPSIS
\f4chkutent [-f utmpx-file][-w wtmpx-file]\f1
.SH DESCRIPTION
\f4chkutent\fP
opens and reads \f4/var/adm/utmpx\fP and makes 2 checks for consistency;
whether there are any entries that have duplicate 'id' fields, and whether
there are any entries that are stale.
Stale entries are found by looking at all entries that have
\f4ut_type\fP equal to \f4USER_PROCESS\fP and checking to see if the
process (specified by \f4ut_pid\fP) is still alive.
If it isn't, it sets the \f4ut_type\fP to \f4DEAD_PROCESS\fP and sets
the process's
termination time to the current time.
It then makes sure that the files \f4utmp\fP, \f4wtmp\fP, and \f4wtmpx\fP
are all consistent.
.PP
Keeping the utmp file(s) consistent and up to date is important for accounting,
\f4last\fP(1), and other system administration functions.
However, these files are updated by a variety of programs, some of which
are public domain programs.
If these programs are terminated without giving them the opportunity
to clean up their \f4utmp\fP entry, the files can easily get out of sync.
The exact algorithm for updating the utmp files is also notoriously
non-standard, so many third party or public domain applications may
not quite do it correctly for IRIX.
For these reasons, \f4chkutent\fP is run by \f4cron\fP(1M) every
night and if any erroneous entries are found, they are repaired and a
report sent to the system administrator.
There are cases of corruption that \f4chkutent\fP cannot correct - in this
case a message is printed with the word \f2CORRUPT\fP, and \f4chkutent\fP
terminates without any further actions.
.PP
If an administrator gets messages from \f4chkutent\fP frequently they
may wish to start an investigation into which program(s) on the machine
are generating them.
Infrequent messages can safely be ignored.
.PP
The following is a list of messages and probable causes:
.TP 10
\f2chkutent:ERROR:write failed on:xx\fP
The write to the \f2utmpx\fP file to correct a duplicate entry failed.
This is likely due to an out of space condition on the file system that
contains the \f2utmpx\fP file.
.TP
\f2chkutent:utmpx file xx CORRUPT with dup entry and neither entry `DEAD'\fP
There is a duplicate entry (two entries with the same `id') but \f4chkutent\fP
didn't know how to fix it since both entries claim to represent still
existing sessions.
Action to correct this problem should be taken promptly.
Having everyone log out and then running \f4chkutent\fP will usually work.
Otherwise, the \f4utmp\fP and \f4utmpx\fP files should be made zero length
and the system rebooted.
.TP
\f2chkutent:ERROR:Could not update utmpx file\fP
The call to \f4pututxline\fP(3) failed.
This is usually due to either an out of space problem or that the
\f2utmp\fP file corresponding to the \f2utmpx\fP file doesn't exist.
It is important that both files exist - it is sufficient to simply
\f4touch\fP(1) the missing file.
.TP
\f2utmpx fix - xx xx xx xx - see chkutent(1M)\fP
This is `normal' message printed each time \f4chkutent\fP finds an entry
that represents a stale session.
If no other error message are printed, it can be assumed that this entry
was fixed.
.TP
\f2utmpx dup - xx xx xx xx - see chkutent(1M)\fP
This message printed each time \f4chkutent\fP finds a duplicate
entry.
This represents a serious corruption of the \f2utmpx\fP file.
If this kind of corruption is frequently seen it is imperative that the
offending program(s) be tracked down and fixed.
If no other error message are printed, it can be assumed that this entry
was fixed.
.PP
The \f4chkutent\fP program may be run at any time by an administrator.
\f4chkutent\fP does take an optional \f4\-f\f2 utmpx-file\f1 argument to let
it operate on any \f2utmpx\fP-like file.
Similarly, the optional \f4\-w\f2 wtmpx-file\f1 argument instructs
\f4chkutent\fP to operate on the given file when updating the \f2wtmp\fP
records.
If the \f4\-f\fP option is given without the \f4\-w\fP option, no \f2wtmp\fP
processing is done.
.SH FILES
\f4/var/adm/utmp\fP
.br
\f4/var/adm/utmpx\fP
.br
\f4/var/adm/wtmp\fP
.br
\f4/var/adm/wtmpx\fP
.br
.SH SEE ALSO
\f4getutx\fP(3C)
.Ee
