calmsacibis995/irix-6517-src/eoe/man/man1m/cl_init.1m
.TH cl_init 1M
.SH NAME
cl_init \- init program for diskless software installation
.SH SYNOPSIS
.nf
\f3/etc/cl_init\f1
.fi
.SH DESCRIPTION
.I cl_init
is the
.IR init (1M)
program in diskless share tree.
When client workstation installs its
software using the PROM menu,
the workstation uses
the share tree as the root and
process 1 runs
.I cl_init
instead of the regular
.IR /etc/init .
.P
.I cl_init
prompts the user with the following questions:
.Ex
Do you want to use server \f2XXX\f7 for software installation (y/n) ?
.Ee
.I XXX
is the default server name used in the
.B tapedevice
or
.B bootfile
PROM variables.
When
doing installation,
this default is the name of the server that contains the share tree.
If the client tree will be installed on a different server,
user should answer
.B n
here.
.Ex
Enter server name :
.Ee
Enter the correct server name for client tree.
.I cl_init
checks the server name with the
.I /etc/hosts
file in the share tree.
If the server name is not in this host file,
.I cl_init
re-prompts the user for appropriate action.
.Ex
Do you want to install client \f2YYY\f1\f7 on server \f2XXX\f1\f7 (y/n) ?
.Ee
.I XXX
is the server name, and
.I YYY
is the hostname that is set in the PROM
variable
.B hostname
or translated from
.B netaddr
using
.IR bootparamd (1M)
service.
.Ex
Enter password for autoinst :
.Ee
If the
.I autoinst
login entry at server machine requires a password,
the user should type in the password at this prompt.
Once the password is accepted, the
.IR inst (1M)
menu appears on the screen.
.Ex
Ready to exit (y/n) ?
.Ee
.I cl_init
repeats the installation procedure again if the answer
is
.BR n .
Otherwise, it sets the PROM variables
.B netaddr
and
.B bootfile
and reboots itself.
.P
.I cl_init
always logs onto the server using default login name
.BR autoinst .
The user can set environment variable
.B dllogin
in the PROM to change the login name.
For example,
typing
.Ex
\f4setenv dllogin root\f1
.Ee
at PROM manual mode causes the diskless workstation to log onto the server using
.BR root .
.P
When using default login
.B autoinst,
all messages before the
.IR inst (1M)
menu are filtered.
If there is a need for examining the login messages, such as
for debugging purposes, it is possible to
disable this feature by typing two or more
escape characters before entering
the password.
.SH CAVEAT
.I cl_init
is to be used only by the diskless client installation package.
If
.I cl_init
is invoked on a shell command line, the shell hangs.
If the hung shell receives an
.B INTR
signal, the system is shut down silently.
.SH SEE ALSO
bootparamd(1M),
init(1M),
inst(1M).
