calmsacibis995/irix-6517-src/eoe/man/man1m/clri.1m
.nr X
.if \nX=0 .ds x} clri 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
clri \- clear EFS inode
.SH SYNOPSIS
.nf
\f3clri\f1 special i-number ...
.fi
.SH DESCRIPTION
.I clri
writes nulls on the inode table entry for
.IR i-number .
This effectively eliminates
the inode at that address.
.I special
is the device name on which
an EFS filesystem has been defined.
After
.I clri
is executed,
any blocks
in the affected file
shows up as ``not accounted for'' when
.IR fsck (1M)
is run against the
filesystem.
The inode can be allocated to a new file.
.PP
Read and write permission is required on the specified
.I special
device.
.PP
This command is used
to remove a file that
appears in no
directory,
that is, to get rid of a file that cannot be removed
with the \f2rm\f1 command.
.SH SEE ALSO
findblk(1M),
fsck(1M),
fsdb(1M),
ncheck(1M),
rm(1),
efs(4).
.SH WARNINGS
If the file is open for writing,
.I clri
does not work.
The filesystem containing the file should not be mounted.
.PP
If
.I clri
is used on
the inode number of a file that
does appear in a directory, it is imperative to remove
the entry in the directory at once,
since the inode can
be allocated to a new file.
The old directory entry, if not removed, continues to
point to the same file.
This sounds like a link but does not work like one.
Removing the old entry destroys the new file.
.PP
There is no equivalent command for XFS filesystems.
If 
.I clri
is applied to an XFS filesystem, the messages:
.br
	bad superblock magic number in /dev/rdsk/dks\f3xxx\fP
.br
	clri: /dev/dsk/dks\f3xxx\fP is not an extent filesystem
.br
will appear.
