calmsacibis995/irix-6517-src/eoe/man/man1m/configmon.1m
.nr X
.if \nX=0 .ds x} configmon 1M "IRIX System Utilities" "\&"
.TH \*(x}
.SH NAME
configmon \- \&IRIX system configuration utility
.SH SYNOPSIS
.nf
\f3configmon\f1 [\f3\-g\f1] [\f3\-u\f1] [\f3\-i\f1] [\f3\-h\f1] [\f3\-s\f1] 
.fi
.SH DESCRIPTION
The 
.I
configmon utility is responsible for tracking changes in system
hardware and software configuration. It performs its duties
automatically during system start-up. 
.I
configmon gathers information
about hardware and software components installed in the system and
compares the results to configuration data stored in the Embedded
Support Partner (ESP) database. If it finds that any hardware or
software components have been installed or deinstalled, it updates the
database and logs information about the configuration change.
.P
There are circumstances, where it may be desirable to run the

.I
configmon utility interactively. Following is a brief description of
the the command line options that might be used. Note that all
output from the 
.I
configmon utility will be sent to the standard output.
.TP 13
.B \-g 
Causes all 
.I
configmon tables to be created regardless of system type.
Only used when configuring a system as a System Group Manager (SGM). 
.TP
.B \-u
Causes 
.I configmon
to gather system configuration information from the running system and
compare it to the information that is currently contained in the ESP
database. If differences are found, the database will be updated accordingly.
.TP
.B \-i
Displays current system information (system name, IP address, etc.) 
on stdout.
.TP
.B \-h
Displays current system hardware configuration information 
on stdout.
.TP
.B \-s
Displays current system software configuration information 
on stdout.
.SH NOTES
The 
.I
configmon utility will track system software configuration changes
for all systems running IRIX 6.5.5 or later. It will track system
hardware configuration changes only for Challenge, Onyx, O2, Octane,
Origin200, Origin2000, and Onyx2 systems.
