calmsacibis995/irix-6517-src/eoe/man/man1m/configmail.1m
.TH configmail 1M local "Silicon Graphics, Inc."
.SH NAME
configmail \- sendmail autoconfiguration script
.SH SYNOPSIS
.nf
\f3/usr/etc/configmail\f1 mode [ parameter ]
.fi
.SH DESCRIPTION
.I configmail
is the historic interface to modifying parameters used in the sendmail.cf 
.I sendmail.cf
file shipped with IRIX to obtain information about the local mail environment.
.I configmail
can also be executed by the user to display and/or modify that
information.
.PP
.I configmail
is no longer the primary way to configure the 
.I sendmail.cf
file.   The correct way is to modify the 
.I sendmail.mc
file.
.I configmail
can be used to generate a new
.I sendmail.cf
from the information and settings in the
.I sendmail.mc 
file.
.PP
.I configmail
can be run in one of several
.IR mode s.
The
.IR mode s
.BR mc2cf ,
.BR help ,
.BR get ,
.BR set ,
.BR unset ,
and
.B percpu 
take an additional
.I parameter
argument.
The remaining
.IR mode s,
.B list ,
.B mc2cf, 
.B m4 ,
and
.BR setup ,
take no additional
.I parameter
argument.
.PP
The
.I parameter
argument can be one of:
.TP 15
.B forwarder
The name of the forwarder host.
.TP 15
.B rootdomain
The common domain suffix of all domains to be considered local.
.TP 15
.B directdomains
The names of all domains for which this host is a relay or exchanger host.
.TP 15
.B localdomain
The name of the local domain.
.TP 15
.B loglevel
The sendmail Loglevel.  Defaults to 1.
.TP 15
.B pathalias
The location of the UUCP path-alias database.
.TP 15
.B relayname
The hostname or alias used for all relay hosts.
.TP 15
.B recsubdomains
Recognized subdomains.  This parameter only has effect when the
Gauntlet for IRIX product is installed on the system.
.TP 15
.B deadhosts
The list of all hosts in the local domain that no longer exist or are
otherwise permanently unreachable.
Note that the contents of this
parameter are actually determined by an external file,
.IR /etc/sendmail.killed ,
and that the
.B deadhosts
parameter can only be displayed and not modified via
.IR configmail .
.TP 15
.B numcpus
The number of cpus available for sendmail to use.  This value is determined
at run time, and can not be set.
.PP
The 
.B percpu
.IR mode
takes an argument of a positive intger, and will return that value times
the value 
.B numcpus .
.PP
The default value of each of the above parameters is
calculated at runtime by
.IR configmail .
The values thus calculated, when read by the autoconfiguring
.I sendmail.cf
file, should result in a working
.I sendmail
configuration.
It may, however, be
necessary to override the calculated default values of one or more
parameters in some situations.
For this purpose, the
.B set
and
.B setup
modes have been provided.
.PP
The
.B set
mode provides an interactive interface through which the user can override
the calculated default value or change the current override setting of the
given
.IR parameter .
If the user chooses to set a value for the parameter
that is different from the calculated default, the new value is
stored in a file with the name
.IR /etc/sendmail.params .
If the value of this parameter
is changed as a result of the
user's selection,
.I configmail
prompts the user to restart the
.I sendmail
daemon so that the new value of the parameter is honored.
.PP
The
.B setup
mode takes no
.I parameter
argument.
It recursively calls
.I configmail
in the
.B set
mode to obtain settings for the most commonly overridden parameters.
It
prompts the user to verify and possibly change the settings of any other
parameters that are currently overridden.
.PP
The
.B unset
mode is used to remove any override setting and restore the calculated default
value of the given
.IR parameter .
As with the
.B set
and
.B setup
modes, if the value of the parameter is changed from its previous value,
.I configmail
prompts the user to restart the
.I sendmail
daemon so that the new value of the parameter is honored.
.PP
The
.B help
mode takes a
.I parameter
argument and prints the available help text associated with that
parameter.
.PP
The
.B list
mode takes no arguments.
It displays the current settings of the various
configurable parameters plus the values of some internal variables.
This
mode is intended to be used as a debugging aid.
.PP
The
.B m4
mode is similar to the 
.B list
mode, but it's output is intended to be parsed by the 
.B m4
macro processor.
.PP
The 
.B mc2cf
mode is used to generate a 
.I sendmail.cf
file, applying the features and settings defined in the 
.I sendmail.mc
file.
.PP
The
.B get
mode is used to obtain the current value of the given
.IR parameter .
.SH WARNING
When called from
.IR sendmail.cf ,
.I configmail
must be called in the
.B get
mode only.
The other modes are intended to be used by a human operator.
.SH DIAGNOSTICS
If an error is detected while running in the
.BR help ,
.BR list ,
.BR m4 ,
or
.B setup
mode,
.I configmail
places an appropriate error message on standard output and exit
with a nonzero value.
.PP
If an error is detected while running in the
.B get
mode,
.I configmail
places a null string on standard output and exit with a value of 0.
The
.B get
mode never exits with a nonzero value.
.PP
If an error is detected while running in the
.B set
or
.B unset
mode,
.I configmail
places a diagnostic message on standard output and exit with a
value of 1.
If
.I configmail
successfully modifies the requested parameter, it exits with a
value of 2.
If no error is detected, and the parameter is unchanged,
.I configmail
exits with a value of 0.
.SH FILES
.TP 26
.B /etc/sendmail.cf
the
.I sendmail
configuration file
.TP 26
.B /etc/sendmail.killed
contains the names of the permanently unreachable hosts in the local
domain
.TP 26
.B /etc/sendmail.params
created and maintained by
.IR configmail ,
contains any override settings for the various configuration
parameters
.SH "SEE ALSO"
canonhost(1M),
m4(1),
sendmail(1M).
.PP
\f2IRIX Admin: Networking and Mail\f1
