calmsacibis995/irix-6517-src/eoe/man/man1m/cron.1m
.nr X
.if \nX=0 .ds x} cron 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
cron \- clock daemon
.SH SYNOPSIS
.nf
\f3cron\f1 [ \f3\-j\f1 \f2jobs\f1 ] [ \f3nofork\f1 ]
.fi
.SH DESCRIPTION
.I cron
executes commands at specified dates and times.
Regularly scheduled commands can be specified according
to instructions found in
.I crontab
files in the directory
.IR /var/spool/cron/crontabs .
Users can submit their own
.I crontab
file via the
.IR crontab (1)
command.
Commands that are to be executed only once can be
submitted using the
.IR at (1)
command.
.PP
The following options are supported:
.TP 10
.BI \-j " jobs"
Specify the maximum number of jobs (MAXRUN) that
.I cron
can simultaneously run.
The default value is 25.
The
maximum allowed value is 250.
.TP
.B nofork
If this option is supplied,
.I cron
runs in the foreground.
.PP
.I cron
examines
.I crontab
files and
.I at
command files only during process
initialization and when a file changes via
.I crontab
or
.IR at .
This reduces the overhead of checking for new or
changed files at regularly scheduled intervals.
.PP
Since
.I cron
never exits, it should be executed only once.
This is done routinely
through \f2/etc/rc2.d/S75cron\f1 at system boot time.
\f2/etc/cron.d/FIFO\f1 is used as a lock file to prevent
the execution of more than one
.I cron
and is also used by the
.I crontab
command for notification of changes to the
.I crontab
files.
.P
If MAXRUN jobs are running and another is scheduled,
.I cron
does not run the new job.
A message is logged via
.IR syslog (3C).
.P
.I cron
attempts to handle changes to the system date correctly, either
forward or backward.
There may be some delay for jobs scheduled
during the interval on large forward-time changes.
.SH FILES
.PD 0
.TP 27
/etc/cron.d
main cron directory
.TP
/etc/cron.d/FIFO
used as a lock file against multiple copies running and also for
notification of new or changed
.I crontab
files
.TP
/var/cron/log
accounting information
.TP
/var/spool/cron
spool area
.TP
/etc/config/cron.options
site-dependent options
.PD
.SH SIGNALS
A
SIGHUP
signal can be sent to
.I cron
to cause it to reexamine all the
.I crontab
and configuration files.
A message is logged for this event.
The
SIGTERM
signal should be used to shut
.I cron
down cleanly.
.SH "SEE ALSO"
at(1),
crontab(1),
sh(1).
.SH DIAGNOSTICS
A history of all actions taken by
.I cron
is recorded in
.IR /var/cron/log .
