calmsacibis995/irix-6517-src/eoe/man/man1m/dhcpdb.1m
.TH dhcpdb 1M "18 May 1998"
.SH NAME
dhcpdb \- DHCP database manager
'\" LINKS: 
.SH SYNOPSIS
.nf
\f3/usr/sbin/dhcpdb\f1 [ \f3\-a\f1 [ \f3\-r\f1] ] | [ \f3\-d\f1 ] | [ \f3\-u\f1 ] | [ \f3\-p\f1 ] [ \f3\-X\f1 ] 
[ \f3\-C Client_id \f1 ] [ \f3\-M Mac_address\f1 ] [ \f3 \-I IP_address\f1 ] 
[ \f3 \-H hostname\f1 ] [ \f3\-T lease_in_seconds \f1 ] [ \f3\-f dhcp_database\f1 ]
.TP
\f3/usr/sbin/dhcpdb\f1 [ \f3 \-D\f1 ] | [ \f3\-L\f1 ] [ \f3\-X\f1 ] [ \f3\-f dhcp_database\f1 ]
.fi
.SH DESCRIPTION
.I dhcpdb
is a database manager for the NDBM database used by the
DHCP server to store address leases. It provides a command line
interface to add, delete, update, or print the DHCP database. 
.PP
The tool can be used either in entry mode to manipulate
individual entries or in file mode. In file mode the entire contents
of the database can be dumped to a file or loaded from a file. 

.SH COMMAND LINE OPTIONS
.PP
In the entry mode options can be used to
add (replace), delete, update a lease, or print an entry using a
key. The key can be either a client identifier, MAC (interface)
address, IP address, or a hostname. 
.TP
\f3-a\f1 
Add an entry. The \f3-r\f1 option allows an existing entry to be 
replaced or a new entry is added if the specified entry does not
exist. The client identifier, Mac address, IP address, and hostname must be
specified. If a record is being replaced these values must be
specified to be the same as existing values in the database. The
lease time should also be specified.
.TP
\f3-d\f1
Delete an entry. A single key in the form of client identifier, Mac
address, IP address, or hostname should be specified.
.TP
\f3-u\f1
Update lease time. Specify a key and the lease time using the
\f3-T\f1 option.
.TP
\f3-p\f1
Print an entry for the given key. This can also be used to print
leases expiring in more or less than a specified number of
seconds.
.TP
\f3-X\f1
Specifies that the client identifier is a colon separated string
of bytes in hexadecimal in the specified input or in the
output. If this option is not specified the client identifier is
assumed to be a string.
.TP
\f3-C\f1 \f2Cid\f1
Specifies the client identifier key.
.TP
\f3-M\f1 \f2Mac_address\f1
Specifies the Mac (physical interface) address as a string of
bytes in hexadecimal, separated by colons.
.TP
\f3-H\f1 \f2Hostname\f1
This is the hostname (usually fully qualified) as it appears in the database. 
.TP
\f3-I\f1 \f2IP address\f1
Specifies the IP address as a dotted decimal address string.
.TP
\f3-T\f1 \f2 lease_seconds|absolute time\f1
Specifies the lease time in seconds. With the \f3-p\f1 option the 
lease time can be specified to print the leases that expire in
less than or greater than a given number of seconds from the
current time. For example \f2-p -T \<100\f1, and \f2-p -T
\>100\f1 prints leases expiring in less than 100 seconds and
more than or equal to 100 seconds respectively. The format \f2-T
"sec[0-61] min[0-59] hour[0-23] mday[1-31] mon[0-11]
years_since_1900"\f1 can also be used to specify the time when 
adding or updating an entry. For example -T "10 12 20 18 4 98"
means the lease should expire on May 18 21:12:10 1998. The format
is the same as is used with the \f3mktime\f1(3C) call. Alternately 
\f2-T seconds\f1 can be used to specify the time in seconds from
00:00:00 UTC, January 1, 1970 (see \f2time\f1(2)). For example in 
the particular case discussed above the option would be specified 
as \f2-T 895551130\f1.

With the \f2-a\f1 and \f2-u\f1 options the lease can be specified as
\f3INF\f1 for an infinite lease or as \f3STATIC\f1 for a static (infinite) 
lease. For example, to make an existing lease for address 10.0.10.1 static 
the command is \f2dhcpdb -I 10.0.10.1 -u -T STATIC\f1.
.TP
\f3-f\f1
Specifies an alternate database to use. The default is
\f2/var/dhcp/etherToIP\f1. 
.SS File mode usage
.PP
In the file mode the command can be used to dump the entire
database to a file that can be subsequently loaded into the
database. 
.TP
\f3-D\f1
Dumps the database to the standard output. The file consists of
fields separated by tabs and includes the client identifier, Mac
address, IP address, hostname, and the lease time.
.TP
\f3-L\f1
Loads the database from the standard input.

.SH NOTES
The \f2/etc/ethers\f1 and \f2/etc/hosts\f1 are not updated when
the DHCP \f2/var/dhcp/etherToIP\f1 database is updated.
.SH FILES
.nf
/var/dhcp/etherToIP.lock
/var/dhcp/etherToIP.pag
/var/dhcp/etherToIP.dir
.fi

.SH "SEE ALSO"
dhcp_server(1M)
ProclaimServerMgr(1M),

