calmsacibis995/irix-6517-src/eoe/man/man1m/diskusg.1m
.\" Copyright 1991, 1992 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH diskusg 1M
.SH NAME
\f4diskusg\fP \- generate disk accounting data by user ID
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/diskusg\f1 [\f2options\fP] [\f2files\fP]
.fi
.SH DESCRIPTION
\f4diskusg\fP
generates intermediate disk accounting information
from data in \f2files\fP
or the standard input if omitted.
\f4diskusg\fP
outputs lines on the standard output (one per user)
in the following format:
.Ex
\f2uid login #blocks\fP
.Ee
where
.PP
.PD 0
.TP 10
\f2uid\fP
is the numeric user ID of the user
.TP
\f2login\fP
is the login name of the user
.TP
\f2#blocks\fP
is the total number of disk blocks
allocated to this user
.PD
.PP
\f4diskusg\fP
is normally used to read the inodes
of \f4efs\fP or \f4xfs\fP filesystems for disk accounting.
In this case, \f2files\fP
are the special filenames of these devices.
.PP
\f4diskusg\fP
recognizes these options:
.TP 13
\f4-s\fP
Combine all lines for a single user
into a single line.
(The input data is already in \f4diskusg\fP
output format.)
.TP
\f4-v\fP
Print (on standard error) a list
of all files charged to no one.
.TP
\f4-u \f2file\f1
Write (to \f2file\fP) records
of files that are charged to no one.
Records consist of the special filename,
the inode number, and the user ID.
.TP
\f4-i \f2fnmlist\f1
Ignore the data on those filesystems for which a
name is recorded in \f2fnmlist\fP.
(\f2fnmlist\fP
is a list of filesystem names separated
by commas or enclosed within quotes.)
\f4diskusg\fP
compares each name in this list with the filesystem
name stored in the volume ID.
(See \f4labelit\fP(1M).)
This option is inoperative for \f4xfs\fP filesystems,
because there's no way to set the filesystem name.
.PP
The environment variable
\f2ACCT_MAXUSERS\fP
is checked in order to allocate enough memory to handle the maximum number of distinct users that might need to be reported.
The environment variable
\f2ACCT_MAXIGN\fP
is checked in order to allocate enough memory to keep track of the maximum
number of filesystem names that will be ignored in the report.
.SH FILES
\f4/etc/passwd\fP   used for conversions of user IDs to login names
.SH USAGE
The output of the
\f4diskusg\fP
command
is normally the input to
\f4acctdisk\fP
(see
\f4acct\fP(1M)),
which generates total
accounting records that can be
merged with other accounting records.
\f4diskusg\fP is normally run in
\f4dodisk\fP.
(See \f4acctsh\fP(1M).)
.PP
\f4acctdusg\fP (see \f4acct\fP(1M))
can be used on all filesystem types
but is slower than \f4diskusg\fP.
.SH EXAMPLES
Generate daily disk accounting information
for the root filesystem on
\f4/dev/dsk/dks0d1s0\fP
(where root is an \f4efs\f1 or \f4xfs\f1 filesystem):
.Ex
\f4diskusg /dev/dsk/dks0d1s0 | acctdisk > disktacct\f1
.Ee
.SH REFERENCES
acct(1M),
acctsh(1M),
acct(4).
