calmsacibis995/irix-6517-src/eoe/man/man1m/diskpatch.1m
.TH diskpatch 1M
.SH NAME
diskpatch \- prevent stiction problems with some disk drives
.SH SYNOPSIS
.nf
\f3diskpatch\f1 [\f3\-v\f1] [\f3\-H\f1 \f2halt\f1 [\f3\-S\f1 \f2delay\f1] \c
[\f3\-F\f1]] [\f3\-W\f1]
.fi
.SH DESCRIPTION
.I diskpatch
is normally run from
.IR cron (1M)
twice a week and whenever the system is shutdown.
It uses the hardware inventory mechanism to find
all the disk drives on the system attached to the supported
SCSI controllers, (excluding the
.IR jag(7M)
controller) and determines the type of disk drive by sending the SCSI
.I inquiry
command, using the
.IR ds (7M)
driver.
.PP
If the drive is found to be one of the susceptible
drives, a special command is issued to the drive that causes it
to spin down (stop) for a brief period, and then start again.
This sequence prevents the stiction from occurring, in
most cases (stiction means that the magnetic heads have become
stuck to the surface of the drive media, usually preventing the
drive from starting and preventing the drive from being used).
.PP
The options are:
.TP 10
.B \-v
Verbose mode.
The inquiry info for each disk drive found is printed.
.TP 10
.BI \-H " halt"
Send a vendor specific command to the affected
disk drives that will usually prevent stiction from occurring.
.I halt
is the interval in seconds the drive will remain halted; the interval
should be 30 seconds.
Normally this command is ignored by the disk drive if it
has been running less than 48 hours since last turned off or
the command was last issued.
.TP 10
.B \-F
Forces the cleaning action specified by
.B \-H
regardless of time since last issued or hours powered on.
.TP 10
.BI \-S " delay"
Specify the delay in seconds between sets of drives, to avoid overloading
the drive's power supply.
An attempt is made to overlap drives to
reduce the overall runtime.
.TP 10
.B \-W
Warns if the firmware isn't new enough to support
this command, and the disk appears to be one of the susceptible
disk drives.
.SH NOTE
This command must be run as the superuser.
.SH SEE ALSO
cron(1M),
ds(7M).
