calmsacibis995/irix-6517-src/eoe/man/man1m/du.1m
.nr X
.if \nX=0 .ds x} du 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
\f4du\f1 \- summarize disk usage
.SH SYNOPSIS
.nf
\f4du\f1 [\f4\-arklmsxLR\f1] [\f2name\f1 ...]
.fi
.SH DESCRIPTION
The \f4du\fP command
reports the number of blocks contained in all files
and (recursively) directories within each directory and
file specified by the \f2name\fP arguments.
If no \f2name\fP arguments are given, the current directory is used.
.P
By default, the block counts reported are in terms of 512-byte
blocks, but this can be modified to 1024-byte blocks by specifying
the \f4\-k\f1 option (see below).
The block count includes only the actual data blocks used by
each file and directory, not indirect blocks or other filesystem
data structures required to represent the file.
\f4du\f1
keeps track of files that have more than one name (hard link) and
counts the blocks used by the file only the first time it finds a link
to the file.
.PP
The optional arguments are as follows:
.PP
.TP
\f4\-a\f1
Causes an output line to be generated for each file.
If neither \f4\-s\f1 nor \f4\-a\f1 is specified, an output line
is generated only for each directory.
.TP
\f4\-r\f1
Causes \f4du\fP to generate messages about directories that cannot
be read and files that cannot be opened. (This option is on by 
default.  The \f4\-R\f1 option can be used to suppress these messages.)
.TP
\f4\-k\f1
Causes \f4du\fP to express all block counts in terms of 1024-byte
blocks, instead of the default 512-byte blocks.
The internal accounting is still done in terms of 512-byte
blocks, because that is the actual filesystem allocation granularity.
The numbers are converted to 1024-byte blocks before being printed.
This means that the total block count shown for a directory
is less than the sum of the block counts of the contained files
and directories when more than one of the contained files is less
than 512 bytes in size.
.TP
\f4\-l\f1
Prevent \f4du\fP from descending into and computing disk usage for
directories and files that do not reside on local disk filesystems.
.TP
\f4\-m\f1
Prevents \f4du\fP from descending into and computing disk usage for
directories and files that do not reside on the same mount point
as the current root of the recursion.
.TP
\f4\-s\f1
Causes only the grand total (for each of the specified
\f2name\fP arguments) to be given.
If neither \f4\-s\f1 or \f4\-a\f1 is specified, an output line
is generated for each directory only.
.TP
\f4\-x\f1
Identical to the \f4\-m\fP option.
.TP
\f4\-L\f1
Causes \f4du\fP to follow symbolic links.
The default behavior is not to follow symbolic links, so that
\f4du\f1
normally reports the size of the symbolic link itself.
When
\f4\-L\f1
is specified,
\f4du\f1
reports the size of the target of the symbolic link.
If the symbolic link points to a directory when
\f4\-L\f1
is specified,
\f4du\f1
recursively descends the directory just as it does for normal directories.
.TP
\f4\-R\f1
Suppresses messages about directories that cannot be read and
files that cannot be opened.  
.SH FILES
.TP 12
\f4/usr/lib/locale/\f2locale\f4/LC_MESSAGES/uxcore\f1
language-specific message file (see LANG in \f4environ\f1(5))
.SH NOTES
If the \f4\-a\f1 option is not used, nondirectories
given as arguments are not listed.
.P
When using the
\f4\-l\f1 option,
nonlocal directories and files given as arguments are not listed.
