calmsacibis995/irix-6517-src/eoe/man/man1m/dvhtool.1m
.\" -----------------------------------------------------
.\" | Copyright MIPS Computer Systems, Inc.  All Rights |
.\" | Reserved. 	                                       |
.\" -----------------------------------------------------
.\" %Q% %M% %I%
.TH dvhtool 1M
.SH NAME
dvhtool \- modify and obtain disk volume header information
.SH SYNOPSIS
.nf
\f3dvhtool\f1 [\f3\-v\f1 [\f3creat\f1 \f2unix_file dvh_file\f1]
	[\f3add\f1 \f2unix_file dvh_file\f1] [\f3delete\f1 \c
\f2dvh_file\f1]
	[\f3get\f1 \f2dvh_file unix_file\f1] [\f3list\f1]] \c
[\f2header_filename\f1]
.fi
.SH DESCRIPTION
.I dvhtool
is used to copy files to and from the volume header of 
disks.
Formerly it had other functions also, but these
have long been deprecated and have been removed.
.PP
The disk volume header consists of two main parts:
the partition table,
and the volume directory.
The volume directory is used to locate files kept in the volume header
area of the disk for standalone use.
The partition table describes the logical device partitions.
.PP
You must be superuser to use
.IR dvhtool .
.PP
Invoked with no arguments (or just a volume header name, \f2header_filename\f1),
.I dvhtool
allows you to examine and modify the disk
volume header on the root drive interactively.
The
.B read
command prompts for the name of the device file for the volume header to be
worked on.
This can be
.I /dev/rvh
for the header of the root disk or the header name of another disk in the
.I /dev/rdsk
directory.
See
.IR vh (7M).
It then reads the volume header from the specified device.
.PP
The
.B write
command writes the possibly modified volume header to the device.
.PP
Invoked with arguments,
.I dvhtool
reads the volume header,
performs the specified operations,
and then writes the volume header.
If no
.I header_filename
is specified on the command line,
.I /dev/rvh
is used.
.PP
The following describes
.I dvhtool
command-line arguments.
.TP
.B \-v
Provides five options for modifying and listing the contents of
the volume directory
information in the disk volume header: \f3create\fP, \f3add\fP,
\f3delete\fP, \f3get\fP, and \f3list\fP.
.TP
.B creat
Allows creation of a volume directory entry with the name
.I dvh_file
and the contents of
.IR unix_file .
If an entry already exists with the name
.IR dvh_file ,
it is overwritten with the new contents.
.TP
.B add
Adds a volume directory entry with the name
.I dvh_file
and the contents of
.IR unix_file .
Unlike the
.B creat
option,
the
.B add
options do not overwrite an existing entry.
.TP
.B delete
Removes the entry named
.IR dvh_file ,
if it exists, from the volume directory.
.TP
.B get
Copies the requested file from the volume header to the filesystem.
.TP
.B list
Lists the current volume directory contents.
.SH SEE ALSO
fx(1M),
prtvtoc(1M),
vh(7M).
.SH NOTE
Several megabytes of disk space may be required in the \f2/tmp\f1
directory when creating
or adding files if the free space in the volume header is fragmented.
