calmsacibis995/irix-6517-src/eoe/man/man1m/edquota.1m
'\"macro stdmacro
.if n .pH man1.edquota @(#)edquota    1.1 of 8/1/90
.TH edquota 1M
.UC 4
.SH NAME
edquota \- edit user quotas
.SH SYNOPSIS
.B /usr/etc/edquota
[
.B \-n
]
.IR usernames .\|.\|.
.LP
.B /usr/etc/edquota
[
.B \-n
]
[
.B \-p
.I proto-user
]
.IR usernames .\|.\|.
.LP
.B /usr/etc/edquota
[
.B \-n
]
.B \-t
.LP
.B /usr/etc/edquota
[
.B \-n
]
[
.B \-f
.I filesystem
[
.B \-l
.I subopt=value ...
]
]
.LP
.B /usr/etc/edquota
[
.B \-n
]
[
.B \-a
[
.B \-l
.I subopt=value ...
]
]
.LP
.B /usr/etc/edquota
[
.B \-n
]
.B \-i
.I inputfile
.SH DESCRIPTION
.IR edquota
is a quota editor.  One or more users may be specified on the command
line.  When used without the 
.B \-f
and 
.B \-l
options, a temporary file is created with an
.SM ASCII
representation of the current disk quotas for each user and an editor
is then invoked on that file.  The quotas may then be modified, new
quotas added, etc.  Upon leaving the editor,
.IR edquota
reads the temporary file and reflects the changes in the quota system using the
.IR quotactl(2)
system call.
.LP
The editor invoked is
.IR vi (1)
unless the
.BI EDITOR
environment variable specifies otherwise.
If a non-default editor is used,
the editor must start itself in the foreground,
otherwise the editor will see an empty file instead of quota data.
In particular,
.IR jot (1G)
will not work as 
.BI EDITOR
without its
.B -f
option set.
.LP
Only the super-user may edit quotas. 
Only quotas for local filesystems may be edited.
In order for quotas to be established on an EFS filesystem, the root
directory of the filesystem must
contain a file, owned by root, called
.I quotas. 
XFS has no such restriction (see
.IR quotaon (1M)
and
.IR quotas (4)
for details). However, target XFS filesystems are required have quotas already
turned on before setting quota limits using 
.IR edquota.
.LP
All disk limits are in given kilobytes. All disk limits are rounded off
to the next multiple of filesystem block size (see 
.IR mkfs_xfs (1M)
).
.SH OPTIONS
.TP
.B \-n
Dry run. No actual modifications will be performed. The command will instead
display what may have happened. This is useful in making a large number of 
changes as with the 
.B \-i 
option.
.TP
.B \-p
Duplicate the quotas of the prototypical user
specified for each user specified.  This is the normal
mechanism used to initialize quotas for a small groups of users.
.TP
.B \-t
Edit the soft time limits for each file system.
If the time limits are zero, the default time limits in
.I <sys/quota.h>
are used.
Time units of 
\f3sec\f1(onds), 
\f3min\f1(utes), 
\f3hour\f1(s), 
\f3day\f1(s), 
\f3week\f1(s) and 
\f3month\f1(s) are understood.
Time limits are printed in the greatest possible time unit such that
the value is greater than or equal to one.
.TP
.B \-i
Read in the limits from the file
.I inputfile
that was generated by 
.IR repquota (1M). 
This option is very useful in recreating the limits of a
large number of users. Applies only to XFS filesystems.
.TP
.B \-f 
Used only in conjunction with the
.B \-l
option. This option is used to restrict the scope of the subsequent
.B \-l
options to a single filesystem.
.I filesystem
can be the block device or the name of the directory the XFS filesystem
is mounted on. It is possible to have multiple 
.B \-f
options with any number of 
.B \-l
options in between.
.TP
.B \-a
Used only in conjunction with the
.B \-l
option.
This option extends the scope of the subsequent
.B \-l 
options to all XFS filesystems that have quotas turned on. 
.TP
.B \-l
\f3uid=\f2userid\f1,\f3bsoft=\f2value\f1,\f3bhard=\f2value\f1,\f3isoft=\f2value\f1,\f3ihard=\f2value\f1
where the \f2value\f1s are the softlimits and hardlimits on disk blocks and
files. Disk block limits are always specified in kilobytes.
.TP 0
.I Example:
/usr/etc/edquota -f /myxfsfilesys -l uid=998,bhard=1500,bsoft=1000
.SH FILES
.PD 0
.TP 20
.B quotas
quota file at the EFS file system root
.TP
.B /etc/mtab
mounted file systems
.PD
.SH BUGS
Options
.B \-i, \-f, \-a, \-l
do not work on EFS filesystems.
.PD
.SH SEE ALSO
quota (1),
vi (1),
quotactl (2),
quotacheck (1M),
quotaon (1M),
repquota (1M),
jot (1G)
