calmsacibis995/irix-6517-src/eoe/man/man1m/eventmond.1m
.TH eventmond 1M
.SH NAME
eventmond - system event monitoring daemon
.SH SYNOPSIS
.nf
 eventmond\ [-a on|off] [-u timestamp_fname] 
 [-j tout_sec] [-e tout_hours]
 [-o eventlogfile] [-d] [-q] [-r] [-l]
 [-f maxfiles] [-b maxbuffers][-t tablename] 
 [-n dbname] [-w dblib_name] [-m maxreptcnt] 
 [-x on|off] [-i] [-v] [-c] [-h]

.fi
.SH DESCRIPTION
.P
\f3eventmond\f1
runs at system startup, collects system events from syslogd,
esplogger or any other application that interacts with 
EventmonAPI (see \f2EventmonAPI\f1(3X) for more details),  
and passes such system events directly to the 
SGI Embedded Support Partner (a.k.a ESP; see \f2esp\f1(5) for more details)
framework. In case 
SGI ESP Support Data Base 
server is not running or 
SGI ESP Event Manager 
is not running, eventmond will buffer events. Whenever rate of 
the incoming events is higher than ability of the system to
process such events, eventmond also buffers overhead of 
event messages. On condition that capacity of buffers is 
exhausted eventmond stores event messages in temporary files. 
Eventmond is called by 
during the system startup process by init  which runs \f2/etc/init.d/eventmonitor\f1
script which in turn is called by 
\f2/etc/init.d/sysetup\f1
script. It is not recommended to execute 
eventmond manually. Eventmond can be executed in two alternative 
modes - daemon mode and application mode. As an application
eventmond provides access and particular controls with respect 
to the instance of eventmon daemon currently residing in memory.
In order to run eventmon in the daemon mode user must have 
root privileges. Some flags of the application mode 
demand a root privileges to perform a
particular functionality.
Eventmond also records system uptime in 
.I timestamp_fname
every
.I tout_sec 
seconds.
This information is used to estimate uptime in case of a system
hang.
This functionality is enabled by command string option \f3-a\f1 on.
If command string key \f3-e\f1 has a non-zero value, eventmond will
send availmon status update report every 
.I tout_hours
hours.



.SH OPTIONS
.nf
All following flags are case insensitive.
.TP
.B \-a  on|off
This option is used for turning on/off ability of eventmond
to write a time stamps into the \f2timestamp_fname\f1 file.
The time stamp is used by SGI ESP availmon module to estimate
uptime in case of a system hang.

User must have a root privileges in order to be able to use
this option.  This option is valid in both - deamon and application 
mode.  In case eventmon daemon starts whithout this option the
"update of time stamp file" is "off" by default.
As an application eventmond, started with "-a" option,
has ability to turn on/off the "update of time stamp file"
in the existing instance of the eventmon daemon. 
This option effects \f3-u\f1, \f3-j\f1 and \f3-e\f1 options which
perform their functionality only in case "-a" option is
started with the "on" parameter.
.TP
.B \-u timestamp_fname
This option is used to set the "time stamp" file name which by
default is /var/adm/avail/.save/lasttick.  Option can be used 
only with the root priveleges and is valid only for the deamon mode.

The functionality of this key (as well as functionality of
\f3-e\f1 and \f3-j\f1 keys) depends on the \f3-a\f1 key and can be in
effect only upon condition of \f3-a on\f1 key executed.
.TP
.B \-j tout_sec
This option is used to set time out in seconds
between "time stamp" file updates (see options \f3-a\f1 and 
\f3-u\f1). This option is valid in both - deamon and application
mode. In case eventmon daemon starts whithout this option 
the "update of time stamp file time out" is 300 seconds by
default. As an application eventmond, started with \f3-j\f1 option,
has ability to change the time out in the existing
instance of the eventmon daemon. 

It should be mentioned that functionality of this key (as 
well as functionality of \f3-e\f1 and \f3-u\f1 keys) depends on the
\f3-a\f1 key and can be in effect only upon condition of \f3-a on\f1
key executed.
.TP
.B \-e tout_hours
This option is used to set time interval for invoking 
amdiag script. The time interval is measured in hours.
This option is valid in both - deamon and application mode.
In case eventmon daemon starts whithout this option 
the time interval is 1440 hours by default.
As an application eventmond, started with \f3-e\f1 option,
has ability to change the time interval in the existing
instance of the eventmon daemon.  

In case \f3-e\f1 key is used with "0" parameter the invoking 
of amdiag script is disabled.

It should be mentioned that functionality of this key (as 
well as functionality of \f3-j\f1 and \f3-u\f1 keys) depends on the
\f3-a\f1 key and can be in effect only upon condition of \f3-a on\f1
key executed.

.TP
.B \-o eventlogfile
This option is used for saving all incoming events to
the eventlogfile. Due to the specific daemon attributes
eventlogfile should be expected to appear in a root 
directory unless eventlogfile name is absolute.
One should exercise this option only with the root
privileges.	
	
.TP
.B \-d
Eventmond starts in "Debug" mode, does not release
controlling terminal and displays information about  
running process. In this particular case eventmon daemon
does not change current directory to root directory.
    
.TP
.B \-q 
Eventmond starts in application mode and sends a message to
exit to the currently running instance of eventmon daemon.  
After eventmon daemon gets a message it suppose to exit 
in a normal fashion. Eventmond application exits itself right
after sending a message to a daemon.

Keywords \f3-stop\f1 or \f3-kill\f1 also can be used to perform
functionality of \f3-q\f1 flag.
.TP
.B \-r 
Eventmond starts in application mode, sends "reload events filter
information" command to existing instance of the eventmon daemon
and exits.
.TP
.B \-l
Eventmond is designed to reduce number of the attempts to send
an event by the increasing time between attempts in case of the
failure of the system to accept such an event. This flag can be
used in case of a need to reset timeout to the initial value in
order to increase a number of attempts to send an event.
Eventmond with this option starts in application mode.
User should have root privileges to be able to execute this
option.
.TP
.B \-f 
Set maximum number of temporary files for saved messages 
(no more than: 100). Each file is used to store only one
event message.
.TP
.B \-b 
Set maximum number of memory buffers for saved messages 
(no more than: 200).
.TP
.B \-n 
This option requires a name of the database as an argument and
could be used to preserve integrity of ESP in case default
database name is changed. Eventmond default database name is
"ssdb".
.TP
.B \-t
This option requires a name of the table as an argument and
could be used to preserve integrity of ESP in case default
table name is changed. Eventmond default table name is
"event_type".
.TP
.B \-w
This option requires a name of the database support DSO module
as an argument and used in case such a name is changed.
Eventmond default DSO module name is "libssdbapi.so".
.TP
.B \-m 
Eventmond starts in a daemon mode and, in case System Event
Manager gives a recoverable error on the particular event
message, alter a number of attempts to send such an event
message. Default number of attempts is 200. User can use "0"
to specify an unlimited number of attempts.
.TP
.B \-x on (off)
Eventmond writes possible error messages into the SYSLOG file
and, by default, marks each message with the ESP tag "|$"
as an identifier. This option enables or disables such message
identifying in the SYSLOG file.
In this case eventmond starts in a daemon mode.
.TP
.B \-i 
Eventmond starts as an application, prints eventmon statistics and
exits. Keywords \f3-status\f1 or \f3-state\f1 also can be used to perform
functionality of \f3-i\f1 flag.
.TP
.B \-v 
Eventmond starts as an application, prints version information
and exits.
.TP
.B \-c 
Eventmond starts as an application, prints copyright information
and exits.
.TP
.B \-h 
Eventmond starts as an application, prints help information and exits.
.TP
.B \-g on (off)
Eventmond starts in a daemon mode, and in case the flag is "on"
eventmond turns off filtering of the events which came from the all 
hosts but the local one.
.TP
.B \-silence
Suppress all "info"/"warning"/"error" output (default: silence mode
is "off"). 

.SH DIAGNOSTICS
Upon successful completion value of 0 is returned. Otherwise the
following values are returned to indicate an error: 
.P
 1         invalid parameters or only "help" output
.P
 2         system error: fork() 
.P
 3         incorrect system parameter(s), can't start daemon
.P
 4         killed by some system signal
.P
 5         init data error
.P
 6         init thread error
.P
 7         can't _daemonize
.P
 8         already installed
.P
 9         can't make temp file name
.P
10         can't open socket
.P
11         can't bind socket
.P         
12         daemon is not installed
.P
13         can't start daemon with non root
.P
14         invalid CPU command
.P
15         invalid FPE command
.P
16         can't set socket option(s)


.SH FILES

/usr/etc/eventmond,
/etc/init.d/eventmonitor,
/etc/init.d/sysetup,
/etc/init.d/availmon

.SH SEE ALSO
esplogger(1), EventMonAPI(3X), availmon(5).








