calmsacibis995/irix-6517-src/eoe/man/man1m/exportfs.1m
.\" @(#)exportfs.8 1.5 88/03/03 D/NFS
.\" @(#)exportfs.8 1.13 88/03/02 SMI;
.TH exportfs 1M
.SH NAME
exportfs \- export and unexport directories to NFS clients
.SH SYNOPSIS
.nf
\f3/usr/etc/exportfs\f1 [ \f3\-aiuv\f1 ] [ \f3\-o\f1 \f2options\f1 ] [ \c
\f2directory\f1 ]
.fi
.SH DESCRIPTION
.I exportfs
makes a local directory (or file)
available for mounting over the network by
NFS
clients.
It is normally invoked at boot time by the
.I /etc/init.d/network
script, and uses information contained in the
.I /etc/exports
file to export a
.I directory
(which must be specified as a full pathname).
The superuser can run
.I exportfs
at any time to alter the list or characteristics of exported directories.
Directories that are currently exported  are listed in the file
.IR /etc/xtab .
.LP
With no options or arguments,
.I exportfs
prints out the list
of directories currently exported.
.SH OPTIONS
.TP
.B \-a
All.
Export all directories listed in
.IR /etc/exports ,
or if
.B \-u
is specified, unexport all of the currently exported directories.
.TP
.B \-v
Verbose.
Print each directory as it is exported or unexported.
.TP
.B \-u
Unexport the indicated directories.
.TP
.B \-i
Ignore the options in
.IR /etc/exports .
Normally,
.I exportfs
consults
.I /etc/exports
for the options associated with the exported directory.
.TP
\f3\-o\f1 \f2options\f1
Specify a comma-separated list of optional characteristics for
the directory being exported.
.I options
are described in
.IR exports (4).
.SH FILES
.PD 0
.TP 18
/etc/exports
static export information
.TP
/etc/xtab
current state of exported directories
.TP
/etc/netgroup
.PD
.SH SEE ALSO
exports(4),
netgroup(4),
showmount(1M).
.SH WARNINGS
You cannot export a directory that is either
a parent- or a sub-directory
of one that is currently exported and
within the same filesystem.
It would be illegal, for example, to export
both
\f2/usr\fP and
.I /usr/local
if both directories resided in the
same disk partition.
.PP
Extremely long export lists (hundreds of hosts or netgroups for a
single exported directory) may cause mount requests for that exported
directory to time out.
