calmsacibis995/irix-6517-src/eoe/man/man1m/fam.1m
.nr X
.if \nX=0 .ds x} fam 1M "Silicon Graphics" "\&"
.TH \*(x}
.SH NAME
fam \- file alteration monitor
.SH SYNOPSIS
.nf
\f3/usr/etc/fam\f1 [ \f3\-f\f1 | \f3\-v\f1 | \f3\-d\f1 ] [ \f3\-l\f1 ] \c
[ \f3\-t\f1 \f2NFS_polling_interval\f1 ] 
	[ \f3\-T\f1 \f2idle_timeout\f1 ] [ \f3\-p\f1 \c
\f2program\f3.\f1version\f1 ]
.fi
.SH DESCRIPTION
\f2fam\f1 is a server that tracks changes to the filesystem and
relays these changes to interested applications.
Applications such as
\f2fm\f1(1G) and \f2mailbox\f1(1) present an up-to-date view of the filesystem.
In the absence of \f2fam\f1, these applications and others like them
are forced to poll the filesystem to detect changes.
\f2fam\f1 is
more efficient.
.P
Applications can request \f2fam\f1 to monitor any files or directories in
any filesystem.
When \f2fam\f1 detects changes to monitored files, it notifies
the appropriate application.
\f2fam\f1(3X) provides a programmatic
interface to \f2fam\f1.
.P
\f2fam\f1 is informed of filesystem changes as they happen by the
IRIX kernel through the \f2imon\f1(7M) pseudo device driver.
If asked to
monitor files on an NFS mounted filesystem, \f2fam\f1 tries to use
\f2fam\f1 on the NFS server to monitor files.
If \f2fam\f1 cannot
contact a remote \f2fam\f1, it polls the files instead.
\f2fam\f1 also polls special files.
.P
Normally, \f2fam\f1 is started by \f2inetd\f1(1M).
It is registered with
\f2portmap\f1(1M) as performing the sgi_fam service.
.TP 26
\f3\-l\f1
Disable polling of NFS
files.
It does not disable use of remote \f2fam\f1 on NFS servers,
nor does it disable polling of local files.
.TP
\f3\-t\f1 \f2NFS_polling_interval\f1
Set the interval for polling files to \f2NFS_polling_interval\f1 seconds.
The default
is six seconds.
.TP
\f3\-T\f1 \f2idle_timeout\f1
Set the idle timeout interval to \f2idle_timeout\f1.
Fam exits \f2idle_timeout\f1 seconds after its
last client disconnects.
The default is five seconds.
.TP
\f3\-f\f1
If \f2fam\f1 is not started by \f2inetd,\f1 it remains in the
foreground instead of spawning a child and exiting.
.TP
\f3\-v\f1
Turn on verbose messages.
.TP
\f3\-d\f1
Enable verbose messages and debug messages.
.TP
\f3\-p\f1 \f2program\f3.\f1\f2version\f1
Use the specified RPC program and version numbers.
.SH NOTE
\f2fam\f1 runs as root to enable it to obtain attributes on any file,
regardless of the ownership and permissions
of the containing directories.
This means that any user can obtain the attributes
(i.e. the information returned by
.IR stat (2))
of any file in any local filesystem,
and when monitoring of NFS filesystems is enabled,
remote filesystems as well.
Note that \f2fam\f1 never reads or writes files,
it only uses
.IR stat (2)
on them.
The security implications are that
users may obtain the attributes of files
that they are otherwise unable to access.
Sites concerned about this
capability may disable this service.
(Disabling it will cause some loss of
functionality in the IRIX Interactive Desktop
and other programs.) 
See
.IR inetd (1M)
for details on how to disable \f2fam\f1.
.SH "SEE ALSO"
fm(1G),
inetd(1M),
mailbox(1),
portmap(1M),
fam(3X),
imon(7M).
