calmsacibis995/irix-6517-src/eoe/man/man1m/fcagent.1
.TH "fcagent" "1m" ""
.SH NAME
.B fcagent 
\- FibreVault Status/Configuration daemon

.SH SYNOPSIS
\f3fcagent\fP \f2fcagent-options-file\fP

.SH DESCRIPTION
\f3fcagent\fP is a daemon which allows communication with attached
FibreVault enclosures; status is collected and re-configuration is
allowed. 
.PP
The low-level transport protocol is the industry standard SES (SCSI-3
Enclosure Services). The top-level transport is via RPC to allow for
remote system monitoring and control. See \f3fccli(1M)\fP for details.
.PP
The \f3fcagent\fP is normally started automatically during boot if
\f3fcagent\fP is \f3chkconfig\fP'ed \f3on\fP. Three processes are
started for each instance of \f3fcagent\fP; the backend polling thread
which handles polling the FibreVault enclosures for status, the
frontend RPC thread which is responsible for communication with user
interfaces like \f3fccli\fP, and an event handler thread which handles
FRU status change events. Each event results in a user configurable
callout shell script being executed. These scripts are user
customizable.

.SH OPTIONS
The \f2fcagent-options-file\fP is provided for customizing certain
aspects of \f3fcagent\fP operation. This file normally resides at
\f3/etc/config/fcagent.options\fP. The contents of the file is a list
of customizable variables and their values. 
.TP 15
\f3PollPeriod\fP
Specifies the time, in seconds, between successive polls of a
particular FibreVault enclosure. Status change detection is not
interrupt driven so status changes will not be detected until the next
poll period. The default value is \f360\fP.
.TP 15
\f3FlashPeriod\fP
Specifies the "flash-period", in 1/10ths seconds, pertaining to the
\f3fccli\fP \f3flash\fP command. The default value is \f35\fP.
.TP 15
\f3PreRemovalCallout\fP
Specifies the pathname of the script to be executed just prior to
performing a \f3fccli\fP \f3remove\fP or \f3bypass\fP command. The
default value is \f3/usr/lib/fcagent/preremove.CO\fP.
.TP 15
\f3PostRemovalCallout\fP
Specifies the pathname of the script to be executed immediately
following the performance of a \f3fccli\fP \f3remove\fP or
\f3bypass\fP command. The default value is
\f3/usr/lib/fcagent/postremove.CO\fP.
.TP 15
\f3PostInsertionCallout\fP
Specifies the pathname of the script to be executed immediately
following the performance of a \f3fccli\fP \f3insert\fP or
\f3unbypass\fP command. The default value is
\f3/usr/lib/fcagent/postinsert.CO\fP.
.TP 15
\f3StatusChangedCallout\fP
Specifies the pathname of the script to be executed following a FRU
status change. The default value is
\f3/usr/lib/fcagent/statchanged.CO\fP.
.TP 15
\f3DebugLevel\fP
Specifies the "verbosity" of \f3fcagent\fP. The default value is \f30\fP.
.TP 15
\f3AllowRemoteRequests\fP
Tells \f3fcagent\fP to process requests that are not from localhost on a
reserved port.  This option allows any host on the network to perform any
operation.  The default value is \f30\fP, and can be set to \f31\fP to
allow remote requests.

.SH CONFIGURATION OF EVENT CALLOUT SCRIPTS
The \f3fcagent\fP event handler executes one or more callout scripts
in response to a FRU status change or user initiated
reconfiguration. Each time a script is executed, 9 arguments are
passed to it which a user can use to customize said scripts. For
example, the \f3StatusChangedCallout\fP script can be modified to
send mail to a system administrator's chatty pager should a fault be
detected. The arguments are as follows:

.TP 15
\f21 - host name\fP
A character string specifying the name of the host machine where the
FRU status change was detected.
.TP 15
\f22 - callout type\fP
A character string specifying the callout type. The possible values are
\f2INFO\fP, \f2RECONFIG\fP and \f2FAILURE\fP. The types can
be viewed in increasing priority of importance.  The \f2INFO\fP type
is used when the FRU status change is informational and little or no
system administrator intervention is needed. An example of an
informational state change is a disk FRU transitioning from \f2not
present\fP to \f2OK\fP following the insertion of of a previously
absent disk drive. The \f2RECONFIG\fP type is used following a
configuration change which may be of interest to the system
administrator. An example of a reconfiguration state change is a disk
FRU transitioning from \f2OK\fP to \f2bypassed\fP following the
execution of a \f3fccli bypass\fP command. The \f2FAILURE\fP type is used
when system administrator intervention is needed due to an unexpected
FRU failure.
.TP 15
\f23 - time stamp\fP
A character string specifying the time at which the status change occurred.
.TP 15
\f24 - channel ID\fP
A numerical character string specifying the channel number on which
the state change was detected.
.TP 15
\f25 - enclosure ID\fP
A numerical character string specifying the FibreVault enclosure
number on which the state change was detected. Is only specified for
the case of the \f3StatusChangedCallout\fP. It is set to -1 for
other callouts.
.TP 15
\f26 - FRU type\fP
A character string specifying the type/class of FRU for which the
status change is being reported. Possible values are \f2DISK\fP (for
disk FRUs), \f2PS\fP (for power supply FRUs), \f2FAN\fP (for fan
FRUs), and \f2LCC\fP (for Link-Control-Card FRUs).
.TP 15
\f27 - FRU ID\fP
A numerical character string specifying the ID of the FRU which
underwent the state change. Possible values are 0-9 for disk FRUs, 0-1
for power supply FRUs, 0 for fan FRUs, and 0 for LCC FRUs.
.TP 15
\f28 - State transition from state\fP
A character string specifying the from state of the FRU state
transition. Possible values are \f2OK\fP, \f2OFF\fP, \f2FAILED\fP,
\f2NOT-PRESENT\fP, \f2BYPASSED\fP, and \f2PEER-FAILED\fP. Is only
specified for the case of the \f3StatusChangedCallout\fP. Is set to
-1 for other callouts.
.TP 15
\f29 - State transition to state\fP
A character string specifying the to state of the FRU state
transition. Possible values are \f2OK\fP, \f2OFF\fP, \f2FAILED\fP,
\f2NOT-PRESENT\fP, \f2BYPASSED\fP, and \f2PEER-FAILED\fP. Is only
specified for the case of the \f3StatusChangedCallout\fP. Is set to
-1 for other callouts.

.SH EXAMPLES
The following is an example of a \f3StatusChangedCallout\fP C-shell
script which may be used to send mail to a system administraot
following the detection of a FRU failure.
.PP
.nf
#! /bin/csh -f
# 
# If the status change is a failure, send mail to system
# administrator.
#

set TMP="/tmp/statchanged_$$"

if ("$2" == FAILURE) then
	echo "$6 #$7 in enclosure $5 on channel $4 on host $1 FAILED at $3" > $TMP
	Mail -s "FRU Failure" root@alpha.centauri.com < $TMP
	/bin/rm -f $TMP
endif

.fi

.SH FILES
/usr/bin/fcagent
.br
/etc/config/fcagent.options
.br
/etc/init.d/fcagent
.br

.SH SEE ALSO
fccli(1M), chkconfig(1M)
