calmsacibis995/irix-6517-src/eoe/man/man1m/fddivis.1m
'\"macro stdmacro
.TH FDDIVIS 1M
.SH NAME
fddivis \- graphically display FDDI ring
.SH SYNOPSIS
.B fddivis
[\f3\-c \f2ConfFile\f1] [\f3\-r \f2RecDir\f1] [\f2host\f1]
.SH DESCRIPTION
\f3fddivis\fP
provides a graphical display the state of the FDDI ring.  It
forms a map of an FDDI ring as it watches Station Management (SMT)
Neighborhood Information Frame (NIF), Station Information Frame (SIF), and
Status Report Frame (SRF) traffic.
It is a full-screen application consisting of three windows: Ring, Map,
and Control Panel.
The largest of these, the Ring window, displays a representation of the ring.
The Map window provides a
summary of the ring map and is used to control the position of
the ring in the Ring window. The Control Panel window is used
to change what is displayed and the type of information collected.
.PP
Operating parameters are kept in \F1$HOME/.fddivisrc\fP,
but \f3\-c\fP can be used to specify an alternate file.
\f3\-r\fP can be used to start recording snapshots of the state of
the ring as the program starts.
.PP
The host to which the ring is connected can be specified with the \f2host\fP
argument.  This is particularly useful for monitoring a ring that is
connected to a remote system.
While \f3fddivis\fP can be run remotely and display its pictures
using the usual remote graphics facilities, running it locally but
obtaining data remotely requires much less network bandwidth.
It is entirely practical to monitor a remote FDDI ring over a very low
speed network connection such as a SLIP or PPP link using the \f2host\fP
facility.
.SS Ring Window
The main window of
\f3fddivis\fP
shows the ring using icons for stations (and concentrators) connected by lines.
The MAC address(es) for the stations are also shown.
Neighboring stations
that are reachable are shown with white solid lines.
The portion of ring that is broken is shown with a red broken line.
Twists in the ring are shown with crossed lines.
By default the IRIS is presented at the top of the ring as a workstation
with a purple screen.
The number of icons displayed is controlled by the Partial/Full button
in the Control Panel.
In the fullscreen mode, all the icons are displayed at the same time.
When there are many stations on the ring, it may be hard to distinguish
an individual icon and its MAC address.
In partial mode, at most 5 or 6 icons are displayed.
(If there are less than 10 stations on the ring, they are all displayed.)
The portion of ring to be drawn on the Ring window
can be selected by dragging or clicking the selecting arm in the Map Window at
the upper-left corner of the screen.
Clicking the left mouse button on a station creates a window that displays
detailed configuration and operational information about the station.
Clicking the middle mouse button on a station creates a window that
contains a remote login session to the station's ``guest'' account.
.SS Map Window
The Map window shows an overall view of the FDDI ring.
Each station is represented by a small filled-in circle.
The purple circle at top of the ring represents the IRIS.
Light-blue circles show the position
of the known neighbors within the FDDI ring, and gray circles show the
position of neighbors that are physically known but logically unknown.
.P
When in partial mode, the red arm in this window  controls what view
is displayed in the Ring window.
While the cursor is in the Map window, press and hold
down and drag or just click the left mouse button to move the red arm.
.SS Control Panel
The Control Panel is a mouse-driven menu.
To change or select an item, simply move the
arrow cursor over the item, and click the left mouse button.
There are four subpanels \(em Display, Capture, Tutorial, and Status \(em
that are selected via the four large buttons at the bottom of the
Control Panel.  An overview of each of the main control panel items follows:
.P
.nf
Display
	Collect and display NIF, SIF, and SRF information in real time.
Capture
	Control type of NIF, SIF, and SRF information and the query interval.
Tutorial
	Show the capabilities of \f3fddivis\fP.
Status
	Monitor the operational SMT parameters of the ring.
Help
	Get help on the current item.
Quit
	Quit.
.fi
.SH FILES
.nf
.ta \w'$HOME/.fddivisrc    'u
$HOME/.fddivisrc   control settings
/etc/.smtd         connection to local SMT daemon
.fi
.SH SEE ALSO
smtstat(1), smtd(1M)
