calmsacibis995/irix-6517-src/eoe/man/man1m/fingerd.1m
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)fingerd.8c	6.1 (Berkeley) 5/23/86
.\"
.TH fingerd 1M "May 23, 1986"
.SH NAME
fingerd \- remote user information server
.SH SYNOPSIS
.nf
\f3/usr/etc/fingerd\f1 [\f3\-l\f1] [\f3\-L\f1] [\f3\-S\f1] [\f3\-f\f1 \f2msg-file\f1]
.fi
.SH DESCRIPTION
.I fingerd
is a simple protocol based on RFC742 that provides an interface to the
\f2finger\f1 program at several network sites.
The program is supposed to return a friendly,
human-oriented status report on a particular person.
There is no required format, and the
protocol consists mostly of specifying a single ``command line.''
.PP
.I fingerd
listens for TCP requests at port 79.
Once connected, it reads a single line
terminated by a <CRLF> and passes the first three words on the line
as arguments to
.IR finger (1).
.I fingerd
closes its connection as soon as the output is finished.
It can be invoked at a remote site using the
.I finger
command by
.B finger
.IR user @ remote
or
.B finger
.RI @ remote .
.PP
The options to
.I fingerd
are:
.TP
.B \-l
Causes
.I fingerd
to log all finger requests via syslog.
.TP
.B \-L
Causes
.I fingerd
to only allow displaying of information on the local system.  This disallows chaining finger requests.
.TP
.B \-S
Causes
.I fingerd
to suppress information about login status, home directory, and shell,
which might be used to attack security.
.TP
.B \-f
Causes
.I fingerd
to display the contents of the specified message file only; no user
information is returned.
.PP
Edit the
.I fingerd
entry in
.I inetd.conf
to enable an option.
.SH SEE ALSO
finger(1),
inetd(1M),
syslogd(1M),
telnet(1C).
.SH BUGS
Connecting directly to the server from a TIP
or an equally narrow-minded TELNET-protocol user program can result
in meaningless attempts at option negotiation being sent to the
server, which fouls up the command-line interpretation.
.I fingerd
should be taught to filter out IACs and perhaps even respond
negatively (IAC WON'T) to all option commands received.
