calmsacibis995/irix-6517-src/eoe/man/man1m/fpck.1m
.nr X
.if \nX=0 .ds x} fpck 1M "Silicon Graphics" "\&"
.TH \*(x}
.SH NAME
fpck \- check and repair either FAT (MSDOS) or HFS (MACINTOSH) filesystems
.SH SYNOPSIS
.nf
\f3fpck \-t\f1 \f3mac\f1 | \f3hfs\f1 | \f3dos\f1 | \f3fat\f1 \c
[\f3\-c\f1] [\f3\-p #\f1] special
.fi
.SH DESCRIPTION
.I fpck
audits and repairs inconsistent conditions for filesystems.
When
.I fpck
locates major filesystem structure destruction, such as critical
sector damage or unrecoverable error, an error message is
given.
Otherwise, the user is notified with a warning message.
.PP
The
.B \-t
flag
is required to designate a target filesystem.
This utility
supports two types of filesystem with four options.
.B dos
and
.B fat
are synonyms in representing MSDOS FAT filesystem while
.B mac
and
.B hfs
are synonyms in representing
MACINTOSH HFS filesystem.
.PP
The
.B \-p #
argument is used to specify a partition # for
.B dos
formats.
.PP
The default action is no correction, unless the
.B \-c
flag is given.
.PP
Supported floppy types for FAT filesystem and their corresponding
.I special
files are:
.PP
.nf
.in +5
360K, DS, DD, 5.25 inch disk	/dev/rdsk/fds?d?.48
720K, DS, DD, 3.5  inch disk	/dev/rdsk/fds?d?.3.5
1.2M, DS, HD, 5.25 inch disk	/dev/rdsk/fds?d?.96hi
1.4M, DS, HD, 3.5  inch disk	/dev/rdsk/fds?d?.3.5hi
20M floptical, 3.5  inch disk	/dev/rdsk/fds?d?.3.5.20m
120M LS-120, 3.5 inch media	/dev/rdsk/dks?d?vol
.in -5
.fi
.PP
Supported floppy types for HFS filesystems and their corresponding
.I special
files are:
.PP
.nf
.in +5
1.4M, DS, HD, 3.5 inch disk	/dev/rdsk/fds?d?.3.5hi
20M floptical, 3.5 inch disk	/dev/rdsk/fds?d?.3.5.20m
44M, 88M, 105M, 200M, 270M	SyQuest cartridge /dev/rdsk/fds?d?.48
120M LS-120, 3.5 inch media	/dev/rdsk/dks?d?vol
.in -5
.fi
.SH SEE ALSO
mkfp(1M).
