calmsacibis995/irix-6517-src/eoe/man/man1m/fsr_xfs.1m
.nr X
.if \nX=0 .ds x} fsr_xfs 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
fsr_xfs \- filesystem reorganizer for XFS
.SH SYNOPSIS
.nf
\f3/usr/etc/fsr_xfs\f1 [\f3\-v\f1] \c
[\f3\-t\f1 seconds] [\f3\-f\f1 leftoff] [\f3\-m\f1 mtab]
\f3/usr/etc/fsr_xfs\f1 [\f3\-v\f1] \c
[xfsdev | file] ...
.fi
.SH DESCRIPTION
.I fsr_xfs
is applicable only to XFS filesystems.
.PP
.I fsr_xfs
improves the organization of mounted filesystems.
The reorganization algorithm operates on one file at a time,
compacting or otherwise improving the layout of
the file extents (contiguous blocks of file data).
.PP
The following options are accepted by
.IR fsr_xfs .
The
.BR \-m ,
.BR \-t ,
and
.B \-f
options have no meaning if any filesystems
or files are specified on the command line.
.TP 13 
.BI \-m " mtab"
Use this file for the list of filesystems to reorganize.
The default is to use
.IR /etc/mtab .
This file must be in
.IR mtab (4)
format.
.TP
.BI \-t " seconds"
How long to reorganize.
The default is 7200 (2 hours).
.TP
.BI \-f " leftoff"
Use this file instead of
.I /var/tmp/.fsrlast
to read the state of where to start and as the file
to store the state of where reorganization left off.
.TP
.B \-v
Verbose.
Print cryptic information about
each file being reorganized.
.PP
The intended usage is to regularly run the
.I fsr
command which in turn invokes
.I fsr_xfs 
when it encounters XFS filesystems.
By default this is done from
.I crontab
once per week.
.PP
When invoked with no arguments
.I fsr_xfs
reorganizes all regular files in all mounted filesystems.
.I fsr_xfs
makes many cycles over
.I /etc/mtab
each time making a single pass over each XFS filesystem.
Each pass goes through and selects files
that have the largest number of extents.  It attempts
to defragment the top 10% of these files on each pass.
.PP
It runs for up to two hours after which it records the filesystem
where it left off, so it can start there the next time.
This information is stored in the file
.I /var/tmp/.fsrlast_xfs.
If the information found here
is somehow inconsistent or out of date
it is ignored
and reorganization starts at the beginning of the first
filesystem found in
.IR /etc/mtab .
.PP
.I fsr_xfs
can be called with one or more arguments
naming filesystems (block device name),
and files to reorganize.
In this mode
.I fsr_xfs
does not read or write
.I /var/tmp/.fsrlast_xfs
nor does it run for a fixed time interval.
It makes one pass through each specified regular file and
all regular files in each specified filesystem.
A command line name referring to a symbolic link
(except to a file system device),
FIFO, or UNIX domain socket
generates a warning message, but is otherwise ignored.
While traversing the filesystem these types
of files are silently skipped.
.SH FILES
.PD 0
.TP 21
/etc/mtab
contains default list of filesystems to reorganize.
.TP 21
/var/tmp/.fsrlast_xfs
records the state where reorganization left off.
.PD
.SH "SEE ALSO"
fsr(1M),
mkfs_xfs(1M),
mtab(4),
xfs_ncheck(1M),
xfs(4).
.SH "NOTES"
.I fsr_xfs
improves the layout of extents for each file by copying the entire
file to a temporary location and then interchanging the data extents 
of the target and temporary files in an atomic manner.  
This method requires that enough free disk space be available to copy 
any given file and that the space be less fragmented then the original
file.
It also requires the owner of the file to have enough remaining
filespace quota to do the copy on systems running quotas.
.I fsr_xfs
generates a warning message if space is not sufficient to improve
the target file.
.PP
A temporary file used in improving a file given on the command line
is created in the same parent directory of the target file and
is prefixed by the string '\f3.fsr\f1'.   
The temporary files used in improving an entire XFS device are stored
in a directory at the root of the target device and use the same
naming scheme.
The temporary files are unlinked upon creation so data will not be
readable by any other process.
.PP
.I fsr_xfs
does not operate on files that are currently mapped in memory.
A 'file busy' error can be seen for these files if the verbose
flag (\f3-v\f1) is set.
.PP
An entry in
.I /etc/mtab
or the file specified using the
.B \-m
option must have the
.B rw
option specified for read and write access.
If this option is not present, then
.I fsr_xfs
skips the
filesystem described by that line.
See the
.IR fstab (4)
and
.IR mtab (4)
reference pages for
more details.
