calmsacibis995/irix-6517-src/eoe/man/man1m/ftpd.1m
'\"macro stdmacro
.\" Copyright (c) 1985, 1988 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)ftpd.8	6.7.1.1 (Berkeley) 3/2/89
.\"
.TH FTPD 1M
.UC 5
.SH NAME
ftpd \- Internet File Transfer Protocol server
.SH SYNOPSIS
.B /usr/etc/ftpd
[
.B \-dSlp
] [
.BI \-t timeout
] [
.BI \-T maxtimeout
]
.br
    [
.BI \-u umask
]
.SH DESCRIPTION
.I Ftpd
is the Internet File Transfer Protocol
server process.  The server uses the TCP protocol
and listens at the well-known port specified in the 
.IR services (4)
file.
.PP
.I Ftpd
is started by 
.IR inetd (1M)
whenever a remote client makes a connection request.
The following options should specified on the ftpd line  in
.IR inetd 's
configuration file, /etc/inetd.conf.
.PP
If the
.B \-l
option is specified,
each successful and failed ftp session login is logged in the syslog.
If this option is specified twice, the retrieve (get), store (put), append,
delete, make directory, remove directory and rename operations and 
their filename arguments are also logged.
If this option is specified thrice, 
logging for the retrieve (get) and store (put) commands includes
the number of bytes transferred.
.PP
If the 
.B \-d
option is specified,
verbose debugging information is written to the syslog.
Note: this option logs all the commands and arguments that the 
client sends. However arguments from the PASS command for normal accounts
are not logged.
.PP
The ftp server
will timeout an inactive session after 15 minutes.
If the
.B \-t
option is specified,
the inactivity timeout period will be set to
.I timeout
seconds.
A client may also request a different timeout period;
the maximum period allowed may be set to
.I timeout
seconds with the
.B \-T
option.
The default limit is 2 hours.
.PP
The
.B \-u
option specifies the default file protection mask (see \f2umask\fP(1)).
If not specified, the default mask is set to 022 (group- and world-readable).
A client may also request a different mask.
.PP
The
.B \-S
option turns on extra safety measures for anonymous FTP sites.
For one thing, makes symbolic links appear to be ordinary links,
so that links do not leak names in 'private' directories.
(Those are directories that are not searchable by anonymous users.)
.PP
The
.B \-p
option turns on address checking to prevent the PORT command
from redirecting the ftp-data connection to a third party machine.
This provides added protection from network scanning.
.PP
The file
.I /etc/nologin
can be used to disable ftp access.
If the file exists,
.I ftpd
prints it and exits.
If the file
.I /etc/issue
exists, 
.I ftpd
prints it before issuing the ``ready'' message.  
.PP
The ftp server currently supports the following ftp
requests; case is not distinguished.
.PP
.nf
.ta \w'Request        'u
\f3Request	Description\fP
ABOR	abort previous command
ACCT	specify account (ignored)
ALLO	allocate storage (vacuously)
APPE	append to a file
CDUP	change to parent of current working directory
CWD	change working directory
DELE	delete a file
HELP	give help information
LIST	give list files in a directory (``ls \-lA'')
MKD	make a directory
MDTM	show last modification time of file
MODE	specify data transfer \f2mode\fP
NLST	give name list of files in directory 
NOOP	do nothing
PASS	specify password
PASV	prepare for server-to-server transfer
PORT	specify data connection port
PWD	print the current working directory
QUIT	terminate session
REST	restart incomplete transfer
RETR	retrieve a file
RMD	remove a directory
RNFR	specify rename-from file name
RNTO	specify rename-to file name
SITE	non-standard commands (see next section)
SIZE	return size of file
STAT	return status of server
STOR	store a file
STOU	store a file with a unique name
STRU	specify data transfer \f2structure\fP
SYST	show operating system type of server system
TYPE	specify data transfer \f2type\fP
USER	specify user name
XCUP	change to parent of current working directory (deprecated)
XCWD	change working directory (deprecated)
XMKD	make a directory (deprecated)
XPWD	print the current working directory (deprecated)
XRMD	remove a directory (deprecated)
.fi
.PP
The following non-standard or UNIX specific commands are supported
by the SITE request.
.PP
.nf
.ta \w'Request        'u
\f3Request	Description\fP
UMASK	change umask, e.g., SITE UMASK 002
IDLE	set idle-timer, e.g., SITE IDLE 60
CHMOD	change mode of a file, e.g., SITE CHMOD 755 filename
HELP	give help information, e.g., SITE HELP
.fi
.PP
The remaining ftp requests specified in Internet RFC 959 are
recognized, but not implemented.
MDTM and SIZE are not specified in
RFC 959, but will appear in the next updated FTP RFC.
.PP
The ftp server will abort an active file transfer only when the
ABOR command is preceded by a Telnet "Interrupt Process" (IP)
signal and a Telnet "Synch" signal in the command Telnet stream,
as described in Internet RFC 959.
If a STAT command is received during a data transfer, preceded by a Telnet IP
and Synch, transfer status will be returned.
.PP
.I Ftpd
interprets file names according to the ``globbing''
conventions used by
.IR csh (1).
This allows users to utilize the metacharacters ``*?[]{}~''.
.PP
.I Ftpd
authenticates users according to three rules. 
.IP 1) 3
The user name must be in the password data base,
.IR /etc/passwd ,
and not have a null password.  In this case a password
must be provided by the client before any file operations
may be performed.
.IP 2)
The user name must not appear in the file
.IR /etc/ftpusers .
However, if the user name is in
.I /etc/ftpusers
followed by the white-space separated keyword ``restrict'', the user is 
allowed restricted access privileges, as described below.
.IP 3)
If the user name is ``anonymous'' or ``ftp'', an
anonymous ftp account must be present in the password
file (user ``ftp'').  In this case the user is allowed
to log in by specifying any password (by convention this
is given as the client user and host name).
.PP
For the restricted and anonymous accounts,
.I ftpd
takes special measures to restrict the client's access privileges.
The server performs a 
.IR chroot (2)
command to the home directory of the user
and prints the file README
if it exists.
In order that system security is not breached, it is recommended
that the subtree be constructed with care;  the following
rules are recommended, using the ``ftp'' anonymous account as an example.
If you allow logins as the ftp account, then you should instead make
all the files and directories owned by a user and group other than
ftp (or any other account that can login using the restricted passwd
file in the chrooted tree), with the possible exception of directories to
which you allow file transfers, such as ~ftp/pub.  Remember that because
the account name and password are valid, the user will be able to login
directly or via
.IR telnet ,
.IR rlogin ,
or
.IR rsh .
This can be prevented, if desired, by using the feature documented in the
.IR passwd (4)
man page, having the shell field start with 
.BR * ,
and the home directory being a real or impossible base for the chrooted
environment.  See that manual page for more information.
.IP ~ftp 10
Make the home directory owned by ``bin'' and unwritable by anyone
(mode 555 \(em see \f2chmod\f1(1)):
.RS
.Ex
chown bin ~ftp
chmod a-w ~ftp
.Ee
.RE
.IP ~ftp/bin 10
Make this directory owned by the super-user and unwritable by
anyone (mode 555).  The program
.IR ls (1)
must be present to support the list commands.  This
program should have mode 111.
.IP ~ftp/etc 10
Make this directory owned by the super-user and unwritable by
anyone (mode 555).  The files
.IR passwd (4)
and
.IR group (4)
must be present for the 
.I ls
command to be able to produce owner names rather than numbers.
This should not be a copy of the real file in /etc, and in particular,
it should contain no encrypted passwords from the real /etc/passwd
or /etc/group.
The password field in
.I passwd
is not used.
Only the minimal number of accounts should be listed.
These files should be mode 444.
.IP ~ftp/lib32 10
Make this directory own by the super-user and unwritable by
anyone (mode 555).  In order for ls to run, the files
.IR /lib32/rld
and
.IR /lib32/libc.so.1
must be copied into lib32 (older releases, or some uses of other programs
might also require the o32 versions in 
.IR /lib .
Both 
.I rld
and
.I libc.so.1
should 
be readable and executable by everyone, \f2e.g.\fP mode 555.
.IP ~ftp/dev 10
Make this directory owned by the super-user and unwritable by
anyone (mode 555).
.I rld
uses 
.IR /dev/zero, 
so use mknod(1) to make a copy  of 
.IR /dev/zero
in ~ftp/dev
with the same major and minor device numbers.
Make 
.IR /dev/zero 
read-only (mode 444).
.RS
.Ex
mknod ~ftp/dev/zero c 37 0
chmod 444 ~ftp/dev/zero
.Ee
.RE
.IP ~ftp/pub 10
Make this directory owned by ``ftp''.  
If local users and remote anonymous users are to be allowed to write 
in this directory, change the directory's mode to 777.
Users can then place files which are to be accessible via the
anonymous account in this directory.
If write accesses are to be denied, change the directory's mode to 555.
.SH SHARE II ACTIONS
If the Share II system is installed and enabled, then
the following privilege and resource checks are made
immediately after the other validation checks are passed
but before the ftp session is permitted to begin:
.IP 1. 4n
If your
\f4nologin\f1
flag is set, or you already have another connection and your
\f4onelogin\f1
flag is set, then you are denied connection.
.IP 2.
If a disk usage exceeds its soft disk limit in any of your domains,
then a message is printed and you are given a
\f2warning\f1.
If you accumulate too many warnings, further connection attempts are denied and
you must see your subadministrator to rectify the situation.
Whenever you connect with no disk usages in excess of any soft limits,
all your accumulated warnings are cleared.
.IP 3.
If you do not have permission to use an
\f2ftp\f1
connection, as determined by the terminal permission flag
\f4terminal.flag.ftp\f1,
then you are denied connection.
.IP 4.
Some installations place limits on terminal connect-time,
which apply equally to connection by way of 
\f2ftp\f1.
If you have already reached your connect-time limit, then you are
denied connection.
Otherwise, if you have a limit, your remaining connect-time is printed.
.PP
If all of these checks are passed,
\f4ftpd\f1
proceeds normally.
.SH "FILES"
.ta \w'/etc/ftpusersxxxxx'u
/etc/ftpusers		list of unwelcome/restricted users
.br
/etc/issue		welcome notice
.br
/etc/nologin		disables access
.br
/etc/limconf		The compiled Share II configuration file (machine readable)
.SH "SEE ALSO"
login(1), ftp(1C), inetd(1M), rexecd(1M), syslogd(1M), passwd(4), share(5)
.SH DIAGNOSTICS
The Share II specific diagnostic messages are listed as follows:
.TP
\f4Warning \f2X\fP of \f2Y\f1: soft disk limit exceeded.\f1
One of your domains has a disk usage in excess of its soft limit.
.TP
\f4Connection denied.  Too many warnings.\f1
You have reached your warning limit.  See your subadministrator.
.TP
\f4Connection denied.  Already logged in \- only one login allowed.\f1
You are already connected to the system and your
\f4onelogin\f1
flag is set.
.TP
\f4Connection denied.  Currently barred from logging in.
Your
\f4nologin\f1
flag is set.
.TP
\f4Connection denied.  No permission to use this terminal.\f1
You are not allowed to log in at this terminal because of a clear
\f4terminal.flag.rsh\f1
flag.
.TP
\f4You have a remaining terminal connect-time of \f2Y\f1.
You may use this connection until you have used up your remaining
connect-time, at which point you are forced to disconnect.
.TP
\f4Connection denied.  Terminal connect-time limit exceeded.\f1
You have already reached your terminal connect-time limit.
.TP
\f4Share not configured \- no limit checks.\f1
The configuration file is unreadable for some reason, so
terminal privileges, connect-time limits and disk space limits
could not be checked.
.SH BUGS
The anonymous account is inherently dangerous and should
avoided when possible.
.PP
The server must run as the super-user
to create sockets with privileged port numbers.  It maintains
an effective user ID of the logged in user, reverting to
the super-user only when binding addresses to sockets.  The
possible security holes have been extensively
scrutinized, but are possibly incomplete.
