calmsacibis995/irix-6517-src/eoe/man/man1m/fuser.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} fuser 1M "System Administration Utilities" "\&"
.TH \*(x}
.SH NAME
\f4fuser\f1 \- identify processes using a file or file structure
.SH SYNOPSIS
.nf
\f4fuser\f1 [\f4\-\f1[\f4c\f1|\f4f\f1]\f4kqu\f1] \f2files\f1 [[\f4\-\f1] \c
\f1[\f4\-\f1[\f4c\f1|\f4f\f1]\f4kqu\f1] \f2files\f1
.fi
.SH DESCRIPTION
\f4fuser\fP
outputs the process IDs of the processes
that are using the \f2files\fP specified as arguments.
Each process ID is followed by one of these letter codes, which identify
how the process is using the file:
.TP 4
\f4c\f1
As its current directory.
.TP
\f4r\f1
As its root directory, which was set up by the \f4chroot\fP(1M) command.
.TP
\f4o\f1
As an open file.
.TP
\f4t\f1
As its text file.
.TP
\f4m\f1
As a mapped file, requested by \f4mmap\fP(2) or \f4exec\fP(2) in the
case of dynamic shared libraries.
.TP
\f4y\f1
As its controlling terminal.
.TP
\f4a\f1
As its trace file located in the \f4/proc\fP directory.
.PP
For block special devices with mounted filesystems, processes using
any file on that device are listed (unless the \f4\-f\fP flag is specified).
If \f2file\fP
has the form
\f2hostname:pathname\fP
and names a mounted NFS filesystem,
all processes using any file in that system are listed.
.PP
If \f2file\fP has the form \f2port/protocol\fP
or \f2hostname:port/protocol\fP
and names no file or directory,
\f4fuser\fP
lists all processes using sockets bound or connected to the specified port.
\f2port\fP
may be either an integer constant or a service name (see
\f4services\fP(4)).
\f2protocol\fP
must be either
\f4tcp\fP or \f4udp\fP, and \f2hostname\fP
(if specified) must be an Internet address or hostname (see
\f4hosts\fP(4)).
For all other types of files (text files, executables, directories,
devices, UNIX-domain sockets, and so on) only the processes using that file are reported.
.PP
The following options may be used with \f4fuser\fP:
.TP
\f4\-c\f1
May be used with files that are mount points for filesystems.
With that option the report is for use of the
mount point and any files within that mounted filesystem.
.TP
\f4\-f\f1
When this is used, the report is only for the named
file, not for files within a mounted filesystem or block device.
Note that \f4\-f\f1 and \f4\-c\f1 are mutually exclusive.
.TP
\f4\-u\f1
The user login name, in parentheses,
also follows the process ID.
.TP
\f4\-q\f1
Quiet mode: \f4fuser\f1
prints nothing except process IDs separated by commas
to the standard output.
This option is useful in conjunction with
the \f4\-p\fP option of
\f4ps\fP(1).
.TP
\f4\-k\f1
The SIGKILL
signal is sent to each process.
Since this option spawns kills
for each process, the kill messages may not show up immediately
(see
\f4kill\fP(2)).
.TP
\f4\-\f1
A lone dash cancels the options currently in force.
.PP
If more than one group of files are specified, the
options may be respecified for each additional group of files.
.PP
If the \f4-q\f1 flag is not in effect,
the process IDs are printed as a single line on the standard output,
separated by spaces and terminated with a single new line.
All other output is written on standard error.
.PP
Any user can use \f4fuser\f1.
Only a privileged user can terminate another user's process.
.SH EXAMPLES
.Ex
\f4fuser \-cku /usr\f1
.Ee
If typed by a user with appropriate privileges, terminates all processes
that are preventing \f4/usr\fP filesystem from being unmounted,
listing the process
ID and login name of each as it is killed.
.Ex
\f4fuser \-u /etc/passwd\f1
.Ee
Lists process IDs and login names
of processes that have the password
file open.
.Ex
\f4fuser \-cku /usr \-u /etc/passwd\f1
.Ee
Executes both of the above examples in a single command line.
.SH CAVEATS
TCP and UDP ports bound by the kernel (\f2e.g.\fP NFS client endpoints) cannot
be mapped to a process ID and no output will be generated.
.P
TCP and UDP ports bound by TLI applications (\f2e.g.\fP
.BR rpcbind (1M))
cannot
be currently mapped to a process ID and no output will be generated.  This will
be corrected in a future release.
.SH SEE ALSO
chroot(1M),
mount(1M),
ps(1),
kill(2),
signal(2),
proc(4).
