calmsacibis995/irix-6517-src/eoe/man/man1m/fwtmp.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH fwtmp 1M
.SH NAME
\f4fwtmp\f1, \f4wtmpfix\f1 \- manipulate connect accounting records
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/fwtmp\f1 [\f4-ic\f1]
\f4/usr/lib/acct/wtmpfix\f1 [\f2files\fP]
.fi
.SH DESCRIPTION
\f4fwtmp\fP reads from the standard input and
writes to the standard output,
converting binary records of the type found in
\f4/var/adm/wtmp\fP to formatted ASCII records.
The ASCII version is useful when it is necessary to edit
bad records.
.PP
The argument \f4-ic\fP is used
to denote that input is in ASCII form
and that output is to be written in binary form.
.PP
\f4wtmpfix\fP
examines the standard input or named files in
\f4utmp.h\fP format, corrects the time/date stamps to make the
entries consistent, and writes to the standard output.
A \f4-\fP can be used in place of \f2files\fP to indicate
the standard input.
If time/date corrections are not performed,
\f4acctcon\fP
faults when it encounters certain date-change records.
.PP
Each time the date is set,
a pair of date change records are written to \f4/var/adm/wtmp\f1.
The first record is the old date denoted
by the string \f4old time\f1 placed in
the \f4line\f1 field and the flag \f4OLD_TIME\f1 placed
in the \f4type\f1 field of the \f4utmp\f1 structure.
The second record specifies the new date and is
denoted by the string \f4new time\f1
placed in the \f4line\fP field and the flag
\f4NEW_TIME\f1 placed in the \f4type\fP field.
\f4wtmpfix\fP
uses these records to synchronize all time stamps in the file.
.PP
In addition to correcting time/date stamps,
\f4wtmpfix\fP checks the validity
of the \f4name\f1 field to ensure that it consists
solely of alphanumeric characters
or spaces.
If it encounters a name that is considered invalid,
it changes the login name to
\f4INVALID\f1
and writes a diagnostic to the standard error.
In this way, \f4wtmpfix\fP reduces the chance that \f4acctcon\fP
will fail when processing connect accounting records.
.SH FILES
\f4/var/adm/wtmp\f1
.br
\f4/usr/include/utmp.h\f1
.SH REFERENCES
acct(1M),
acctcms(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctprc(1M),
acctsh(1M),
ed(1),
runacct(1M),
acct(2),
acct(4),
utmp(4).
