calmsacibis995/irix-6517-src/eoe/man/man1m/getty.1m
'\"macro stdmacro
.if n .pH g1a.getty @(#)getty	30.5 of 3/14/86
.nr X
.if \nX=0 .ds x} GETTY 1M "Essential Utilities" "\&"
.if \nX=1 .ds x} GETTY 1M "Essential Utilities"
.if \nX=2 .ds x} GETTY 1M "" "\&"
.if \nX=3 .ds x} GETTY "" "" "\&"
.TH \*(x}
.SH NAME
getty \- set terminal type, modes, speed, and line discipline
.SH SYNOPSIS
\f3/sbin/getty\fP [\f3\-hN\fP] [\f3\-t\fP timeout] line [speed [type [linedisc]]]
.br
.B /sbin/getty \-c
file
.SH DESCRIPTION
.I getty
is a program that is invoked by
.IR init (1M).
It is the second process in the series,
.RI ( init-getty-login-shell )
that ultimately connects a user with the \s-1UNIX\s0 system.
It can only be executed by the super-user; that is, a process with
the user-ID of \f3root\f1.
Initially
.I getty
prints the contents of \f3/etc/issue\f1 (if it exists), then
prints the login message field for the entry it is using from 
.BR /etc/gettydefs ,
reads the user's login name, and invokes the
.IR login (1)
command
with the user's name as argument.
While reading the name,
.I getty
attempts to adapt the system to the speed and type of terminal
being used.
It does this by using the options and arguments specified.
.PP
.I Line
is the name of a tty line in \f3/dev\fP to which
.I getty
is to attach itself.
.I getty
uses this string as the name of a file in the \f3/dev\fP directory
to open for reading and writing.
Unless
.I getty
is invoked with the
.B \-h
flag,
.I getty
will force a hangup on the line by setting the speed to zero
before setting the speed to the default or specified speed.
The
.B \-t
flag plus \f2timeout\fP (in seconds), specifies that
.I getty
should exit if the open on the line succeeds and no
one types anything in the specified number of seconds.
.PP
The
.B \-N
option honors the \f3/etc/nologin\f1 file.  When present, \f2getty\f1
does not answer the line, but instead waits for the file to go away.
.PP
.IR Speed ,
the optional second argument,
is a label to a speed and tty definition in the file
.BR /etc/gettydefs .
This definition tells
.I getty
at what speed to initially run, what the login message should look
like, what the initial tty settings are, and what speed to try next
should the user indicate that the speed is inappropriate (by typing a
.I <break>
character).
.PP
.IR Type ,
the optional third argument,
is a character string describing to
.I getty
what type of terminal is
connected to the line in question.
.I getty
recognizes the following types:
.P
.RS
.nf
\f3none\f1			default
\f3ds40-1\f1		Dataspeed40/1
\f3tektronix,tek\f1	Tektronix
\f3vt61\f1			\s-1DEC\s+1 vt61
\f3vt100\f1		\s-1DEC\s+1 vt100
\f3hp45\f1			Hewlett-Packard 45
\f3c100\f1			Concept 100
.fi
.RE
.P
The default terminal is \f3none\fP; i.e.,
any crt or normal terminal unknown to the system.
Also, for terminal type to have any meaning, the virtual
terminal handlers must be compiled into the operating system.
They are available, but not compiled in the default condition.
.PP
.IR Linedisc ,
the optional fourth argument,
is a character string describing which line discipline to use
in communicating with the terminal.  There are two line disciplines.
.SM
.BR LDISC0\*S
is the familiar System V line discipline.
.SM
.B LDISC1
is similar to the 4.3BSD ``new 
.I tty
driver'' (see 
.IR termio (7)).
.SM
.B LDISC1
is the default.
.PP
When given no optional arguments,
.I getty
sets the \f2speed\fP of the interface to 9600 baud,
specifies that raw mode is to be used (awaken on every character),
that echo is to be suppressed, 
either parity allowed,
new-line characters will be converted to carriage return-line feed,
and tab expansion performed on the standard output.
It types the login message before reading
the user's name a character at a time.
If a null character (or framing error) 
is received, it is assumed to be the result
of the user pushing the ``break'' key.
This will cause
.I getty
to attempt the next \f2speed\fP in the series.
The series that
.I getty
tries is determined by what it finds in
.BR /etc/gettydefs .
Modems which "lock" to a single speed, such as most high speed modems,
should be used with a \f3gettydefs\f1 entry which sticks to a single
speed, such as dx_19200.  This also applies to devices that send
spurious ``break'' signals.  To allow baud rate cycling on the main
serial console, change the ttyd1 entry from console to co_9600.
.PP
After the user's name has been typed in,
it is terminated by a new-line or
carriage-return character.
The latter results in the system being set to
treat carriage returns appropriately (see
.IR ioctl (2)).
.PP
The user's name is scanned to see if
it contains any lower-case alphabetic characters; if not,
and if the name is non-empty, the
system is told to map any future upper-case characters
into the corresponding lower-case characters.
.PP
Finally,
.I login
is \f3exec\fP(2)'d with the user's name as an argument.
Additional arguments may be typed after the login name.  These are
passed to
.IR login ,
which will place them in the environment (see
.IR login (1)).
.PP
If 
.I getty 
is running on the graphics console,
.I getty
checks to see if autologin is enabled by verifying the existence of
.B /etc/autologin 
and 
.B /etc/autologin\&.on 
(see
.IR login (1)).
If autologin is enabled,
.I getty 
will invoke 
.I login
with the autologin option.
.PP
.I getty
cannot be used on a line that is also to be used by outgoing
calls made by \f2uucp\fP, \f2cu\fP, or similar programs.
The very similar \f2uugetty\fP(1M) use should be used instead.
.PP
When
.I getty
is invoked with the
.B \-c
option and \f2file\fP, it scans the file as if it were scanning
.B /etc/gettydefs
during normal operation,
and prints out the results to the standard output.  If there
are any unrecognized modes or improperly constructed entries, it
reports these.  If the entries are correct, it prints out the
values of the various flags.  See
.IR ioctl (2)
to interpret the
values.  Note that some values are added to the flags automatically.
.SH FILES
.nf
/etc/nologin
/etc/gettydefs
/etc/issue	message printed before \f2login\fP prompt
/etc/autologin
/etc/autologin.on
/var/adm/SYSLOG
.SH "SEE ALSO"
init(1M),
login(1), uugetty(1M), cu(1C), uucp(1C),
ioctl(2),
gettydefs(4),
inittab(4),
tty(7), serial(7)
.SH DIAGNOSTICS
Most error messages are sent to the system log, \f2/var/adm/SYSLOG\fP.
A message similar to
.Ex
\f4getty[5310]: ioctl(TCSETAF)584: Invalid argument\fP
.Ee
may indicate that the tty line does not support the baud rate specified
in \f2/etc/gettydefs\fP.  See
.IR serial(7) 
for information on which
baud rates are supported.
.SH BUGS
While
.I getty
understands simple single character quoting conventions,
it is not possible to quote certain special control characters used by
.IR getty .
Thus, you cannot login via
.I getty
and type a \f3#\fP,
\f3@\fP,
\f3/\fP,
\f3!\fP,
\f3_\fP,
backspace,
\fP^U\fP,
\f3^D\fP,
or \f3&\fP as part
of your login name or arguments.
.I getty
uses them to determine when the end of the line has been reached, which
protocol is being used, and what the erase character is.
They will always be interpreted as having their special meaning.
