calmsacibis995/irix-6517-src/eoe/man/man1m/grio_bandwidth.1m
.TH grio_bandwidth 1M
.SH NAME
grio_bandwidth \- determines guaranteed-rate I/O device bandwidth
.SH SYNOPSIS
.nf
\f3grio_bandwidth\f1 \f3\-d\f1 device \f3\-s\f1 iosize \c
[ \f3\-ruwV\f1 ] [ \f3\-t\f1 sampletime ]
\f3grio_bandwidth\f1 \f3\-c\f1 controller \f3\-s\f1 iosize \c
[ \f3\-ruwV\f1 ] [ \f3\-t\f1 sampletime ]
\f3grio_bandwidth\f1 \f3-R\f1 \f3\-s\f1 iosize \c
[ \f3\-fruwV\f1 ] [ \f3\-t\f1 sampletime ]
.fi
.SH DESCRIPTION
.I grio_bandwidth
is used to determine the number of I/O operations of a given size that
can be guaranteed to be performed by a given disk device, RAID subsystem or SCSI controller in one second.
It creates processes which
repeatedly issue I/O requests of the given size, and device seeks of random lengths,
to the specified devices.
The length of time to complete each request is recorded and this information 
is used to determine the average number of I/O
operations that were performed by the device per second over the sample period.
This number is degraded by 10% to provide an approximation of the increase in I/O response 
time caused by a  heavily loaded system.
In addition,
.I grio_bandwidth
keeps track of the longest time to complete an I/O operation time over the sample period
and calculates the number of such "worst case" operations that can be performed each second.
The system administrator can use
.I grio_bandwidth 
to obtain the bandwidth information needed to create new entries
in the Guaranteed Rate I/O device bandwidth information file \f2\/etc\/grio_disks\f1.
.PP
The \f3-d\f1 option is used to specify a single disk device. The disk name
could be specified in the /dev/[r]dsk alias name format, or in the format
reported back by -P, -C and -F options of the \f3grio(1M)\f1 command.
The \f3-c\f1 option is used to specify a single SCSI controller name. The
name has to be specified in the format reported back by -P, -C and -F
options of the \f3grio(1M)\f1 command. This is also the same format used
in \f3/etc/ioconfig.conf\f1.
The \f3-R\f1 option will cause the utility to scan for all RAID devices
attached to the system.
The \f3-s\f1 option is used to specify the size of the I/O operation in bytes. It
must be specified, there is no default value.
The \f3-t\f1 option is used to specify the length of the sample period in seconds. 
By default the sample period has a length of 10 minutes.
If the \f3-u\f1 option is specified, the \f2\/etc\/grio_disks\f1 file
will be automatically updated with the device bandwidth information.
The \f3-f\f1 option can only be used when both the \f3-R\f1 and \f3-u\f1 options
are used. It indicates that when creating the entries in the \f2\/etc/\/grio_disk\f1 file,
the RAID controller bandwidth should be split evening among all RAID luns attached to 
the controller. By default, the RAID controller bandwidth will be allocated to individual
RAID luns on a first-come, first-served basis.
The user can use the \f3\-r\f1 and \f3\-w\f1 options to specify
if device read and/or write operations should be performed.
By default only read operations will be performed on the device.
Normally, both \f3-r\f1 and \f3-w\f1 should be specifed so that the utility
uses a mix of read and write operations when determining the bandwidth characteristics.
If it is known that on the device most Guaranteed Rate I/O rate guarantees will be used 
for performing either read or write operations, then the correct option may be specified to 
obtain a more accurate bandwidth characterization for the expected workload.
The \f3-V\f1 option causes the utility to produce more verbose output.
The utililty will use these values to determine the
bandwidth performance characteristics of the device.
In the case of a single disk device, the performance characterisics of the device will
be computed.
In the case of a RAID device, the performance characteristics of the RAID controllers, 
as well as the RAID luns, will be computed.
.SH NOTES
There are a number of factors to consider when using 
.I grio_bandwidth
to determine the GRIO bandwidth characteristics of a RAID device.
First, the 
.I grio_bandwidth
utility invokes the \f3raidcli(5)\f1
utility to determine the RAID devices attached to the system.
In order to run the \f3raidcli\f1 program successfully, the
system must be a registered RAID agent.
Second, it is important to re-run the utility each time the RAID device is reconfigured.
The RAID device is a complex mechanism and configuration changes 
will have performance impact.
Morover, in order to insure that the GRIO bandwidth rate guarantees can be met even when
a RAID disk has failed, the bandwidth number must be computed when the device
is in degraded mode.
When running in degraded mode (ie. one of the disk devices in each of the RAID luns
is removed/missing), the RAID controllers on the RAID must
compute the data for the missing disk.  This will increase I/O request response
time.
.SH FILES
/etc/grio_disks
.SH SEE ALSO
ggd(1M),
grio(1M),
grio_disks(4),
grio(5),
raidcli(5),
ioconfig(1M).
