calmsacibis995/irix-6517-src/eoe/man/man1m/grio.1m
.TH grio 1M
.SH NAME
grio \- display GRIO reservation information
.SH SYNOPSIS
.nf
\f3grio\f1 [ \f3\-BCDFIPRSVa\f1] [ \f3\-d\f1 device ] [ \f3\-f\f1 file ]
	[ \f3\-s\f1 grio_stream_id] [ \f3\-v\f1 XLV_volume ]
.fi
.SH DESCRIPTION
.I grio
displays information about the active GRIO reservations and
statistics on the GRIO subsystem.
Only one of the options \f3BCDFIPRSV\f1
can be specified on a single invocation of \f2grio\f1:
.PP
.TP
.B \-B
Print information about active GRIO reservations on a given device.
Devices can be specified with the \f3\-d\f1 or \f3\-a\f1 options.
.TP
.B \-C
Print the device path and show active GRIO reservations.
Devices are specified with the \f3\-d\f1 option. This only works for disks.
Each path component reported can be fed back to grio with the -d option.
.TP
.B \-D
Delete the GRIO stream with the specified stream ID.
Stream IDs are specified with the \f3\-s\f1 option.
This option can be run only by the superuser.
.TP
.B \-F
Print the bandwidth information for all the devices in the device path of the
specified logical volume.
Logical volumes are specified with the \f3\-v\f1 option.
Each path component reported can be fed back to grio with the -d option.
.TP
.B \-I
Print GRIO command statistics.
This option is assumed by default.
.TP
.B \-P
Print GRIO device path.
Devices are specified with the \f3\-d\f1 option, and only applies to disks.
Each path component reported can be fed back to grio with the -d option.
.TP
.B \-R
Print active GRIO reservations on the specified file.
Files are specified with the \f3\-f\f1 option.
.TP
.B \-S
Print information on all active GRIO reservations.
.TP
.B \-V
Print active GRIO VOD reservation information for specified volumes.
Logical volumes are specified with the \f3\-v\f1 option.
.PP
The following options are used to specify individual devices:
.PP
.TP
.B \-a
This option specifies all real time disk devices.
.TP
.B \-d
Specifies a given device in the hwgraph name (reported by the -P, -C and
-F options) or disk alias name (/dev/rdsk/dks1d2s7) format. For example, 
.IR /dev/rdsk/dks1d2s7,
.IR /hw/module/1/slot/io1/baseio/pci/0/scsi_ctlr/0/target/4/lun/0/disk,
.IR /hw/module/1/slot/n1/node/xtalk/0/xbow .
.TP
.B \-f
Specifies a given XFS realtime file, for example
.IR /xfs1/realtime .
.TP
.B \-s
Specifies a GRIO stream by the stream ID, for example,
03e4518e-3ec2-101e-884c-080069027409.
.TP
.B \-v
Specifies an XLV volume, for example,
.IR /dev/xlv/xlv_1 .
.SH FILES
.nf
/etc/grio_disks
.fi
.SH SEE ALSO
ggd(1M),
grio_disks(4),
grio(5).
.SH NOTES
To make grio more secure, 
.I grio 
has to be run with the priviledge of CAP_DEVICE_MGMT or as root.
