calmsacibis995/irix-6517-src/eoe/man/man1m/growfs.1m
'\"! tbl | mmdoc
'\"macro stdmacro
.nr X
.if \nX=0 .ds x} growfs 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
growfs \- expand a filesystem
.SH SYNOPSIS
.nf
\f3growfs\f1 [\f3\-s\f1 size] special
.fi
.SH DESCRIPTION
.I growfs
expands an existing Extent Filesystem, see
.IR efs (4).
The
.I special
argument is the pathname of the device special file where the filesystem
resides.
The filesystem must be unmounted to be grown, see
.IR umount (1M).
The existing contents of the filesystem are undisturbed, and the added space
becomes available for additional file storage.
.PP
If a
.BI "\-s " size
argument is given, the filesystem is grown to occupy
.I size
basic blocks of storage (if available).
.PP
If no
.I size
argument is given, the filesystem is grown to occupy all the space
available on the device.
.PP
.I growfs
is most often used in conjunction with
logical volumes;
see
.IR lv (7M)
and
.IR xlv (7M).
However, it can also be used on a regular disk partition, for example, when a
partition has been enlarged while retaining the same starting block.
.PP
To grow XFS filesystems, use the
.IR xfs_growfs (1M)
command.
.SH PRACTICAL USE
Filesystems normally occupy all of the space on the device where they
reside.
In order to grow a filesystem, it is necessary to provide added
space for it to occupy.
Therefore there must be at least one spare new
disk partition available.
.PP
Adding the space is done through the mechanism of
logical volumes.
.PP
If the filesystem already resides on a logical volume, the volume is simply
extended using
.IR mklv (1M).
.PP
If the filesystem is currently on a regular partition, it is necessary to
create a new logical volume whose first member is the existing partition,
with subsequent members being the new partitions to be added.
Again,
.I mklv
is used for this.
.PP
In either case
.I growfs
is run on the logical volume device, and the expanded filesystem is
available for use on the logical volume device.
.SH DIAGNOSTICS
.I growfs
expands only clean filesystems.
If any problem is detected with the
existing filesystem, the following error message is printed:
.Ex
growfs: filesystem on <special> needs cleaning.
.Ee
If a
.I size
argument is given,
.I growfs
checks that the specified amount of space is available on the device.
If not,
it prints the error message:
.Ex
growfs: cannot access <size> blocks on <special>.
.Ee
.I growfs
works in units of the cylinder group size in the existing filesystem.
To
usefully expand the filesystem there must be space for at least one new
cylinder group.
Failing this, it prints the error message:
.Ex
growfs: not enough space to expand filesystem.
.Ee
.SH COMPATIBILITY NOTE
.I growfs
can expand a filesystem from any IRIX release, and filesystems can be expanded
repeatedly.
However, once a filesystem has been grown, it is NOT possible to
mount it on an IRIX system earlier than release 3.3, and a pre-3.3 \f2fsck\f1
does not recognize it.
.SH SEE ALSO
mkfs(1M),
mklv(1M),
xfs_growfs(1M),
lv(7M),
xlv(7M).
