calmsacibis995/irix-6517-src/eoe/man/man1m/grpck.1m
.nr X
.if \nX=0 .ds x} grpck 1M "System Administration Utilities" "\&"
.TH \*(x}
.SH NAME
grpck \- group file checker
.SH SYNOPSIS
.nf
\f3grpck\f1 [ \f2file\f1 ]
.fi
.SH DESCRIPTION
.I grpck
verifies all entries in the group file,
.IR file .
This verification
includes a check of: the number of fields, group name,
group ID, whether all login names appear in the
password file, duplicate logname entries, and maximum
number of groups per logname.
The default group file is
.IR /etc/group .
.PP
.I grpck
has the ability to parse YP entries in the group file.
.SH FILES
/etc/group
.SH SEE ALSO
group(4),
passwd(4).
.SH DIAGNOSTICS
.TP
\f4Too many/few fields\f1
An entry in the group file does not have the proper number of
fields.
.TP
\f4No group name\f1
The group name field of an entry is empty.
.TP
\f4Bad character(s) in group name\f1
The group name in an entry contains characters that are
unprintable (see
.IR isprint (3C)).
.TP
\f4Invalid GID\f1
The group
ID
field in an entry is not numeric or is less than 0 or greater than 65535.
.TP
\f4Null login name\f1
A login name in the list of login names in an entry is null.
.TP
\f4Login name not found in password file\f1
A login name in the list of login names in an entry is not in the
password file.
.TP
\f4Duplicate logname entry\f1
A login name in the list of login names has already been assigned
to that group, either by a previous group with the same group
ID
or the default group that was set in the password file or
the login name is in the same group entry multiple times.
.TP
\f4Maximum groups exceeded for logname\f1
Number of groups assigned to single login name has been exceeded
(See
.IR sysconf (1)
- NGROUPS_MAX).
.TP
\f4Out of memory\f1
Failure to malloc memory.
