calmsacibis995/irix-6517-src/eoe/man/man1m/hinv.1m
.TH hinv 1M
.SH NAME
hinv \- hardware inventory command
.SH SYNOPSIS
.nf
\f3hinv\f1 [\f3\-v\f1] [\f3\-s\f1] [\f3\-m\f1] [\f3\-c\f1 class] [\f3\-t\f1 type] \c
[\f3\-d\f1 dev] [\f3\-u\f1 unit]
.fi
.SH DESCRIPTION
.I hinv
displays the contents of the system hardware inventory table.
This table is created each time the system is booted and contains
entries describing various pieces of hardware in the system.
The items in the table include main memory size, cache sizes,
floating point unit, and disk drives.
Without arguments, the
.I hinv
command displays a one line description of each entry in the table.
.PP
In addition, on some systems hinv can display manufacturing information 
such as board name, part number and barcode number.  
.PP
The
.I hinv
options are:
.TP 11
.B \-v
Gives a more verbose description of some items in
the table.
.TP
.BI \-c " class"
Displays items from
.IR class .
.I classes
are
.BR processor ,
.BR disk ,
.BR memory ,
.BR serial ,
.BR parallel ,
.BR tape ,
.BR graphics ,
.BR network ,
.BR scsi ,
.BR audio ,
.BR iobd ,
.BR video ,
.BR bus ,
.BR misc ,
.BR compression ,
.BR vscsi ,
and
.BR display .
.TP
.BI \-t " type"
Displays items from
.IR type .
.I types
are
.BR cpu ,
.BR fpu ,
.BR dcache ,
.BR icache ,
.BR memory ,
.BR qic ,
.BR a2 ,
and
.BR dsp .
.TP
.B \-s
When used with either the
.B \-c
or
.B \-t
options,
.B \-s
suppresses output.
.TP
.BI \-d " dev"
Restricts the output to
a kind of device among those currently present in the system.
The devices that currently support this option are
.BR cdsio ,
.BR aso ,
.BR ec ,
.BR et ,
.BR ee ,
.BR enp ,
.BR fxp ,
.BR ep ,
.BR gsn ,
.BR hy ,
.BR ipg ,
.BR xpi ,
.BR fv ,
.BR gtr ,
.BR mtr ,
.BR hippi ,
.BR myri ,
and
.BR atm .
.TP
.BI \-u " unit"
Requests information for a single device unit number for a kind of
device specified with
.BR \-d .
.TP
.BI \-m
Displays physical manufacturing information: board name, part number and barcode
number.  When the
.B \-v
flag is used in combination with
.BI \-m
the physical location of each board as a path under /hw is
also displayed, see hwgraph(4D) for an explanation of the path. 
.PP
The
.I hinv
command, when used with
the
.B \-c
or
.B \-t
options, exits with a value of 1 if no item of the specified class
or type is present in the hardware inventory table.
Otherwise,
.I hinv
exits
with a value of 0.
.SH NOTE
For many devices, the device will not be displayed in the
inventory if the corresponding driver is not configured into IRIX.
.SH SEE ALSO
lboot(1M),
ioconfig(1M),
scsiha(1M),
getinvent(3),
hwgfs(4).
