calmsacibis995/irix-6517-src/eoe/man/man1m/id.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1990, 1989 AT&T
.TH id 1M
.SH NAME
\f4id\f1 \- print the user name and ID, and group name and ID
.SH SYNOPSIS
.nf
\f4id\f1 [\f4\-aM\f1]
\f4id\f1 \f4\-G\f1 [\f4\-n\f1] [user]
\f4id\f1 \f4\-g\f1 [\f4\-nr\f1] [user]
\f4id\f1 \f4\-u\f1 [\f4\-nr\f1] [user]
.fi
.SH DESCRIPTION
\f4id\f1
displays the calling process's ID and name.
It also displays the group ID and name.
If the real and
effective IDs do not match, both are printed.
.TP
\f2user\fP
The login name for which the information is to be
reported.
.TP
\f4-a\fP
Report all the groups to which the
invoking process belongs.
.TP
\f4-g\fP
Reports the effective group ID, using the format
\f3"%u\\n"\fP.
.TP
\f4-G\fP
Report all the groups to which the
invoking process belongs.
.TP
\f4-M\f1
If mandatory access control (MAC) is enabled the \f4-M\fP option reports the
MAC
label at which the invoking process is running.
If
MAC
is not enabled the option is ignored.
.TP
\f4-P\fP
Reports the capability set of the invoking process.
.TP
\f4-n\fP
Reports the name in the format \f3"%s"\fP instead of the
numeric ID using the format \f3"%u"\fP.
.TP
\f4-r\fP
Reports the real ID instead of the effective ID.
.TP
\f4-u\fP
Reports the effective user ID, using the format
\f3"%u\\n"\fP.
.SH FILES
.ta 28
/etc/passwd	system password file
.br
/etc/group	system group file
.br
/etc/mac	MAC label definition file
.SH SEE ALSO
logname(1),
multgrps(1),
newgrp(1),
getgroups(2),
getuid(2),
setgroups(2),
initgroups(3C).
