calmsacibis995/irix-6517-src/eoe/man/man1m/idbg.1m
.TH idbg 1M
.SH NAME
idbg \- kernel debugger print utility
.SH SYNOPSIS
.nf
\f3idbg\f1 [ \f3\-r\f1 file ]
.fi
.SH DESCRIPTION
.I idbg
allows the superuser to invoke a number of internal kernel routines
that provide useful debugging information.
The
.B \-r
option provides a record of the output to the given file.
The kernel routines are part of the
.I idbg
kernel module,
which can be either dynamically loaded or statically configured into
the kernel.
.P
The
.I ml
command can be used to dynamically load the idbg.o module into
a running kernel without reconfiguring and rebooting the kernel:
.Ex
\f4ml ld -i /var/sysgen/boot/idbg.o -p idbg\f1
.Ee
Note that functional pieces of the idbg.o module have been broken into
separate modules, such as xfsidbg.o, xlvidbg.o, and so on.
It may be necessary
to also include these modules when either statically configuring idbg.o
into the kernel or dynamically loading it, depending on your kernel
configuration.
For example:
.Ex
\f4ml ld -i /var/sysgen/boot/idbg.o -p idbg\f1
.sp .8v
\f4ml ld -i /var/sysgen/boot/xfsidbg.o -p xfsidbg\f1
.sp .8v
\f4ml ld -i /var/sysgen/boot/xlvidbg.o -p xlvidbg\f1
.Ee
Statically configuring the idbg.o module into the kernel involves editing
of the
.I /var/sysgen/system/irix.sm
file;
see the comments in this file on how to do so.
See
.IR lboot (1M)
for details on reconfiguring the kernel.
See
.IR ml (1M)
and
.IR mload (4)
for details about dynamically loadable kernel modules.
.P
A list of the routines available is displayed by simply typing a
carriage return at the
.B idbg>
prompt.
A more verbose listing can be obtained by typing
.B ??
at the prompt.
A routine is invoked by simply typing its name,
followed by an optional argument.
This list is highly subject to change from release to release.
A few of the current routines available are described below.
.TP 27
\f3plist\f1 [ \f2pid\f1 ]
If no \f2pid\f1 is given,
a list of currently active processes is displayed,
including the process slot number, pid, name, and status.
If a \f2pid\f1 is given,
the process table slot number is output.
The value is useful as an argument for other routines.
.TP
\f3ubt\f1 \f2process_slot_number\f1
A kernel stack backtrace for the given process is output.
This backtrace is not valid for runnable/running processes.
.TP
\f3proc\f1 \f2process_slot_number\f1
Gives a more complete printout of the process table entry for
the given process.
.TP
\f3user\f1 \f2process_slot_number\f1
Gives a printout of the \f2user\f1 area corresponding to the given
process.
.SH "DIAGNOSTICS"
.TP
\f4kernel debugger not configured\f1
The operating system debugger module
.I idbg
is not included in the running kernel.
