calmsacibis995/irix-6517-src/eoe/man/man1m/ifconfig.1m
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)ifconfig.1m	6.4 (Berkeley) 5/22/86
.\"
.nr X
.if \nX=0 .ds x} ifconfig 1M "Silicon Graphics" "\&"
.TH \*(x}
.SH NAME
ifconfig \- configure network interface parameters
.SH SYNOPSIS
.nf
\f3/usr/etc/ifconfig\f1 [ \f3-v\f1 ] \f2interface address_family\f1 [ \f2address\f1 [ \c
\f2dest_address\f1 ] ]
	[ \f2parameters\f1 ]
\f3/usr/etc/ifconfig\f1 \f2interface\f1 [ \f2protocol_family\f1 ]
\f3/usr/etc/ifconfig\f1 [ \f3-v\f2 ] \f2-a\f1
.fi
.SH DESCRIPTION
.I ifconfig
is used to assign an address
to a network interface and/or configure
network interface parameters.
.I ifconfig
is invoked at boot time from
.I /etc/init.d/network
to define the network address
of each interface present on a machine;
you can also use it once the system is up
to redefine an interface's address
or other operating parameters.
The
.I interface
parameter is a string of the form ``name unit'', for example, \f3enp0\f1.
Using the 
.B -a
option shows status for all interfaces on the machine.
.LP
If specified, the
.B -v
option causes additional information about specified interfaces to be
displayed, including speed.
.LP
Since an interface can receive transmissions in differing protocols,
each of which may require separate naming schemes, it is necessary
to specify the
.IR address_family ,
which can change the interpretation of the remaining parameters.
Currently, just the ``inet'' address family is supported.
.LP
For the Internet family,
the address is either
an Internet address expressed in the Internet standard
``dot notation'' (see
.IR inet (3N)),
or a hostname present in the
.IR hosts (4)
file,
.IR /etc/hosts .
(Other
.I hosts
databases, such as
.I named
and NIS, are ignored.)
.PP
Only the superuser can modify the configuration of a network interface.
.PP
The following parameters can be set with
.IR ifconfig :
.TP 15
.B up
Mark an interface \f3up\f1.
This can be used to enable an interface after an \f3ifconfig down\f1.
It happens automatically when setting the first address on an interface.
If the interface was reset when previously marked down,
the hardware is reinitialized.
.TP 15
.B down
Mark an interface \f3down\f1.
When an interface is
marked \f3down\f1, the system does not attempt to
transmit messages through that interface.
If possible, the interface is reset to disable reception as well.
This action does not automatically disable routes using the interface.
.TP 15
.B arp
Enable the use of the Address Resolution Protocol in mapping
between network level addresses and link level addresses (default).
It is used by a variety of data link network interfaces such as
Ethernet.
.TP 15
.B \-arp
Disable the use of the Address Resolution Protocol.
.TP 15
.BI alias " addr"
Establish an additional network address for this interface.
This can be useful in permitting a single physical interface to accept
packets addressed to several different addresses such as when you are
changing network numbers and you wish to accept packets addressed
to the old interface.
Another case is when you'd like to have multiple
addresses assigned to a single network interface.
The \f3broadcast\f1
and \f3netmask\f1 options can also be used in conjunction with the
\f3alias\f1 option.
When using aliases you may have to change the configuration of \f2routed\f1,
especially if aliases are on different networks than the primary address.
Aliases are added as host entries in the routing tables for \f2routed\f1.
See
.IR routed (1M)
for more information on this.
.TP 15
.BI \-alias \f1| delete " addr"
Deletes a previously added alias.
.TP 15
.BI metric " n"
Set the routing metric of the interface to
.IR n ,
default 0.
The routing metric is used by the routing protocol
.RI ( routed ).
Higher metrics have the effect of making a route
less favorable; metrics are counted as addition hops
to the destination network or host.
.TP 15
.BI netmask " mask"
Specify how much of the address to reserve for subdividing
networks into subnetworks.
The mask includes the network part of the local address
and the subnet part, which is taken from the host field of the address.
The mask can be specified as a single hexadecimal number
with a leading 0x, with a dot-notation Internet address,
or with a pseudo-network name listed in the network table
.IR networks (4).
The mask contains 1's for the bit positions in the 32-bit address
that are to be used for the network and subnet parts,
and 0's for the host part.
The mask should contain at least the standard network portion,
and the subnet field should be contiguous with the network
portion.
.TP 15
.BI broadcast " addr"
Specify the address to use to represent broadcasts to the
network.
The default broadcast address is the address with a host part of all 1's.
.TP 15
.I dest_addr
Specify the address of the correspondent on the other end
of a point-to-point link.
.TP 15
.B debug
Enable driver-dependent debugging code; usually, this turns on
extra console error logging.
.TP 15
.B \-debug
Disable driver-dependent debugging code.
.TP 15
.B link{0,1,2}
Enable driver-specific feature 0-2.
.TP 15
.B \-link{0,1,2}
Disable driver-specific feature 0-2.
.TP 15
.B primary
This parameter makes the specified interface the primary interface for
networking.  In cases where no interface or interface address
is specified by an application, the 'primary' interface will be preferred.
.TP 15
.BI rspace " value"
Specifies the default receive space used by TCP when communicating over the
interface.  Use a value of 0 to clear this parameter and use the system-wide
default.
.TP 15
.BI sspace " value"
Specifies the default send space used by TCP when communicating over the
interface.  Use a value of 0 to clear this parameter and use the system-wide
default.
.PP
.I ifconfig
displays the current configuration for a network interface
when no optional parameters are supplied.
If a protocol family is specified,
.I ifconfig
reports only the details specific to that protocol family.
.SH NOTES
Network interfaces on Silicon Graphics systems can only receive and
not send packets that use ``trailer'' link-level encapsulation.
Therefore,
.I ifconfig
does not accept the
.B trailers
parameter.
.PP
For 100baseTX interfaces, such as 'ef', LINK0 being set indicates that the
device is operating at full-duplex.  It is not currently possible to force
full- or half-duplex by setting or clearing this flag.
.PP
Currently options such as 'metric' are not handled for IP aliases; adjusting
the metric will affect only the primary address.  'broadcast' and 'netmask'
are the only options currently known to work properly with IP aliases.
.SH DIAGNOSTICS
Messages indicating the specified interface does not exist, the
requested address is unknown, or the user is not privileged and
tried to alter an interface's configuration.
.SH "FILES"
.PD 0
.TP 33
/etc/hosts
host-address database
.TP
/etc/config/ifconfig-\f2?\fP.options
site-specific options (1 file per interface)
.TP
/etc/config/ipaliases.options
interface-specific ip alias addresses
.PD
.SH "SEE ALSO"
netstat(1),
network(1M).
