calmsacibis995/irix-6517-src/eoe/man/man1m/iflabel.1m
'\"macro stdmacro
.\"
.\"	@(#)iflabel.1m	
.\"
.if n .pH man1.iflabel @(#)iflabel	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} IFLABEL 1M "" "\&"
.if \nX=1 .ds x} IFLABEL 1M ""
.if \nX=2 .ds x} IFLABEL 1M "" "\&"
.if \nX=3 .ds x} IFLABEL "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
iflabel \- configure network interface attributes
.SH SYNOPSIS
.B /usr/etc/iflabel
.I "interface [args]"
.SH DESCRIPTION
.I iflabel
is used to assign the security attributes of
a network interface.  These include
minimum, maximum, and default sensitivity and 
integrity and default uid.
.I iflabel
is invoked at boot time from 
.I /etc/init.d/network
to set the attributes
of each interface present on the machine
to the values specified in the corresponding
.I /etc/config/iflabel-?.options
file.
The administrator may also use it once the system is up
to redefine an interface's security attributes.
The best way to do this is to edit the
.I /etc/config/iflabel-?.options
file, then use the script
.I /etc/init.d/network
to stop and restart the network.
The
.I interface
parameter is a string of the form ``name unit'', e.g., ``ec0''.
(The 
.I \-i 
option to
.IR netstat (1)
lists the interfaces on the machine.)
.PP
Only a user with CAP_NETWORK_MGT capability may modify the security
attributes of a network interface.
.PP
Here is a sample iflabel-1.options file:
.RS 5
.sp
attributes=msen,mint,uid 
.br
min_msen=msenlow 
.br
max_msen=msenhigh 
.br
min_mint=minthigh 
.br
max_mint=mintlow 
.br
dflt_msen=msentcsec,unclassified 
.br
dflt_mint=mintbiba,lowestgrade 
.br
dflt_uid=guest 

.RE
.SH "FILES"
.TP
/etc/config/iflabel-\f2?\fP.options
site-specific options (1 file per interface)
.SH "SEE ALSO"
dominance(5),
mac_to_text(3C),
mlsfiles(4),
netstat(1),
rhost(1m),
samp(7p),
satmp(7p),
satmpd(1m),
trusted_networking(7),
tsix(7p).
.\".so /pubs/tools/origin.bsd
