calmsacibis995/irix-6517-src/eoe/man/man1m/installf.1m
'\"macro stdmacro
.if n .pH g1a.installf @(#)installf	41.11 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} installf 1M "Essential Utilities" "\&"
.if \nX=1 .ds x} installf 1M "Essential Utilities"
.if \nX=2 .ds x} installf 1M "Essential Utilities" "\&"
.if \nX=3 .ds x} installf "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
\f4installf\f1 \- add a file to the software installation database
.SH SYNOPSIS
\f4installf \f1[\f4-c \f2class\f1] \f2pkginst pathname\f1 [\f2ftype\f1 [[\f2major minor\f1]
.br
	[\f2mode owner group\f1]]] \" [\f2mac fixed inherited\f1]]
.sp .5
\f4installf \f1[\f4-c \f2class\f1] \f2pkginst\f4 -
.sp .5
\f4installf -f \f1[\f4-c \f2class\f1] \f2pkginst\f1
.SH DESCRIPTION
\f4installf\f1 informs the system that
a pathname not listed in the \f4pkgmap\f1 file is being created or modified.
It should be invoked before any file modifications have occurred.
.P
When the second synopsis is used, the pathname descriptions will be read
from standard input.
These descriptions are the same as would be given in
the first synopsis but the information is given in the form of a list.
(The descriptions should be in the form:
\f2pathname \f1[\f2ftype\f1 [[\f2major minor\f1] [\f2mode owner group\f1]]].)
\"
\"
\"\f2pathname \f1[\f2ftype\f1 [[\f2major minor\f1] [\f2mode owner group\f1] [\f2mac fixed inherited\f1]].)
\"
.P
After all files have been appropriately created and/or modified,
\f4installf\f1
should be invoked with the \f4-f\f1 synopsis to indicate that installation
is final.
Links will be created at this time and,
if attribute information for a pathname was not specified during the 
original invocation of \f4installf\f1
or was not already stored on the system,
the current attribute values for the pathname will be stored.
Otherwise,
\f4installf\f1 verifies that attribute values match those given on the command
line, making
corrections as necessary.
In all cases, the current content information
is calculated and stored appropriately.
.TP 10
\f4-c \f2class\f1
Class to which installed objects should be associated.
Default class is \f4none\f1.
.P
.TP 10
\f2pkginst\f1
Name of package instance with which the pathname should be associated.
.TP 10
\f2pathname\f1
Pathname that is being created or modified.
Special characters, such as an equal sign (\f4=\fP),
are included in pathnames 
by surrounding the entire pathname in single quotes
(as in, for example, \f4'/usr/lib/~='\f1).
When a pathname is specified on a shell command line,
the single quotes must be preceded by backslashes
so they're not interpreted by the shell.
.TP 10
\f2ftype\f1
A one-character field that indicates the file type.
Possible file types include:
.P
.PD0
.RS 14
.TP .35i
\f4f\f1
a standard executable or data file
.TP .35i
\f4e\f1
a file to be edited upon installation or removal
.TP .35i
\f4v\f1
volatile file (one whose contents are expected to change)
.TP .35i
\f4d\f1
directory
.TP .35i
\f4x\f1
an exclusive directory
.TP .35i
\f4l\f1
linked file
.TP .35i
\f4p\f1
named pipe
.TP .35i
\f4c\f1
character special device
.TP .35i
\f4b\f1
block special device
.TP .35i
\f4s\f1
symbolic link
.RE
.PD
.TP 10
\f2major\f1
The major device number.
The field is only specified for block
or character special devices.
.TP 10
\f2minor\f1
The minor device number.
The field is only specified for block
or character special devices.
.TP 10
\f2mode\f1
The octal mode of the file (for example, 0664).
A question mark (?)
indicates that the mode will be left unchanged, implying
that the file already exists on the target machine.
This field is not used for linked or symbolically linked files.
.TP 10
\f2owner\f1
The owner of the file (for example, \f4bin\f1 or \f4root\f1).
The field is limited to
14 characters in length.
A question mark (?)
indicates that the owner will be left unchanged, implying
that the file already exists on the target machine.
This field is not used for linked or symbolically linked files.
.TP 10
\f2group\f1
The group to which the file belongs (for example, \f4bin\f1 or \f4sys\f1).
The field is limited to 14 characters in length.
A question mark (?) indicates that the group will be left unchanged, implying
that the file already exists on the target machine.
This field is not used for linked or symbolically linked files.
\".TP 10
\"\f2mac\f1
\"The Mandatory Access Control (MAC) Level Identifier
\"(LID), an integer value that specifies a combination
\"of a hierarchical classification and zero or more
\"non-hierarchical categories.
\"A question mark (\f4?\f1) indicates that the mac
\"field will be left unchanged, implying that the
\"file already exists on the target machine.
\"This field can only be applied to a file on a
\"sfs-type file system and is not used for linked
\"files or packaging information files.
\".IP
\"If the mac attribute is not supplied,
\"and the target file system is of type \f4sfs\fP, then files are
\"installed at the \f4USER_PUBLIC\fP MAC level.
\".TP 10
\"\f2fixed\f1
\"A comma separated list of valid mnemonic fixed
\"privilege names as defined for the \f4filepriv\f1
\"command.
\"The string \f4NULL\f1 is used in place of the
\"comma separated list when privilege is not to
\"be specified.
\"A question mark (\f4?\f1) indicates that the fixed
\"field will be left unchanged, implying that the
\"file already exists on the target machine.
\"If the fixed attribute is not supplied,
\"then files are installed with no fixed privileges.
\"This field is not used for linked files or
\"packaging information files.
\".TP 10
\"\f2inherited\f1
\"A comma separated list of valid mnemonic inherited
\"privilege names as defined for the \f4filepriv\f1
\"command.
\"The string \f4NULL\f1 is used in place of the
\"comma separated list when privilege is not to
\"be specified.
\"A question mark (\f4?\f1) indicates that the inherited
\"field will be left unchanged, implying that the file
\"already exists on the target machine.\p
\".br
\".ne 4
\"If the inherited attribute is not supplied,
\"then files are installed with no inheritable privileges.
\"This field is not used for linked files or
\"packaging information files.
.TP 10
\f4-f\f1
Indicates that installation is complete.
This option is used with the final invocation of \f4installf\f1
(for all files of a given class).
.SH NOTES
When \f2ftype\f1 is specified,
all applicable fields,
as shown below, must be defined:
.RS
.TS
cf2 cf2
lf4 lf4.
ftype	Required Fields
p x d f v \f1or\f4 e	mode owner group
c \f1or\f4 b	major minor mode owner group
.TE
.RE
.sp
.ig
.P
.tr ~
.PD 0
.TP 10
FTYPE
REQUIRED FIELDS
.P
.TP 10
p, x, d
\f4mode  owner  group\f1
.TP 10
f, v, or e
~
.P
.TP 10
c  or  b
\f4major  minor\f1
.TP 10
~
\f4mode  owner  group\f1
.PD
..
.P
The \f4installf\f1 command will create directories, named pipes and special
devices on the original invocation.
Links are created
when \f4installf\f1 is invoked with the \f4\-f\f1 option to indicate
installation is complete.
.P
Links should be specified as \f2path1\f4=\f2path2\f1.
\f2path1\f1 indicates the destination and \f2path2\f1 indicates the source file.
.P
For symbolically linked files, 
\f2path2\fP can be a relative pathname,
such as \f4./\fP or \f4../\fP.
For example, if you enter a line such as
.IP
\f4s /foo/bar/etc/mount=../usr/sbin/mount\f1
.PP
\f2path2\fP (\f4/foo/bar/etc/mount\fP)
will be a symbolic link to \f4../usr/sbin/mount\f1.
.P
Files installed with \f4installf\f1 will be placed
in the class \f2none\f1, unless a
class is defined with the command.
Subsequently, they will be removed
when the associated package is deleted.
If this file should not be deleted
at the same time as the package, be certain to assign it to a class which is
ignored at removal time.
If special action is
required for the file before removal, a class must be defined with
the command and an appropriate class action script delivered with the package.
.P
When classes are used, \f4installf\f1 must be used as follows:
.sp .5
.RS .25i
\f4installf -c class1 . . .
installf -f -c class1 . . .
installf -c class2 . . .
installf -f -c class2 . . .  \f1
.RE
\".P
\"MAC levels (\f4mac\fP) are always installed on \f4sfs\fP file
\"systems, but affect
\"access checking only if the Enhanced Security Utilities are installed
\"and running.
\".P
\"Fixed and inheritable privileges (\f4fixed\fP and \f4inherited\fP) on
\"files, if present, are always installed.
\"When a file with fixed privileges is executed, the fixed privileges
\"are propagated to the new process by both the SUM and LPM privilege
\"modules;  inheritable privileges are only propagated by the LPM
\"privilege module.
\"The LPM privilege module is included in the Enhanced Security
\"Utilities.
.SH EXAMPLE
The following example shows the use of \f4installf\f1 invoked from
an optional preinstall or postinstall script:
.br
.ne 4i
.P
.nf
.ft 4
#create /dev/xt directory
#(needs to be done before drvinstall)
installf $PKGINST /dev/xt d 755 root sys ||
	exit 2
majno=`/usr/sbin/drvinstall \-m /etc/master.d/xt
     \-d $BASEDIR/data/xt.o \-v1.0` ||
	exit 2
i=00
while [ $i \-lt $limit ]
do
\ \ for j in 0 1 2 3 4 5 6 7
\ \ do
\ \ \ \ echo /dev/xt$i$j c $majno `expr $i \(** 8 + $j` 644 root sys
\ \ \ \ echo /dev/xt$i$j=/dev/xt/$i$j 
\ \ done
\ \ i=`expr $i + 1`
\ \ [ $i \-le 9 ] && i="0$i" #add leading zero
done | installf $PKGINST - || exit 2
# finalized installation, create links
installf \-f $PKGINST || exit 2
.fi
.SH SEE ALSO
.na
\f4pkgadd\f1(1M),
\f4pkgask\f1(1M),
\f4pkgchk\f1(1),
\f4pkginfo\f1(1),
\f4pkgmk\f1(1),
\f4pkgparam\f1(1),
\f4pkgproto\f1(1),
\f4pkgtrans\f1(1),
\f4pkgrm\f1(1M),
\f4removef\f1(1M)
.ad
