calmsacibis995/irix-6517-src/eoe/man/man1m/intro.1m
.nr X
.if \nX=0 .ds x} intro 1M ""  "\&"
.TH \*(x}
.SH NAME
intro \- introduction to maintenance commands and application programs
.SH DESCRIPTION
This section describes, in alphabetical order, commands
that are used chiefly for system maintenance and administration purposes.
.SH COMMAND SYNTAX
Since almost all commands are run via the shells (
.IR bsh (1), sh (1), csh (1),
.IR ksh (1), and\ tcsh(1))
diagnostic messages may be issued by the shells, prior to, or even
instead of, the command itself being executed.  A common case is
too many arguments to the command.  See the manual page
for your shell for details.
.PP
Unless otherwise noted, commands described in this section accept options and
other arguments according to the following syntax:
.PP
.I name
.RI [ options ]
.RI [ cmdargs ]
.PP
where:
.TP 14
.I name
The name of an executable file.
.TP
.I option
.BI \- noargletter
or
.BI \- "argletter<>optarg"
where <> is optional white space.
.TP
.I noargletter
A single letter representing an option without an argument.
.TP
.I argletter
A single letter representing an option requiring an argument.
.TP
.I optarg
Argument (character string) satisfying preceding
.IR argletter .
.TP
.I cmdarg
Pathname (or other command argument)
.I not
beginning with
.B \-
or
.B \-
by itself indicating the standard input.
.SH SEE ALSO
getopt(1),
exec(2),
exit(2),
wait(2),
getopt(3C).
.SH DIAGNOSTICS
Upon termination, each command returns two bytes of status,
one supplied by the system and giving the cause for
termination, and (in the case of ``normal'' termination)
one supplied by the program
(see
.IR wait (2)
and
.IR exit (2)).
The former byte is 0 for normal termination; the latter
is customarily 0 for successful execution and non-zero
to indicate troubles such as erroneous parameters, bad or inaccessible data,
or other inability to cope with the task at hand.
It is called variously exit code, exit status, or
return code, and is described only where special
conventions are involved.
.SH BUGS
Regrettably, not all commands adhere to the aforementioned syntax.
