calmsacibis995/irix-6517-src/eoe/man/man1m/ioconfig.1m
.TH ioconfig 1M
.SH NAME
ioconfig \- configure I/O devices
.SH SYNOPSIS
.nf
\f3ioconfig\f1 [\f3\-d\f1]  \f3\-f\f1 starting_directory
.fi
.SH DESCRIPTION
.I ioconfig
assigns logical controller numbers
to all devices in the I/O subsystem.
It is run as a part of the
.I /etc/bcheckrc
startup script.
.I ioconfig
walks the
.I /hw
hardware graph tree
and assigns a unique and persistent logical controller number
to each physical device found.
.PP
The options are:
.TP
.B \-d
Enable debugging messages.
.TP
.BI "\-f " starting_directory
Specify the root
of the hardware graph tree.
.PP
.I ioconfig
attempts to match each device found as it walks the
.I /hw
hardware graph tree
with an entry in
.IR /etc/ioconfig.conf .
For each device found,
if there is a match,
.I ioconfig
assigns the logical controller number specified for the device in
.I /etc/ioconfig.conf
to the device.
If there is no match,
.I ioconfig
assigns a logical controller number.
This logical controller number is the next number that is available to
devices in that class of device.
(Device classes include SCSI, tty, and the various network devices
among others.)
The assigned logical controller number and the device are added to
.IR /etc/ioconfig.conf .
The format of an entry in
.I /etc/ioconfig.conf
is:
.Ex
\f4\<logical controller number> <canonical name of the physical device>\f1
.Ee
Some examples are:
.Ex
1 /hw/module/2/slot/n1/node/xtalk/0/pci/2/ef
3 /hw/module/2/slot/n1/node/xtalk/0/pci/1/scsi_ctlr/0
3 /hw/module/2/slot/n1/node/xtalk/0/pci/3/tty/1
.Ee
In this example a tty controller and a SCSI controller
have the same logical number.
This is possible because they are in different classes.
Within each class, each physical device has a unique logical
controller number.
These logical controller numbers are not unique across all classes.
.PP
Because controller numbers,
once allocated,
are persistent
across reboots and physical hardware configuration changes,
adding a new device or removing an existing device does not effect
the assigned controller number of other devices.
Editing or removing
.I /etc/ioconfig.conf
erases controller numbering history
and results in a reallocation of controller numbers for all devices found.
.PP
.I ioconfig
reads permissions from
.I /etc/ioperms
to set the ownership and permissions for I/O devices.
This is done after the
devices have been assigned their logical numbers.
Comment lines begin with the character
.B #
and the wild card characters \f3*\f1 are allowed in the device names.
The format of an entry for a device in the permissions file is:
.Ex
\f4<device_name> <permissions> <owner_name> <group_name>\f1
.Ee
Some examples are:
.Ex
/dev/console 0644 root sys
/dev/input/* 0644 root sys		
.Ee
.PP
.I Ioconfig 
scans 
.I /var/sysgen/ioconfig
directory to check for any device specific files.
Comment lines in these files start with a pound character.
Format of an entry of these files is:
.Ex
\f4<class> <type> <state> <generic> <suffix> <pattern> <start_num> <ioctl_num>\f1
.Ee
Some examples are:
.Ex
#1. Entry for tty device
#
#   INV_SERIAL 	INV_IOC3_DMA 	IGNORE 	  "d" 	"tty" 	2   SIOC_MKHWG
#							   ('z' << 8 | 15)
	4	16		-1	   d   	tty  	2   0x7a05 	
.Ee
.Ex
#2. Entry for mouse device
#
#   INV_MISC    INV_MISC_PCKM    MS       IGNORE  IGNORE  2        IGNORE
#
     	14       1               0          -1      -1    2       -1
.Ee
.PP
.Ex
<type> 	can be -1 if the <class> itself is enough to uniquely 
		identify the device
<state> 	can be -1 if <class> & <type> uniquely identify the device
<suffix>	can be -1 in which case ioconfig ignores it
<pattern> can be -1 in which case ioconfig takes the basename of the 
		canonical name of the device that it is looking at
<ioctl> 	can be -1 in which case ioconfig doesnot make the devicedriver
	 	specific ioctl
.Ee
.PP
For a particular device the more generic entries should appear first in 
the corresponding device file.
.Ex
Eg:- For a network device consider the entries
 	<class>		<type>		<state>
<e1> INV_NETWORK  	IGNORE 		IGNORE	.......	
<e2> INV_NETWORK	INV_ETHER_EF	IGNORE	.......
.Ee
.PP
Since <e2> is more specific than <e1> in the sense that <type> is also
specified <e1> MUST appear before <e2> for <e2> to have any effect.
.SH ERROR MESSAGES
.PD 0
.TP 21
\f3Persistent ctlr num (#1) different from hwgraph ctlr num (#2) for <hwg_name>\f1
The recommended action in this case is to REMOVE the line corresponding to  <hwg_name>  from \f2etc/ioconfig.conf \f1 file.
.SH FILES
.PD 0
.TP 21
/etc/ioconfig.conf
maps logical controller numbers to canonical device names
.TP
/etc/ioperms
specifies permissions, owner, and group for devices
.TP
/var/sysgen/ioconfig
each device file in this directory specifies the ioconfig policy for that device
.PD
.SH SEE ALSO
hwgraph(4), basename(1).
.SH NOTE
If a disk is not properly initialized at the time of running
.IR ioconfig ,
only
.I /dev/rdsk/dks*{vol,vh}
device special files are created for that disk.
This is because
.I ioconfig
fails when it opens the volume and finds that the volume header is not valid.
If this disk is repartitioned using
.IR fx ,
all the proper partition device special files and aliases in
.I /dev/dsk
and
.I /dev/rdsk
are created for that disk.
