calmsacibis995/irix-6517-src/eoe/man/man1m/kbdload.1m
'\"macro stdmacro
.if n .pH g1a.kbdload @(#)kbdload	41.5 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.nr X
.if \nX=0 .ds x} kbdload 1M "" "\&"
.if \nX=1 .ds x} kbdload 1M ""
.if \nX=2 .ds x} kbdload 1M "" "\&"
.if \nX=3 .ds x} kbdload "" "" "\&"
.TH \*(x}
.SH NAME
\f4kbdload\f1 \- load or link \f4kbd\fP tables
.SH SYNOPSIS
\f4kbdload [\-p\fP] \f2filename\f1
.sp .5
\f4kbdload \-u\fP \f2table\fP
.sp .5
\f4kbdload \-l\fP \f2string\f1
.sp .5
\f4kbdload \-L\fP \f2string\fP
.sp .5
\f4kbdload \-e\fP \f2string\fP
.SH DESCRIPTION
Tables included in the file \f2filename\fP are
loaded into the \f4kbd\fP \s-1STREAMS\s+1
module, which must already have been pushed into the standard
input stream.
(In this context \f2loaded\fP means copied from
a disk file into main memory within the operating system.)
This program
is intended both to provide for loading and linking of both \f2shared\fP
or \f2public tables\fP and \f2private tables\fP implementing
user-specific functionality.
New users should
refer to \f4kbdcomp\fP(1M) and \f4kbd\fP(7) for a general description
of the module's capabilities.
.PP
Files are searched for only by the name given on the command line;
no search path is implied.
Tables loaded by the super-user with the \f4\-p\fP option from an
absolute path beginning at \f4/usr/lib/kbd\fP are made
publicly available and
permanently resident.
Otherwise the loaded tables are available only
to the caller, and are automatically unloaded when the \f4kbd\fP module
is popped from the stream.
.PP
The \f4\-u\fP option can be used to unload private tables
and by the super-user
to remove public tables.
Tables may be unloaded only if they
are not currently in use.
(Tables which are members of \f2composite tables\fP always
have non-zero reference
counts since they are ``used'' in the composite;
all composites which refer to them must be unloaded first.)
.PP
The \f4\-L\fP and \f4\-l\fP options are used for making composite
tables on the fly.
The \f4\-L\fP option, if executed by the super-user,
causes
the composite to be made publicly available; it is otherwise private and
equivalent to \f4\-l\fP.
The \f2string\fP argument is constructed in the
same manner as the \f4link\fP statement [see \f4kbdcomp\fP(1M)]
in the compiler.
If any component of the intended
composite is not presently loaded in memory or if a
component of a public table is not also public, an error
message is printed and the linkage fails.
More than one composite may
be created in a single invocation by using either option sequentially.
.PP
The \f4\-e\fP option with a string argument causes \f4kbdload\fP
to declare to the \f4kbd\fP module a subroutine called \f2string\fP,
which is assumed to be a subroutine managed by and registered
with the \f4alp\fP module
[see \f4alp\fP(7)].
These ``external'' subroutines may be used exactly
as any other loaded table; they may participate as members of
composite tables, and so on.
.SS Security Issues
Allowing users other than the super-user
to load public tables is a security risk and is
thus disallowed.
(In general, any manipulation of a module instance
by a user who is neither the super-user nor the user who originally
pushed it is disallowed.)
The library directory and all files contained in it
should be protected by being unwritable.
Administrators are encouraged to
remember that the \f4kbd\fP system can be used to arbitrarily re-map
the entire keyboard of a terminal, as well as the entire
output stream; thus in extremely hostile environments, it might
be prudent to remove execution permissions from \f4kbdload\fP
for non-administrative users (for example, setting the owner to \f4bin\fP
or \f4root\fP and giving it a mode of 0500).
.PP
The \f4kbdload\fP command checks to insure that
the real-uid of the invoker is the same as the owner of both
standard input and standard output files, unless the real-uid of the
invoking user is the super-user.
Paths to public tables are scrutinized for
legitimacy.
The \f4kbdload\fP command refuses to work as a \f2set-uid\fP
program.
.SH DIAGNOSTICS 
Exit status is 0 if all tables could be loaded and/or all operations
succeeded.
In the event of any \s-1I/O\s+1 error (for example, attempting to load
a table with the same name as one already loaded and accessible to the
caller) or failure to load a table, exit status is 1 and a message
is printed indicating the error.
.SH FILES
\f4/usr/lib/kbd\fP \- directory containing system standard map files.
.SH SEE ALSO
\f4kbdcomp\fP(1M), \f4kbdset\fP(1), \f4alp\fP(7), \f4kbd\fP(7)
.SH NOTES 
Composite tables may be unloaded while they are actually in use without
affecting current users, though new users may no
longer attach to it.
This is because composite tables are copied
and expanded when
they are attached in order to keep state information related to the
attaching user.
The original composite always has a zero reference
count, and is never itself attached.
This is an anomaly; the effect on the user is 
that a composite table may
be attached and functional, yet not appear in
the output of a \f4kbdset\fP(1) query.
