calmsacibis995/irix-6517-src/eoe/man/man1m/killall.1m
.nr X
.if \nX=0 .ds x} killall 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
killall \- kill named processes
.SH SYNOPSIS
.nf
\f3killall\f1 [ [\f3\-\f1]signal ]
\f3killall\f1 [ \f3\-gv\f1 ] [ \f3\-k\f1 secs ] [ [\f3\-\f1]signal ] \c
[ pname ...]
\f3killall\f1 [ \f3\-gv\f1 ] [ \f3\-k\f1 secs ] [ \f3\-\f1signame ] \c
[ pname ...]
\f3killall\f1 \f3\-l\f1
.fi
.SH DESCRIPTION
.I killall
sends a signal to a set of processes specified by name,
process group, or process ID.
It is similar to
.IR kill (1),
except that it allows processes to be specified by name and
has special options used by
.IR shutdown (1M).
.PP
When no processes are specified,
.I killall
terminates all processes that are
not in the same process
group as the caller.
This form is for use in shutting down the
system and is only available to the superuser.
.PP
The options to
.I killall
are:
.TP 10
\f2signal\f1, \f3\-\f1\f2signal\f1
Specifies the signal number.
The minus (\f3\-\f1) is required if
.I pname
looks like a signal number.
If no signal value is specified, a default of
.B 9
(KILL) is used.
.TP
.I pname
When a process is specified with
.IR pname ,
.I killall
sends
.I signal
to all processes matching that name.
This form is available
to all users provided that
their user ID matches the real,
saved, or effective user ID of the receiving process.
The signal number must be preceded by a minus (\f3\-\f1) if
.I pname
looks like a signal number.
.TP
.I signame
A mnemonic name for the signal can be used;
see the
.B \-l
option.
.TP
.B \-g
Causes the signal to be sent to the named processes'
entire process group.
In this form, the signal number should be preceded by
.B \-
in order
to disambiguate it from a process name.
.TP
.BI \-k " secs"
Allows the user to specify a maximum time to die for a
process.
With this option, an argument specifying the maximum number
of seconds to wait for a process to die is given.
If after delivery
of the specified signal (which defaults to SIGTERM when using the
.B \-k
option),
.I killall
waits for either the process to die or for the
time specified by
.I secs
to elapse.
If the process does not die in the allotted time,
the process is sent SIGKILL.
.TP
.B \-l
Lists the signal names
(see
.IR kill (1)
for more information about signal naming).
For example,
.sp .8v
.RS
.ne 3
.nf
	\f4killall 16 myproc
	killall -16 myproc
	killall -USR1 myproc\f1
.fi
.RE
.IP
are equivalent.
.TP
.B \-v
Reports if the signal was successfully sent.
.PP
.I killall
can be quite useful for killing a process without
knowing its process ID.
It can be used to stop a run-away user program without having
to wait for
.IR ps (1)
to find its process ID.
It can be particularly useful in scripts, because it makes
it unnecessary to run the output of
.IR ps (1)
through
.IR grep (1)
and then through
.IR sed (1)
or
.IR awk (1).
.SH FILES
/etc/shutdown
.SH SEE ALSO
fuser(1M),
kill(1),
ps(1),
shutdown(1M),
signal(2).
