calmsacibis995/irix-6517-src/eoe/man/man1m/linkstat.1m
.TH LINKSTAT 1
.SH NAME
\f3linkstat\f1 \- a Craylink monitoring tool
.SH SYNOPSIS
.nf
linkstat [\f3-e\f1][\f3-c\f1] \f3-a\f1 | \f2hwgraph_filename\f1
.fi

.SH DESCRIPTION
\f2linkstat\f1 reports on router link performance and error rates.  It also
reports error rates on the Hub chip Craylink network interface (NI)
and I/O Interface (II) links.

.SH OPTIONS
.TP
\f3-c\f1
Report information continuously every five seconds.
.TP
\f3-e\f1
Only report error rates, not performance information.
.TP
\f3-a\f1
Report on all links in the system.
.P
.SH EXAMPLES

To get information about a particular link, you might try
something like
.nf
\f3
# linkstat /hw/module/1/slot/n1/node/hub/mon \f1
Hub: /hw/module/1/slot/n1/node/hub/mon
 NI: Retries 0 (0/Min), SN errs 0 (0/Min), CB errs 0 (0/Min) 
 II: SN errs 0 (0/Min), CB errs 0 (0/Min) 

.fi
\f3SN errs\f1 refers to sequence number errors.  Some
number of these is normal.  Do not be alarmed by SN error counts.
\f3CB errs\f1 refers to checkbit errors.  None of these errors are fatal,
but high checkbit error or retry counts may indicate a problem.
.nf
\f3
# linkstat /hw/module/1/slot/r2/router/mon \f1
Router: /hw/module/1/slot/r2/router/mon
 Port 3:  Utilization: bypass 0%  receive 2%  send 2% 
  Retries 71847 (6/Min), SN errs 116395 (19/Min), CB errs 31196
  (2/Min) 
 Port 5:  Utilization: bypass 9%  receive 13%  send 20% 
  Retries 25087 (2/Min), SN errs 497298 (38/Min), CB errs 30417650
  (2914/Min) 
 Port 6:  Utilization: bypass 0%  receive 4%  send 3% 
  Retries 46394 (4/Min), SN errs 6252865 (599/Min), CB errs 5557
  (0/Min) 
---------------------------------------------------------------------

.fi
This example is from a sick system.  The checkbit errors on port 5 are
excessive.  All of the other numbers are within spec.  Send and receive
utilizations indicate how much of a port's peak bandwith is being used.
Bypass indicates what percentage of traffic is able to use the latency-reducing
bypass feature of the router chip.
.nf
\f3
# linkstat -a
\f1
.fi
This example would display information about all of the links on the
system.
.P
.SH RESTRICTIONS

If there are no routers present, the \f3linkstat -a\f1 output will include
a message like this one:
.nf
\f3
Cannot access /hw/module/*/slot/r*/router/mon:
No such file or directory
\f1
Do not be alarmed.
.fi

.SH SEE ALSO

\f3xbstat\f1(1)

