calmsacibis995/irix-6517-src/eoe/man/man1m/lltune.1m
.TH LLTUNE 1M "Network Utilities" " "
\"  Manual Pages - Acknowlegements to Berkeley SCCS @(#) lltune.1m 5 5/12/92
\" 	TR	18 Oct 89	Corrected spelling 
\"	TR	 1 Nov 89	lapb,llc2conf become lapb,llc2template 
\" 	TR	 1 Feb 90	Swapped default from put to get.
\" 
.SH NAME
lltune \- Sends/receives lapb or llc2 tuning parameters to/from their
respective drivers.
.SH SYNOPSIS
.B "lltune"
.RB "-s \fIsubnet_id\fP"
.RB "-p \fIprotocol\fP"
.B -P
.RB [ "-d \fIdevice\fP" ]
.RB [ "\fIfilename\fP" ]
.PP
.B "lltune"
.RB "-s \fIsubnet_id\fP"
.RB "-p \fIprotocol\fP"
.RB [ -G ]
.RB [ "-d \fIdevice\fP" ]
.PP
.SH DESCRIPTION
.I lltune
is a utility which either:
.RS
.PP
\(bu
puts a set of lapb
parameters to the lapb driver,
.PP
\(bu
gets a set of lapb parameters from the lapb driver,
.PP
\(bu
puts a set of llc2
parameters to the llc2 driver, or
.PP
\(bu
gets a set of llc2 parameters from the llc2 driver.
.PP
.RE
By default, a 
.B "get"
operation is performed.
.PP
These parameters are on a per-subnetwork basis and thus,
the subnetwork identifier must
be specified.
.PP
The options used in
.I lltune
are the following:
.PP
.IP "\fB-s \fIsubnet_id\fR" 12
.IR "subnet_id"
is the subnetwork to be referenced.
.IP "\fB-p \fIprotocol\fR"
specifies the protocol being used as
.IR protocol.
This value can be either
.B lapb
or
.B llc2.
This is obligatory
as the tuning parameters for lapb and
llc2 are different.
.IP "\fB-G\fR"
get parameters from the lapb/llc2 (as
specified by the
.B -p
option) driver. These are written to the standard
output.
.IP "" 12
.B Note:
The
.B -G
(\fBget\fR)
option is used as default and therefore
is optional when a 'get' is required.
.IP "\fB-P\fR"
put parameters to the lapb/llc2 driver, giving
subnetwork
.IR subnet_id
these values.
.PP
.IP "\fB-d \fIdevice\fR" 12
specify the lapb/llc2 device to be
.IR device.
For an on-board system, the default
.IR lapb
device is
.IR /dev/lapb0,
and the default
.IR llc2
device is
.IR /dev/llc20.
For an in-kernel system, the default
.IR lapb
device is
.IR /dev/lapb,
and the default
.IR llc2
device is
.IR /dev/llc2.
.PP
The
.IR filename,
as used in the 'send' option,
specifies the file of parameters to be
sent
(\fBput\fR)
to LAPB or LLC2. These parameters are described in the manual page
\fBllc2template(4)\fR.
The values are read from the
standard input but this can be overridden by
specifying a file of parameters.
.PP
If the
.IR filename
begins with a '/', then it is assumed to be
the full path-name of the file. Otherwise, the
file required is assumed to be
.IR /var/opt/snet/template/filename.
If
.IR filename
is not found in the template directory,
then it is returned as invalid.
.PP
.SH SEE ALSO
llc2template(4).
