calmsacibis995/irix-6517-src/eoe/man/man1m/makemap.1m
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)makemap.8	8.3 (Berkeley) 7/24/94
.\"
.TH MAKEMAP 1m
.SH NAME
makemap \- create database maps for sendmail
.SH SYNOPSIS 
\f3makemap\f1 [-N] [-d] [-f] [-o] [-r] [-v] 
.IR maptype
.IR mapname
.SH DESCRIPTION
.NM
creates the database maps used by the keyed map lookups in sendmail (1m).
It reads input from the standard input and outputs them to the indicated
.IR mapname .
.PP
.\" Depending on how it is compiled,
.BR makemap
handles up to three different database formats,
selected using the
.IR maptype
parameter.
They may be
.PP
.TP 10
.B dbm
DBM format maps.
This use the ndbm(3) from the standard C library.
.TP 10
.B btree
B-Tree formap maps.  This requires the new Berkeley db(3) library.
.TP 10
.B hash
Hash format maps.  This also requires the Berkeley db(3) library
.\" .TP Li btree
.\" B-Tree format maps.
.\" This requires the new Berkeley
.\" .XR db 3
.\" library.
.\" .IT Li hash
.\" Hash format maps.
.\" This also requires the
.\" .XR db 3
.\" library.
.\" .EL
.PP
In all cases,
.NM
reads lines from the standard input consisting of two
words separated by white space.
The first is the database key,
the second is the value.
The value may contain
``%\fIn\fP''
strings to indicated parameter substitution.
Literal parentheses should be doubled
(``%%'').
Blank lines and lines beginning with ``#'' are ignored.
.SH Flags
.TP 10
.B -N
Include the null byte that terminates strings
in the map.
This must match the \-N flag in the sendmail.cf
``K'' line.
.TP 10
.B -d
Allow duplicate keys in the map.
This is only allowed on B-Tree format maps.
If two identical keys are read,
they will both be inserted into the map.
.TP 10
.B -f
Normally all upper case letters in the key
are folded to lower case.
This flag disables that behaviour.
This is intended to mesh with the
\-f flag in the
\fBK\fP
line in sendmail.cf.
The value is never case folded.
.TP 10
.B -o
Append to an old file.
This allows you to augment an existing file.
.TP 10
.B -r
Allow replacement of existing keys.
Normally
.NM
complains if you repeat a key,
and does not do the insert.
.TP 10
.B -v
Verbosely print what it is doing.
.EL
.SH SEE ALSO
sendmail(1m)
.SH HISTORY
The
.BR makemap
command appeared in 4.4BSD 
