calmsacibis995/irix-6517-src/eoe/man/man1m/makewhatis.1m
.TH makewhatis 1M
.SH NAME
makewhatis, manwhat \- make manual page "whatis" database for use with apropos
.SH SYNOPSIS
.nf
\f3/usr/lib/makewhatis\f1 [\f3\-M\f1 manpath] [filename]
.fi
.SH DESCRIPTION
.I makewhatis
scans the manual page (also known as reference page) trees,
parses the manual pages, and strips out the NAME section information
to create the "whatis" database used by
.IR apropos (1),
.IR man (1),
and
.IR whatis (1).
.PP
By default,
.I makewhatis
creates the file
.IR /usr/share/catman/whatis .
Another file can be created as the database by specifying its filename on
the command line.
.PP
An alternate manual page tree can be specified by using the
.B \-M
option to specify a path or paths to a manual page tree or trees.
See the discussion of the
.B \-M
option in
.IR man (1)
for more details.
.PP
The format of the "whatis" file is based on that used by
William Joy's UC Berkeley version of
.IR apropos .
.SH ENVIRONMENT
The environment variables used by
.IR man (1)
apply to
.IR makewhatis .
.SH "SEE ALSO"
awf(1),
apropos(1),
man(1),
sgindexAdmin(1),
whatis(1).
.SH FILES
.ta 27
/usr/share/catman	manual page tree
.br
/usr/share/catman/whatis	"whatis" database
.br
/usr/lib/manwhat The specialized version of the man(1) program that
is used to build the database.
.SH CAVEATS
Expect execution times of about
10-30 minutes, depending on the number of manual pages installed.
The reason is that the first portion of EVERY manual page on the system is read.
.PP
If unformatted
.RI ( nroff
source) man pages are present, the
.I dwb
product should be installed, or
.I makewhatis
may issues warning messages, because it falls back on an awk script
called
.IR awf(1)
that emulates nroff -man.
.PP
You must run
.I makewhatis
as root.
.SH NOTE
This program is run automatically in the background during system
bootup, whenever products have been installed or removed
(when
.I /var/inst/hist
is newer than
.IR /usr/s ),
from the script \f2/etc/init.d.configmsg\fP.  As of the IRIX 6.5
release, the
.IR sgindexAdmin (1)
program will run first, and use the installed information where possible,
to reduce runtime.  Only if that program is not found, or fails, will
.I makewhatis
run to build the database.
.PP
Manual pages in source form that use the \f3\.so\fP directive will
cause makewhatis to complain that the other file can't be found,
unless it is a full pathname.
