calmsacibis995/irix-6517-src/eoe/man/man1m/mediad.1m
'\"macro stdmacro
.TH MEDIAD 1M
.SH NAME
mediad \- removable media daemon
.SH SYNOPSIS
.B mediad
.br
.B mediad
[
.B -l
.I level
] [
.B -f
]
] [
.B -n
]
.B -a
.br
.B mediad 
[
.B -d
]
.B -f
.br
.B mediad -k
.br
.B mediad -l
.I level
.br
.B mediad
[
.B -l
.I level
]
.B -e
[
.I ctlr
]
.I ID
[
.I LUN
] |
.I dir
|
.I device
.br
.B mediad
[
.B -l
.I level
]
.B -u
.br
.SH DESCRIPTION
.B mediad
is a daemon that monitors the removable media devices on a system.
When media is inserted,
mediad scans the media for filesystems and mounts them.
When a user issues the
.B eject
command,
.B eject
sends mediad a message,
and
mediad dismounts the filesystems and ejects the media.
.B N.B.:
Because data corruption and loss will occur
if media is forcibly removed without
unmounting any filesystems present on the media,
always eject disk media using either the
.B eject
command or the
.I Eject
selection in the desktop pop-up menu for the device.
.PP
For all options other than
.BR -e ,
.BR -u ,
and
.BR -m ,
mediad may only be invoked by the superuser.
.PP
.B mediad
reads configuration options from its configuration file,
.IR /etc/config/mediad.config .
mediad continually monitors its configuration file.
When that file changes,
mediad immediately updates device status to match the file.
The configuration file is described below under
.BR "CONFIGURATION FILE SYNTAX" .
.PP
.B mediad
also provides information to the IRIX Interactive Desktop
and system administration tools
which they use to
draw the icons representing removable media devices.
.PP
.B mediad
monitors these device types:
.TP 11
  CDROM
CD-ROM
.TP 11
  dat
DAT tape
.TP 11
  floppy
Insite floptical disk, Teac SCSI floppy disk
.TP 11
  jaz
Iomega Jaz disk
.TP 11
  LS-120
LS-120 I-O Data 120MB floppy-compatible disk
.TP 11
  optical
Sony SMO-521 and Pinnacle Sierra magneto-optical disks
.TP 11
  syquest
SyQuest EZ135, 88, 105, 200, and 270 Mb disks
.TP 11
  tape
QIC 24, 150, 1000, and 1350 tapes,
IBM 3480 tape,
Exabyte 8 mm tape,
and
DLT tape
.TP 11
  zip
Iomega Zip disk
.PP
.B mediad
recognizes these filesystem types on devices that support them.
See
.IR filesystems (4).
.TP 11
  cdda
Compact Disk Digital Audio
.TP 11
  dos
IBM PC DOS
.TP 11
  efs
Silicon Graphics Extent File System
.TP 11
  iso9660
ISO 9660 filesystem for CD-ROM,
also the High Sierra, Rock Ridge and PhotoCD extensions.
.TP 11
  hfs
Apple Macintosh Hierarchical File System
.TP 11
  xfs
Silicon Graphics XFS File System
.PP
If a disk has several nonoverlapping partitions,
.B mediad
mounts them all by default.
If it has overlapping partitions,
mediad mounts the filesystem type that appears first in the list above.
You can override the default behavior using the configuration file.
.PP
.B mediad
uses the following rules
to choose the directory
where it mounts a filesystem.
.TP
1.
If the configuration file contains an applicable \fBmount\fP command,
and the \fBmount\fP command specifies a directory,
that directory is used.
.TP
2.
Otherwise,
if mediad is only mounting one partition from the device,
then the device name is used.
If there is more than one device of a given type,
a number is appended to every device except the first.
(For example, filesystems from two Zip drives are mounted at
.I /zip
and
.IR /zip2 .)
.TP
3.
Otherwise,
the directory name is made by concatenating
the device name,
the filesystem type,
and the partition number.
(For example, three DOS partitions on a Jaz drive are mounted at
.IR /jaz/dos.partition1 ,
.I /jaz/dos.partition2
and
.IR /jaz/dos.partition3 .)
.PP
.B mediad
uses the dynamic shared objects (DSOs) in \fI/usr/devicelib\fP.
There is one DSO for each device type mediad understands
and one DSO for each filesystem type.
.SH OPTIONS
.TP
.B \-a
Start mediad in the background.
(This is the default when no arguments are specified)
.TP
.B \-d
Turn on the \f2dsdebug\fP variable of \f2dslib\fP(3X)
which enables voluminous SCSI command tracing.
The \fB-d\fP option must be used with the \fB-f\fP option.
.TP
\fB-e\fP \fIdevice\fP
Eject the given device.
The device must be specified as described under
.BR "CONFIGURATION FILE SYNTAX" ,
below.
.TP
\fB-e\fP \fIdirectory\fP
Eject the device containing the filesystem mounted at
the given directory.
.TP
.B \-f
Start mediad in the foreground.
When running in the foreground, mediad does not fork at startup.
The \fB-f\fP option also sets the default log level to
.BR LOG_DEBUG ,
and log messages are directed to mediad's standard error instead
of to
.IR syslogd (1M).
.TP
.B \-k
Send a message to mediad telling it to exit.
When mediad exits,
it dismounts all the filesystems it has mounted.
.TP
\fB-l\fP \fIlevel\fP
When used alone,
sends a message to the currently running mediad to
log all messages of priority \fIlevel\fP and higher.
When used with \fB-a\fP, \fB-f\fP, \fB-e\fP or \fB-u\fP option,
the \fB-l\fP option affects
the current mediad process instead of sending a message.
.TP
.B -n
Mount all filesystems with the nosuid mount option.
When \f3-n\fP is specified, \f2nosuid\fP is specified
in the options argument of all \f2mount\fP(1M) commands
that \f2mediad\fP runs.
.TP
.B -u
Eject the default device.
On systems with more than one removable media device,
this command should not be used,
because
the default device is not predictable.
.SH EXAMPLE COMMANDS
.TP
.B mediad -l 7 -a
Start mediad in the background with full debugging output.
.TP
.B mediad -f
Start mediad in the foreground with full debugging output.
.PP
.B mediad -e 0 4 0
.br
.B mediad -e 0 4
.br
.B mediad -e 4
.br
.B mediad -e /dev/scsi/sc0d4l0
.br
.B mediad -e /dev/rdsk/dks0d4s7
.br
.B mediad -e /dev/rmt/tps0d4
.br
.B mediad -e /dev/rdsk/fds0d4.3.5hi
.RS
Each of these commands ejects the device at
SCSI controller 0, ID 4, LUN 0.
.RE
.TP
.B mediad -e /floppy
Eject the device with a filesystem mounted at the directory
.IR /floppy .
.SH CONFIGURATION FILE SYNTAX
mediad's configuration file,
.IR /etc/config/mediad.config ,
is optional,
and is not present in the system as shipped.
It may be created at any time as needed.
The file consists of one or more configuration commands,
with one command per line.
Comments begin with a # character and continue to the end of the line.
.PP
A \fBdevice specification\fP specifies a device.
It consists of the keyword \fBdevice\fP followed by
the name of a device special file.
The special file is only used to determine the device's address
\- the type of device is unimportant.
Mediad recognizes these device types.
.TP 10
  scsi
generic SCSI device
.TP 10
  dksc
SCSI disk device
.TP 10
  tpsc
SCSI tape device
.TP 10
  smfd
SCSI floppy/floptical device
.PP
A \fBfilesystem specification\fP specifies a pattern to match
filesystems.
A filesystem specification consists of the keyword
\fBfilesystem\fP,
the name of a device special file,
a filesystem type,
and, optionally,
the keyword \fBpartition\fP followed by a partition number.
If the partition number is omitted,
the filesystem specification matches a filesystem covering the whole disk.
In general,
within a filesystem specification the device
should be named using
the device special file name that mediad uses by default.
An exception occurs when using ISO 9660 CD-ROMs.
For ISO 9660 filesystems the CD-ROM device
must be specified by its entry in the directory
.IR /dev/scsi .
.PP
These are the configuration file's commands.
.TP
\fBignore\fP \fIdevice specification\fP
Tells mediad not to monitor this device.
The device will have a generic device icon on the desktop,
and mediad will not access the device.
.TP
\fBignore\fP \fIfilesystem specification\fP
Tells mediad not to mount filesystems matching this specification.
.TP
\fBmonitor\fP \fIdevice specification\fP
Tells mediad to monitor this device.  This is the default.
.RS
.PP
The monitor command has these optional parameters.
.TP
\fBinschk\fP \fInumber\fP
Tells mediad to check for media insertion every \fInumber\fP seconds.
The default is 3.
.TP
\fBrmvchk\fP \fInumber\fP
Tells mediad to check for media removal every \fInumber\fP seconds.
The default is 45.
.RE
.TP
\fBmount\fP \fIfilesystem specification\fP
Tells mediad to mount filesystems matching this specification.
Filesystems that match a mount command will be preferentially
mounted over filesystems that do not, so you can use the
\fBmount\fP command to override mediad's filesystem precedence order.
.RS
.PP
The mount command has these optional parameters.
.TP
\fBdirectory\fP \fIpath\fP
Tells mediad to mount the filesystem at this directory.
.TP
\fBoptions\fP \fIlist\fP
Tells mediad to pass these mount options to the mount
command when mounting the filesystem.  See
.IR fstab (4)
for a list of valid options.
.TP
\fBshared\fP
Tells mediad to export the filesystem for remote NFS
access after mounting it.  If the filesystem's mount
directory is listed in \fI/etc/exports\fP (see
.IR exports (4)),
the export options listed there are used.  Otherwise, the
filesystem is exported read-only to all hosts.  See
the description of the \fBshare\fP command below.
.TP
\fBunshared\fP
Tells mediad not to export the filesystem.
.RE
.TP
\fBshare\fP \fIdevice specification\fP
Tells mediad to share the specified device.  A shared device can
be accessed from other machines through the IRIX Interactive Desktop.
A shared device's filesystems are also exported by default,
although you can override that behavior via the \fBmount\fP
command, described above.
.SH SAMPLE CONFIGURATION FILE
\fB
.nf
# ignore a tape device completely.
ignore device /dev/rmt/tps0d6

# do not mount audio CDs on this CD-ROM drive.
ignore filesystem /dev/scsi/sc0d4l0 cdda

# check a floppy device for insertion and removal
# every 60 seconds
monitor device /dev/scsi/sc0d2l0 inschk 60 rmvchk 60

# mount HFS (Macintosh) filesystems on a CD-ROM
# preferentially over other filesystem types
mount filesystem /dev/scsi/sc0d4l0 hfs  

# mount EFS filesystems on the given CD-ROM at
# the directory "/data", disallowing set-UID programs.
mount filesystem /dev/dsk/dks0d4s7 efs directory /data options nosuid

# share a Zip drive
share device /dev/scsi/sc0d6l0
.fi
\fP
.SH FILES
.TP \w'/usr/lib/devicelib/dev_*.so\ \ \ 'u
/etc/config/mediad.config
configuration file
.TP
/etc/init.d/mediad
mediad startup and shutdown script
.TP
/etc/config/mediad.options
command line arguments mediad is started with during system initialization
.TP
/usr/lib/devicelib/dev_*.so
device DSOs
.TP
/usr/lib/devicelib/fmt_*.so
filesystem format DSOs
.SH SEE ALSO
eject(1),
mount(1M),
exports(4),
filesystems(4),
fstab(4),
scsi(7),
dksc(7),
tpsc(7),
smfd(7).
