calmsacibis995/irix-6517-src/eoe/man/man1m/mkboottape.1m
.TH mkboottape 1M
.SH NAME
mkboottape \- make a boot tape filesystem
.SH SYNOPSIS
.nf
\f3/etc/mkboottape\f1 [\f3\-f\f1 output_file] [\f3\-l\f1 | \f3\-x\f1 \c
[file ...] | file ...]
.fi
.SH DESCRIPTION
.I mkboottape
is used to build, list, or extract "boot tape filesystems".  Booting
from tape is no longer supported.  However, the tape filesystem format
is still used in the \f3sa\fP file used in booting from CDROM.
.PP
A tape filesystem consists
of
a special directory that contains the list of filenames, sizes, and
offsets, and from one to 20 files.
Filenames can be up to 16
characters in length.
.PP
The following options are understood:
.TP 19
.B \-l
List the contents of the boot tape.
In this case the file
arguments are ignored.
.TP
\f3\-f\f1 [\f2output_file\f1]
Specify an alternate output file or device.
The default is
.IR /dev/tape .
.TP
\f3\-x\f1 [\f2file\f1 ...]
Extract files from the boot tape.
If no filenames are given, all files are extracted.
Extracted
files have their original size (they are not null padded to
a block multiple).
.PP
The typical use for this program is to create an output file that is
used in booting from CDROM, or to extract files from that "filesystem".
The PROM monitor understands the boot tape format.
.SH NOTES
Unless you have means to create a standalone program, this utility is
useful only listing or extracting the files, or creating new boot images
from previously extracted files.
In some cases it can
be used to extract the standalone programs into a directory,
because most standalone programs can be booted from the filesystem using
.I sash
or over a network.
.SH SEE ALSO
distcp(1M),
inst(1M).
