calmsacibis995/irix-6517-src/eoe/man/man1m/mkfp.1m
.nr X
.if \nX=0 .ds x} mkfp 1M "Silicon Graphics" "\&"
.TH \*(x}
.SH NAME
mkfp \- construct a FAT (MSDOS) or HFS (MACINTOSH) filesystem
.SH SYNOPSIS
.B mkfp
.RI [ " options " ] " special " 
.SH DESCRIPTION
.PP
.B mkfp
is a formatting/partitioning utility that can be used to create 
.B DOS 
and
.B HFS 
file systems on devices such as floppy, floptical,
SuperDisk (LS-120), SyQuest, Jaz, Zip and hard drives.
It also works on PC Cards.
.PP
.B mkfp 
is capable of creating single
.B DOS 
partitions on floppies and floptical disks as well as multiple 
.B DOS 
partitions on other forms of media.
On the other hand,
.B mkfp 
can only create single HFS partitions spanning entire disks.
.B mkfp 
can NOT be used to manipulate existing partitions on disk.  Invocation of
.B mkfp 
will destroy all existing data on disk and perform a complete reformat.
Please use this tool with care.
.SH OPTIONS
.TP
.B \-t\f1[[dos|fat] | [hfs|mac]]\fP
Specifies the target file system. This utility supports two types of file systems with four options.
.B dos
and
.B fat
are synonyms in representing
.B MSDOS FAT
file systems while
.B mac
and
.B hfs
are synonyms in representing
.B MACINTOSH HFS
file systems.
Note: This option does not work correctly for
FAT filesystems on high density floppies when used in a SuperDrive (LS-120).

.TP
.B \-p\fP[\f2size\fP[\f1k|m\fP]]\fP[\f2:label\fP]
Requests a partition to be created with a specified \f2size\fP and \f2label\fP.  If \f2size\fP is not specified, a single partition is created spanning the entire disk.  If \f2label\fP 
is not specified, "Untitled" is used as the default label. Each individual
partition that is to be created is specified using a separate 
.BR "-p"
argument on the command line.
The first three DOS partitions created will have indices 1, 2, 3
and subsequent ones will be numbered 5 and upwards, consistent with
the convention used by 
.B mount_dos.
The default size is in bytes, but it can be flagged as kilobytes or
megabytes, with k or m suffixes. 
.B mkfp 
will round up partition sizes to ensure that they are cylinder aligned.

.TP
.BR \-y
Suppresses messages from appearing on stdout. Does not prompt user before 
creating partitions. Use this option with care.

.TP
.BR \-x
Performs low level formatting of floppies/floptical disks. This
option does not work with other forms of media such as hard-drives, 
SuperDisk (LS-120), SyQuest, Jaz, PC Cards or Zip drives.
To perform low level formatting of 
such devices, please use utilities present on PCs and Macs.

.SH NOTE
.PP
To format floppies or floptical disks, use 
.I special 
files of the form: 
.B "/dev/rdsk/fds*d*"

Earlier versions of
.B mkfp
chose the size of a file system on a floppy or floptical disk based on the
special file specified.  mkfp now uses a READ CAPACITY command
to size the disk.  To override the default size, use the
.BR "-p"
option.

.PP 
To format PC Cards, use 
.I special
files of the form: 
.B "/dev/rdsk/dks?d?vol" 
and 
.B "/dev/rdsk/dks?d?l?vol"

.PP
To format Jaz, Zip, SyQuest, Magneto-optical  and hard drives, use
.I special 
files of the form: 
.B "/dev/rdsk/dks?d?vol"

.PP
.B mkfp
puts a partition table and a single HFS partition that
fills the disk onto any disk bigger than 21 megabytes.
.B mkfp 
is incapable of creating multiple HFS partitions on a single disk.


.SH EXAMPLES

.PP
To high level format and place a 
.B dos 
partition on a floppy or a
floptical drive, that's present at controller 0, scsi id 3, using
default label:

.B mkfp -t dos /dev/rdsk/fds0d3.3.5hi

.PP
To high level format and place a 
.B hfs 
partition on a floppy or a
floptical drive, that's present at controller 0, scsi id 3, using
default label:

.B mkfp -t hfs /dev/rdsk/fds0d3.3.5hi

.PP
To low level format and place a 
.B dos 
partition on a floppy drive,
that is present at controller 0, scsi id 3, with label 
.B "FOO":

.B mkfp -t dos -x -p:"FOO" /dev/rdsk/fds0d3.3.5hi

.PP
To high level format and place a 
.B dos 
partition on a non-floppy drive
that is present at controller 0, scsi id 5, with label 
.B "FOO":

.B mkfp -t dos -p:"FOO" /dev/rdsk/dks0d5vol

.PP
To high level format and place a 
.B hfs 
partition on a non-floppy drive
that is present at controller 0, scsi id 5, with label 
.B "FOO":

.B mkfp -t hfs -p:"FOO" /dev/rdsk/dks0d5vol

.PP
To high level format and place 2 
.B dos 
partitions, of size 
.B 10Mb 
and 
.B 20Mb
,  on a non-floppy drive
that is present at controller 0, scsi id 5, with labels 
.B "FOO"
and
.B "BAR":

.B mkfp -t dos -p10m:"FOO" -p20m:"BAR" /dev/rdsk/dks0d5vol

.SH SEE ALSO
fpck(1M).
