calmsacibis995/irix-6517-src/eoe/man/man1m/mount.1m
.TH mount 1M
.SH NAME
mount, umount \- mount and unmount filesystems
.SH SYNOPSIS
.nf
\f3mount\f1
\f3mount\f1 [ \f3\-M\f1 altmtab ] [ \f3\-P\f1 prefix ] \f3\-p\f1
\f3mount\f1 [ \f3\-h\f1 host ] [ \f3\-fnrv\f1 ]
\f3mount\f1 \f3\-a\f1[\f3cfnvC\f1] [ \f3\-t\f1 type ] \c
[ \f3\-T\f1 list ] [\f3\-m\f1 numprocs ]
\f3mount\f1 [ \f3\-cfnvC\f1 ] [ \f3\-t\f1 type ] [ \c
\f3\-T\f1 list ] [ \f3\-b\f1 list ]
\f3mount\f1 [ \f3\-cfnrvC\f1 ] [ \f3\-t\f1 type ] [ \c
\f3\-T\f1 list ] [ \f3\-o\f1 options ] fsname dir
\f3mount\f1 [ \f3\-cfnrvC\f1 ] [ \f3\-o\f1 options ] fsname | dir
.sp .8v
\f3umount\f1 \f3\-a\f1[\f3kv\f1] [ \f3\-t\f1 type ] \c
[\f3\-m\f1 numprocs ] [ \f3\-T\f1 list ]
\f3umount\f1 \f3\-h\f1 host [ \f3\-kv\f1 ] [\f3\-m\f1 numprocs ] \c
[ \f3\-b\f1 list ]
\f3umount\f1 [ \f3\-kv\f1 ] fsname | dir [ fsname | dir ]  ...
.fi
.SH DESCRIPTION
.I mount
attaches a named filesystem
.I fsname
to the filesystem hierarchy at the pathname location
.IR dir .
The directory
.I dir
must already exist.
It becomes the name of the newly mounted root.
The contents of
.I dir
are hidden until the filesystem is unmounted.
If
.I fsname
is of the form host:path, the filesystem type is assumed to be
.BR nfs .
.LP
.I umount
unmounts a currently mounted filesystem, which can be specified
either as a mounted-on
directory
or a
filesystem.
.LP
.I mount
and
.I umount
maintain a table of mounted filesystems in
.IR /etc/mtab ,
described in
.IR mtab (4).
If invoked without an argument,
.I mount
displays the table.
If invoked with only one of
.I fsname
or
.IR dir ,
.I mount
searches the file
.I /etc/fstab
(see
.IR fstab (4))
for an entry whose
.I dir
or
.I fsname
field matches the given argument.
For example, if this line is in \f2/etc/fstab\f1:
.IP
.B "/dev/usr  /usr  xfs  rw  0 0"
.LP
then the commands
.B "mount\ /usr"
and
.B "mount\ /dev/usr"
are shorthand for
.BR "mount\ /dev/usr\ /usr" .
.SH "MOUNT OPTIONS"
.TP 10
.B \-a
Attempt to mount all the filesystems described in
.IR /etc/fstab .
(In this case,
.I fsname
and
.I dir
are taken from
.IR /etc/fstab .)
If a type is specified with
.B \-t,
all of the filesystems in
.I /etc/fstab
with that type are mounted.
Multiple types may be specified with the
.B \-T
option.
Filesystems are not necessarily mounted in the order
listed in
.IR /etc/fstab .
If the 
.B \-m
option is specified, its argument is used to limit the
number of processes used to mount all of the file systems
in parallel.
.TP
.BI \-b " list"
(all-but)  Attempt to mount all of the filesystems listed in
.I /etc/fstab
except for those associated with the directories contained in
.IR list .
.I list
consists of one or more directory names separated by commas.
.TP
.B \-c
Invoke
.IR fsstat (1M)
on each filesystem being mounted,
and if it indicates that the filesystem
is dirty, call
.IR fsck (1M)
to clean the filesystem.
.I fsck
is passed the
.B \-y
option.
This option applies only to EFS filesystems, not to XFS filesystems.
.TP
.B \-f
Fake a new
.I /etc/mtab
entry, but do not actually mount any filesystems.
.TP
.BI \-h " host"
Mount all filesystems listed in
.I /etc/fstab
that are remote-mounted from
.IR host .
.TP
.BI \-m " numprocs"
Use no more than
.IR numprocs
processes to mount the specified
file systems in parallel.  The default number of processes
used is 16.  This option is only meaningful
when used in conjunction with the
.B \-a
option.
.TP
.B \-n
Mount the filesystem without making an entry in
.IR /etc/mtab .
.TP
.BI \-o " options"
Specify
.I options,
a list of comma-separated words, described in
.IR fstab (4).
.TP
.B \-p
Print the list of mounted filesystems in a format suitable for use in
.I /etc/fstab.
.TP
.B \-r
Mount the specified filesystem read-only.
This is a shorthand for:
.RS
.IP
\f3mount \-o ro\f1 \f2fsname dir\f1
.RE
.IP
Physically write-protected and magnetic tape filesystems
must be mounted
read-only, or errors occur when access times are updated,
whether or not any explicit write is attempted.
.TP
.BI \-t " type"
The next argument is the filesystem type.
The accepted types are
\f3proc\f1, \f3efs\f1, \f3xfs\f1, \f3nfs\f1, \f3fd\f1, \f3cachefs\f1,
\f3dos\f1, \f3hfs\f1 and \f3iso9660\f1; see
.IR fstab (4)
and the
.IR filesystems (4)
man page for more information on the supported filesystem types.
for a description of these filesystem types.
When this option is used, mount
calls another program of the form \f2mount_\f3typename\f1, where typename is one
of the above types.
This program must be on the default path.
.TP
.BI \-T " list"
The next argument is a comma-separated list of filesystem types.
This option is usually used in combination with
.B \-a
or
.BR \-b .
.TP
.B \-v
(verbose)  \f2mount\f1
displays a message indicating the filesystem
being mounted and any problems
encountered.
.TP
.BI \-M " altmtab"
Instead of
.IR /etc/mtab ,
use the mtab or fstab
.IR altmtab .
.TP
.BI \-P " prefix"
Used with the
.B \-p
option,
prepends
.I prefix
to the emitted
.I filesystem
and
.I directory
paths.
Doesn't alter pathnames embedded in the options,
such as the
filesystem's
.BI raw =path
raw device pathname.
.SH "UMOUNT OPTIONS"
.TP 10
.B \-a
Attempt to unmount all the filesystems currently mounted (listed
in
.IR /etc/mtab ).
In this case,
.I fsname
is taken from
.IR /etc/mtab .
.sp
.BR NOTE :
The use of \f3umount -a\fP is \f2NOT\fP symmetric with \f3mount -a\fP,
because the first is based on the \f3mtab\fP file, while the second is
based on the \f3fstab\fP file.  Typical differences are the \f3/proc\fP,
\f3/hw\fP, and \f3/dev/fd\fP filesystems.
.TP
.BI \-b " list"
(all-but)  Attempt to unmount all of the filesystems currently
mounted except for those associated with the directories contained in
.IR list .
.I list
consists of one or more directory names separated by commas.
Using
.sp .8v
.RS
	umount -a
.RE
.IP
itself is not usually a good idea, because it can not
be reversed by the command
.sp .8v
.RS
	mount -a
.RE
.IP
since a number of filesystems are often not in the
.I /etc/fstab
file.
Among these are the
.I proc
and
.I fd
filesystems.
Instead, use a command similar to
.sp .8v
.RS
	umount -T xfs,efs
.RE
.TP
.BI \-h " host"
Unmount all filesystems listed in
.I /etc/mtab
that are remote-mounted from
.IR host .
.TP
.BI \-m " numprocs"
Use no more than
.IR numprocs
processes to unmount the specified
file systems in parallel.  The default number of processes
used is 16.  This option is only meaningful
when used in conjunction with the
.B \-a,
.B \-t
or
.B \-h
options.
.TP
.B \-k
Attempt to kill processes that have open
files or current directories in
the appropriate filesystems and then unmount them.
.TP
.BI \-t " type"
Unmount all filesystems of a given filesystem type.
The accepted types are
\f3proc\f1, \f3efs\f1, \f3xfs\f1, \f3nfs\f1, \f3fd\f1, \f3cachefs\f1,
\f3dos\f1, \f3hfs\f1, and \f3iso9660\f1.
.TP
.BI \-T " list"
Unmount all filesystems whose type is in the comma-separated
list given.
.TP
.B \-v
(verbose)  \f2umount\f1
displays a message indicating the filesystem being unmounted and any
problems encountered.
.TP
.B \-C
Disable overlapping partition/volume checks.
.IP
By default \f2mount\f1 checks to see if the destination partition or logical
volume overlaps any mounted or reserved partitions in the system.  If an
overlap or mount conflict is found, the user will be notified and prevented
from potentially corrupting the existing data.  For systems with
a large number of disks, this additional checking may add noticable overhead
to the command's execution time.  For situations where command performance is
necessary, this switch may be used to disable the safeguards.  Due to the
potential for user-error causing corrupted filesystems or other on-disk
data corruption, we strongly discourage use of this switch in normal operation.
.SH EXAMPLES
.nf
.ta \w'mount \-o soft server:/d /net/dXX'u
mount /dev/usr /usr	mount a local disk
mount \-avt xfs	mount all xfs filesystems; be verbose
mount \-t nfs server:/d /net/d	mount remote filesystem
mount server:/d /net/d	same as above
mount \-o soft server:/d /net/d	same as above but soft mount
mount \-p > /etc/fstab	save current mount state
mount \-t dos /dev/rdsk/fds0d2.3.5 /floppy
	mount a MS-DOS floppy
mount \-t hfs /dev/rdsk/fds0d3.3.5hi /floppy
	mount a Macintosh HFS floppy
mount \-t hfs /dev/rdsk/dks0d7vol /cdrom
	mount an HFS CD-ROM
mount \-t iso9660 /dev/rdsk/dks0d7vol /cdrom
	mount an ISO 9660 CD-ROM
mount server:/cdrom /net/cdrom	mount remote iso9660 filesystem
mount \-M /root/etc/fstab \-P /root \-p |
    sed 's;raw=/;raw=/root/' >> /etc/fstab
	append /root/etc/fstab with /root
	prefix to currently active fstab.
umount \-t nfs \-b /foo	unmount all nfs filesystems except /foo
.fi
.SH ERROR MESSAGES
.ne 6
From \f2mount\f1:
.Ex
mount: device on \f2mountdir\f1: Invalid argument
.Ee
.IP
This message appears for a wide variety of problems.
It doesn't usually indicate that you have specified the command line
incorrectly; rather that there is something wrong with the disk partition,
the filesystem in the disk partition, or the mount directory.
For example, this error message occurs if you try to mount
a device that doesn't contain a valid filesystem.
.PP
From \f2umount\f1:
.Ex
\f2mountdir\f1: Resource busy
.Ee
.IP
Possible causes of a this message are: open files in the filesystem,
programs being executed from the filesystems, and
users whose current directory is in the filesystem.
.IP
Usually it is not possible to unmount the \f2/usr\f1 filesystem because many
daemons, such as \f2/usr/lib/lpsched\f1, \f2/usr/etc/ypbind\f1, and
\f2/usr/etc/syslogd\f1, execute from the \f2/usr\f1 filesystem.
The simplest way to make sure the \f2/usr\f1
filesystem is not busy is to bring the system down to single-user mode
with the \f2single\f1(1M) command.
.IP
You can force all filesystems except the root filesystem to be
unmounted with the \f2umount\f1 \f3\-k\f1 option (note that this kills
processes).
To unmount the root filesystem, you must be running the miniroot.
.SH FILES
/etc/fstab	filesystem table
.br
/etc/mtab	mount table
.br
/etc/mntproc	script to mount /proc
.SH "SEE ALSO"
fsck(1M),
mountd(1M),
nfsd(1M),
mount(2),
umount(2),
filesystems(4),
fstab(4),
mtab(4).
.SH BUGS
.I umount
can mismanage the
.I /etc/mtab
mount table if another
.I mount
or
.I umount
call is in progress at the same time.
.PP
Mount calls another "helper" program of the form \f3mount_typename\f1,
where typename
is one of the accepted mount types.
If this program is not on the default
path, then mount returns with an error message about unknown filesystem.
The user must make sure that the helper mount program is in the path.
For example, \f2/usr/etc\f1 must be in the path to mount an iso9660 CD.
.SH NOTE
If the directory on which a filesystem is to be mounted is a
symbolic link, the filesystem is mounted on
.B "the directory to which the symbolic link refers,"
rather than being mounted on top of the symbolic link itself.
.PP
The helper program \f3mount_iso9660\f1 is in the optional package
.IR eoe.sw.cdrom .
This package must be installed in order to mount
iso9660 filesystems.
.PP
The mount command attempts to assure that the blocksize of the device
matches that specified in the device volume header.
