calmsacibis995/irix-6517-src/eoe/man/man1m/mountd.1m
.TH mountd 1M
.SH NAME
mountd \- \&NFS mount/umount request server
.SH SYNOPSIS
.nf
\f3/usr/etc/rpc.mountd\f1 [ \f3\-nlr\f1 ]
.fi
.SH DESCRIPTION
.LP
.I mountd
is an
.IR rpc (4)
server that answers rpc filesystem mount/umount requests.
One such sender of the requests is autofs.
.I mountd
reads the file
.I /etc/xtab
(described in
.IR exportfs (1M))
to determine which filesystems are available to
which machines and users.
It also provides information
as to which clients have filesystems mounted.
This information is stored in the servers /etc/rmtab file and can be
accessed using the
.IR showmount (1M)
command.
.LP
The
.I mountd
daemon is normally invoked by
.IR inetd (1M).
.SH OPTIONS
.TP 15
.BI \-n " port"
Normally,
.I mountd
only accepts requests from clients using a
privileged (i.e. secure) port.
This option disables this check and allows
.I mountd
to accept requests from any port.
.TP
.BI \-l " seconds"
By default when started via inetd, if mountd has not serviced 
any requests in 60 seconds it will terminate.
This option can be used to adjust the time period.
The minimum period is 1 second. If set to a value too large,
your /etc/rmtab file will possibly grow bigger than you would like
because of the way it is managed.
.TP
.B \-r
Remove entries thought to be corrupted from the /etc/rmtab file.
If you have host names with pound (#) signs in them or exported paths
with pound signs or colons (:) do not use this option.

.SH "SEE ALSO"
inetd(1M),
showmount(1M),
exportfs(1M),
services(4).
