calmsacibis995/irix-6517-src/eoe/man/man1m/mtrconfig.1m
'\"macro stdmacro
.fp 4 BI
.TH MTRCONFIG 1M
.SH NAME
mtrconfig \- configure or display Madge PCI Token Ring interface parameters.
.SH SYNOPSIS
.B /usr/etc/mtrconfig 
.I interface
[
.I parameters
]
.br
.B /usr/etc/mtrconfig 
.I interface
-v
.br
.B /usr/etc/mtrconfig 
[
.I interface
] -f
.I config_file
.SH DESCRIPTION
.I Mtrconfig
is used to configure the Madge token ring specific parameters in each 
token ring interface. General network parameters, such as network address,
are configured through
.I ifconfig
(1).
.P
.I Mtrconfig
is invoked at boot time from /etc/init.d/network to start the token ring
interface when it detects the existence of a Madge token ring PCI device. 
The default values defined in /var/sysgen/mtune/if_mtr are used
for all the interfaces in the system. These values can be modified in
/var/sysgen/stune(4). 
.P
The
.I interface
parameter is a string of the form ``mtr unit'', e.g.,
``mtr0'' or ``mtr1''. Use 
.I netstat
(1) to display the names of token ring interfaces on the machine.
.P
Only the super-user is allowed to use
.I mtrconfig 
and only one instance of mtrconfig can be running at one
time.
.P
The following parameters may be set with
.I mtrconfig
:
.TP 15
.BI ring_speed " [4|16]"
Change an interface's ring speed. Values other than 4 or 16 will be rejected. 
Since the maximum size of a tranmitting packet is the function
of ring speed, the request is rejected if the interface's current
maximum packet size is not suitable for the new ring speed. 
The limitation of the maximum packet size are 
4472 and 17800 for ring speed of 4Mb and 16Mb, respectively.
Use the option
.B -v
to find out the current maximum packet size of an interface. The
.B mtr_s16Mb
variable in /var/sysgen/mtune/if_mtr defines the default ring speed
used by all the adapters in the system. 
.TP 15
.BI mtu " mtr_mtu"
Change the maximum packet size for an interface.
Use the options
.B -v
to find out the current maximum packet size of the interface.
As mentioned above, the current ring speed gives the
limitation of the value for requesting the new size. The
.B mtr_mtu 
variable in /var/sysgen/mtune/if_mtr defines the default size used
in all the adapters in the system. 
.TP 15
.BI mac " open_addr"
Change the open address used by an interface. 
Each Madge Token Ring interface has a burn-in address
(BIA). It is a 6 byte MAC address that is the default open address for
sending and receiving the packets through
the interface. This command is used when the system administrator
wants to reassign the open address to LAA address (Local Administrated
Address). The given 
.I LAA address 
must be in the
format of xx.xx.xx.xx.xx.xx or xx:xx:xx:xx:xx:xx, where
xx is hex format of a number.  Two byte MAC address format is 
.B NOT
supported.
.TP 15
.BI broadcast " broadcast_addr"
Change broadcast address used in transmitting packets.
There are two broadcast addresses defined in Token
Ring network: 0xff:ff:ff:ff:ff:ff and 0xc0:00:ff:ff:ff:ff.
Madge Token Ring interface can receive packets with either format.
When sending a MAC broadcast packet, such as ARP packet,
the specified format is used. The
.B mtr_batype 
variable in /var/sysgen/mtune/if_mtr defines
the default broadcast address used by all interfaces in the system.
.TP 15
.B restart
Restart the interface. If any of the above parameters is changed,
.I mtrconfig
will restart the interface if necessary, so this option is normally only
used at the system start up time to start the adapter. Note that
when ``ifconfig up''
or ``ifconfig down'' is called, the interface is marked "up" or "down",
but the adapter is not restarted.
.TP 15
.B \-v
Report the current interface configuration.
.TP 15
.BI \-f " config_file"
Read from the
.I config_file 
to configure the parameters. If an interface is specified on the command line, 
only the specified 
interface will be reconfigured. If no interface is specified, all the 
interfaces in the configuration file are configured. In the configuration
file, the comment lines must start with '#' at
the first column. Each configuration line has the following format:
.P
interface: [ring_speed [4|16]] [mtu mtr_mtu] [mac open_addr] [broadcast broadcast_addr]
.P 
.SH "SEE ALSO"
netstat(1), network(1M), tokenring(7), ifconfig(1)

