calmsacibis995/irix-6517-src/eoe/man/man1m/network.1m
.TH network 1M
.SH NAME
network \- network initialization and shutdown script
.SH SYNOPSIS
.nf
\f3/etc/init.d/network\f1 [ \f3start\f1 | \f3stop\f1 ]
.fi
.SH DESCRIPTION
The
.I network
shell script is called during system startup from
.I /etc/rc2
to initialize the standard and optional network devices and daemons.
The script is called during system shutdown from
.I /etc/rc0
to gracefully kill the daemons and inactivate the devices.
.P
When called with the
.I start
argument, the
.I network
script does the following,
using the various configuration flags described below:
.IP \(bu 3
Defines the hostname and hostid based on the name in
.I /etc/sys_id
and its corresponding Internet address in
.IR /etc/hosts .
.IP \(bu 3
Checks that the host's Internet address is not the default 192.0.2.1
Internet test address.
If the address is the default address,
the software is configured for standalone mode.
An Internet address other than the default must be chosen in order to
configure the network properly.
See the guide \f2IRIX Admin: Networking and Mail\f1
for information on selecting an address.
.IP \(bu 3
Initializes the network interfaces.
The HyperNet interface is initialized if the hypernet configuration
flag is on.
If multiple ethernet or FDDI interfaces are present, the script computes typical
primary and gateway interface names and addresses for most systems.
.I /etc/config/netif.options
provides a place for site-dependent network interface
definitions.
You need to modify this file only if:
.RS
.IP \- 3
the computed primary and/or gateway interface names are incorrect
.IP \- 3
you don't like convention used to define addresses for interfaces
.IP \- 3
the host has more than 2 ethernet or FDDI interfaces
.LP
Each interface must have a unique Internet address and hostname
in \f2/etc/hosts\fP.
The script derives the names from \f2/etc/sys_id\fP.
The prefix \f3gate\-\f1 is prepended to the hostname to generate
the second interface's name.
The suffix \f3\-hy\f1 is appended to generate the HyperNet interface's name.
For example:
.Ex
191.50.1.7	yosemite.parks.us       yosemite
137.254.2.49	gate-yosemite.parks.us  gate-yosemite
191.51.0.88	yosemite-hy.parks.us    yosemite-hy
.Ee
See the comments in
.I /etc/config/netif.options
for details.
.RE
.IP \(bu 3
Deletes existing routes.
.IP \(bu 3
Starts the standard networking daemons such as the
routing, portmap and DNS nameserver daemons.
Initializes the default multicast route.
.IP \(bu 3
(If the NFS option is installed).
Defines the NIS domain name using
.I /var/yp/ypdomain
if it exists.
If the NIS domain is the same as the Internet domain name in
.IR /etc/sys_id ,
then
.I ypdomain
is not needed.
Starts name service daemons, mounts and exports NFS filesystems,
starts NFS automount, lock and status daemons.
.IP \(bu 3
Starts the \f2inetd\f1, \f2timed\f1, \f2timeslave\f1, \f2rarpd\f1, and
\f2rwhod\f1 daemons.
.IP \(bu 3
Starts the 4DDN software (if installed).
.P
When called with the
.I stop
argument, the
.I network
script gracefully terminates daemons in the correct order,
unmounts NFS filesystems and inactivates the network interfaces.
.SH "CONFIGURATION FLAGS"
A daemon or subsystem is enabled if its configuration flag in the
\f2/etc/config\fP directory in the \f3on\f1 state.
If a flag file is missing, the flag is considered \f3off\f1.
Use the
.IR chkconfig (1M)
command to turn a flag \f3on\f1 or \f3off\f1.
For example,
.Ex
chkconfig timed on
.Ee
enables the timed flag.
When invoked without arguments,
.I chkconfig
prints the state of all known flags.
.P
There are two special flags: verbose and network.
The verbose flag controls the printing of the names of daemons as they
are started and the printing of NFS-mounted filesystem names as they are
mounted and unmounted.
The network flag allows incoming and outgoing traffic.
This flag can be
set off if you need to isolate the machine from network without removing
cables.
.P
The following table lists the configuration flags used to initialize
standard and optional software.
.in +5
.sp .8v
.TP \w'timeslaveXXX'u
Flag
Action if \f3on\f1
.TP \w'timeslaveXXX'u
.B routed
Start IP routing deamon
.TP
.B gated
Start Cornell/Merit IP super-routing daemon instead of routed.
.TP
.B mrouted
Start Stanford IP multicast routing daemon
.TP
.B named
Start 4.3BSD Internet domain name server
.TP
.B rtnetd
Initialize preemptable networking for real-time use
.TP
.B rwhod
Start 4.3BSD \f2rwho\f1 daemon
.TP
.B timed
Start 4.3BSD time synchronization daemon
.TP
.B timeslave
Start SGI time synchronization daemon
.TP
.B hypernet
Initialize HyperNet controller and routes
.TP
.B nfs
Start NFS daemons, mount NFS filesystems
.TP
.B automount
Start NFS automounter daemon
.TP
.B lockd
Start NFS lock and status daemons
.TP
.B nsd
Enable name services, start \f2nsd\f1 daemon
.TP
.B rarpd
Start the Reverse ARP daemon
.TP
.B ypmaster
Start password server; \f3nsd\f1 should also be \f3on\f1.
.TP
.B 4DDN
Initialize 4DDN (DECnet connectivity) software
.in -5
.P
Site-dependent options for daemons belong in ``options'' files in
.IR /etc/config .
Certain daemons require options so their options file must contain valid
information.
See the guide
.I IRIX Admin: Networking and Mail
and the daemon's manual page in section 1M for details on
valid options.
.sp .8v
.in +5
.ta \w'ifconfig\-hy.optionsXXX'u +\w'optionalXXX'u
File	Status
.br
.TP \w'ifconfig\-hy.optionsXXXoptionalXXX'u
automount.options	optional
.TP
biod.options	optional
.TP
gated.options	optional
.TP
ifconfig\-1.options	optional
(for primary network interface)
.TP
ifconfig\-2.options	optional
(for gateway network interface)
.TP
ifconfig\-3.options	optional
(for 2nd gateway network interface)
.TP
ifconfig\-4.options	optional
(for 3rd gateway network interface)
.TP
ifconfig\-hy.options	optional
(for HyperNet interface)
.TP
inetd.options	optional
.TP
mrouted.options	optional
.TP
named.options	optional
.TP
netif.options	optional
(to select different primary & gateway interfaces, etc.)
.TP
nfsd.options	optional
.TP
nsd.options	optional
.TP
portmap.options	optional
.TP
rarpd.options	optional
.TP
routed.options	optional
.TP
rpc.passwd.options	optional
.TP
rwhod.options	optional
.TP
static-route.options	optional
(to specify static routes)
.TP
timed.options	optional
.TP
timeslave.options	required
.in -5
.P
Site-dependent configuration commands to start and stop
local daemons
and publish arp entries should be put in a separate shell script called
.IR /etc/init.d/network.local .
Make symbolic links in
.I /etc/rc0.d
and
.I /etc/rc2.d
to this file to have it called during system startup and shutdown:
.Ex
ln \-s /etc/init.d/network.local /etc/rc0.d/K39network
ln \-s /etc/init.d/network.local /etc/rc2.d/S31network
.Ee
See
.I /etc/init.d/network
for the general format of the script.
.SH FILES
.ta \w'/etc/rc0.d/K40networkXXX'u
.nf
/etc/init.d/network
/etc/rc0.d/K40network	linked to network
/etc/rc2.d/S30network	linked to network
/etc/config	configuration flags and options files
/etc/sys_id	hostname
/etc/hosts	Internet address-name database
/var/yp/ypdomain	NIS domain name
.fi
.SH "SEE ALSO"
chkconfig(1M),
rc0(1M),
rc2(1M).
.PP
\f2IRIX Admin: Networking and Mail\f1
