calmsacibis995/irix-6517-src/eoe/man/man1m/nfsd.1m
.TH nfsd 1M
.SH NAME
nfsd, biod, bio3d \- \&NFS daemons
.SH SYNOPSIS
.nf
\f3/usr/etc/nfsd\f1 [ \f3\-a\f1 ] [ \f3\-p\f1 \f2proto\f1 ] [ \f3\-c\f1 \c
\f2nconns\f1 ] [ \f2nservers\f1 ]
\f3/usr/etc/biod\f1 [ \f2nclients\f1 ]
.fi
.SH DESCRIPTION
.I nfsd
starts the
.IR nfs (4)
server daemons that handle client NFS requests.
.LP
.I biod
starts asynchronous block I/O daemons.
This command is used on a NFS
client to perform buffer cache read-ahead and write-behind.
.LP
.I bio3d
processes are the asynchronous kernel processes for NFS version 3.
No daemon is necessary to start \f2bio3d\f1s.
There is one \f2bio3d\f1 associated with
each mounted filesystem at mount time.
If the NFS traffic to a filesystem increases, up to three
more \f2bio3d\f1 processes are spawned for that filesystem.
When traffic subsides, these extra processes exit.
.SH OPTIONS
.TP 12
\f3\-a\f1
Allow the NFS server daemon to service client requests over both the
UDP and TCP protocols.
This is the default.
.TP
\f3\-p\f1 \f2proto\f1
Allow the NFS server daemon to service client requests over either the
UDP or the TCP protocols.
The
.B \-a
option overrides this selection.
.TP
\f3\-c\f1 \f2nconns\f1
Set an upper limit on the number of simultaneous connections the
NFS server has open.
By default this number is unlimited.
.I nconns
can be equated with the total number of clients mounting files from
this server.
.TP
\f2nservers\f1
This is the number of NFS server daemons to start.
On an Origin system, one nfsd server per CPU maximizes efficiency
and performance.
Having too many daemons can be wasteful of
system resources.
The default is the number of CPUs in the system or 4, whichever
is larger.
.TP
\f2nclients\f1
The number of asynchronous block I/O daemons.
A good number for
.I nclients
is 4.
The default is 1.
.LP
These daemons are started during system initialization from the
.I /etc/init.d/network
script if the configuration flag
.B nfs
is set on
(see
.IR network (1M)).
.SH FILES
When a file that is opened by a client is unlinked (by the
server), a file with a name of the form
.I .nfsXXX
(where
.I XXX
is a number) is created by the client.
When the open file is closed,
the
.I .nfsXXX
file is removed.
If the client crashes before the file can be closed,
the
.I .nfsXXX
file is not removed.
.SH FILES
.TP 12
.I .nfsXXX
client machine pointer to an open-but-unlinked file
.SH SEE ALSO
exportfs(1M),
mountd(1M),
network(1M),
exports(4).
