calmsacibis995/irix-6517-src/eoe/man/man1m/nfsstat.1m
.TH nfsstat 1M
.SH NAME
nfsstat \- display Network File \&System statistics
.SH SYNOPSIS
.nf
\f3/usr/etc/nfsstat\f1 [ \f3\-Ccsnrz\f1 ] [ \f2unix\f1 ] [ \f2core\f1 ]
.fi
.SH DESCRIPTION
.I nfsstat
displays statistical information about the
Network File \&System (NFS) and
Remote Procedure Call (RPC)
interfaces to the kernel.
It can also be used to reinitialize this information.
If no options are given, the default is
.Ex
\f4nfsstat \-csnr\f1
.Ee
That is, print everything
and reinitialize nothing.
The optional arguments
.I unix
and
.I core
can be used to indicate another system namelist and kernel memory image,
respectively.
.SH OPTIONS
.TP
.B \-C
Display using a "full-screen" form, which is updated every second.
The values can be displayed as simple totals (\f3r\fP or "reset"),
changes during the previous interval (\f3d\fP or "delta"),
or changes since a fix moment (\f3z\fP or "zero").
.TP
.B \-c
Display client information.
Only the client side NFS and RPC information will be printed.
Can be combined with the
.B \-n
and
.B \-r
options to print client NFS or client RPC information only.
.TP
.B \-s
Display server information.
Works like the
.B \-c
option above.
.TP
.B \-n
Display NFS information.
NFS information for both the client and server side will be printed.
Can be combined with the
.B \-c
and
.B \-s
options to print client or server NFS information only.
.TP
.B \-r
Display RPC information.
Works like the
.B \-n
option above.
.TP
.B \-z
Zero (reinitialize) statistics.
Can be combined with any of the above options to
zero particular sets of statistics after printing them.
The user must have superuser privilege
for this option to work.
.SH FILES
.ta \w'/dev/kmem     'u
/unix 	system namelist
.br
/dev/kmem	kernel memory
.SH SEE ALSO
netstat(1),
smtstat(1).
