calmsacibis995/irix-6517-src/eoe/man/man1m/nsmount.1m
.TH nsmount 1M
.SH NAME
nsmount \- mount name service filesystem
.SH SYNOPSIS
.nf
\fBnsmount\fP [\fB\-vx\fP][\fB-d mountpoint\fP] [\fB-i pid\fP] \fB-p port\fP
.fi
.SH DESCRIPTION
.I nsmount
attaches the filesystem provided by the \fBnsd(1M)\fP daemon.  Nsd
satisfies the requests using directory service protocols and caches
them in memory then provides the data as a filesystem using the \fBnfs(4)\fP
protocol.  There may be no actual remote filesystem containing the data.
This command is executed directly by the nsd daemon so there is rarely
any need for it to be run seperately.
.SH OPTIONS
.TP 10
.B \-d mountpoint
Uses the given local directory as the mountpoint for the filesystem.  The
default is \fB/ns\fP.  The name service API routines \fBns_lookup(3C)\fP
and \fBns_list(3C)\fP expect there to be a \fB/ns\fP filesystem mounted
which provides any remote name service data, so changing the mountpoint
should be done with care.
.TP
.B \-i pid
This is the process ID of the nsd process supplying the data.  Nsmount
will register an exitop for this process which marks this mount as stale
if the nsd daemon should die.  Any requests subsequently made to this
filesystem will timeout immediately.  The pid defaults to the parent
process ID.
.TP
.B \-p port
This specifies the port on which nsd is listening on the local host.  This
is logged with \fBsyslogd(1M)\fP as part of the nsd process startup.
.TP
.B \-v
This option enables verbose mode.
.TP
.B \-x
This option specifies that the SGI extended attribute protocol should be
suported.  This makes nsd extended attributes available using the \fBattr\fP
command.
.SH "SEE ALSO"
nsd(1M)
