calmsacibis995/irix-6517-src/eoe/man/man1m/nvram.1m
.TH nvram 1M
.SH NAME
nvram, sgikopt \- get or set non-volatile RAM variables
.SH SYNOPSIS
.nf
\f3nvram\f1 [\f3\-v\f1] [\f2name\f1 [\f2value\f1]]
\f3sgikopt\f1 [\f2name\f1...]
.fi
.SH DESCRIPTION
.I nvram
can be used to set or print the values of non-volatile RAM variables.
.PP
When invoked with no arguments,
.I nvram
displays all known variables in the
.IR name = value
form.
The
.I nvram
arguments are:
.TP 8
.I name
Print the value of
.IR name .
.TP
.I value
If
.I name
is defined in non-volatile RAM,
replace
.IR name 's
definition string with
.IR value .
.TP
.B \-v
Print a line of the form
.IR name = value
after getting or setting the named variable.
.PP
If invoked as
.IR sgikopt ,
more than one
.I name
can be given.
.IR name s
that do not match known variables are ignored.
.PP
The exit status is 1 if any arguments do not match and 0 otherwise.
.SH NOTES
Non-volatile RAM contains a small set of well-known strings at fixed offsets.
.I nvram
can not be used to define new variables.
.PP
Only the superuser can set variables.
.PP
The term "non-volatile RAM" is somewhat misleading, because some variables
are placed only in volatile RAM and are reset on power-up.
Different systems have different mixes of volatile and non-volatile variables.
.SH DIAGNOSTICS
If an attempt to get or set a variable fails for any reason,
.I nvram
prints an appropriate message on standard error and exits with non-zero status.
.PP
Not all systems support the ability to change the contents of non-volatile
memory with the \f2nvram\fP command.
To change the contents of non-volatile memory
on systems that do not support \f2nvram\f1,
you must use the PROM monitor \f2setenv\fP command.
.SH SEE ALSO
prom(1M),
sgikopt(2),
syssgi(2).
