calmsacibis995/irix-6517-src/eoe/man/man1m/passmgmt.1m
.TH passmgmt 1M
.SH NAME
passmgmt \- password files management
.SH SYNOPSIS
.nf
\f3passmgmt \-a\f1 \f2options name\f1
.sp .8v
\f3passmgmt \-m\f1 \f2options name\f1
.sp .8v
\f3passmgmt \-d\f1 \f2name\f1
.fi
.SH DESCRIPTION
The
.B passmgmt
command updates information in the password files.
This command works with both
.I /etc/passwd
and
.IR /etc/shadow .
If there is no
.IR /etc/shadow ,
any changes made by
.B passmgmt
will only go into
.IR /etc/passwd .
If the shadow file is not present, the \f3-f\fP and \f3-e\fP options have no
effect, because the data fields they modify are not present in the base password
file.
.Ex
\f4passmgmt \-a\f1
.Ee
adds an entry for user
.I name
to the password files.
.Ex
\f4passmgmt \-a \f1\f2+name\f1
.Ee
adds an NIS entry to the password files.
This command does not create any directory for the new user
and the new login remains locked (with the string
.B *LK*
in the password field) until the
.IR passwd (1)
command is executed to set the password.
.Ex
\f4passmgmt \-m\f1
.Ee
modifies the entry for username in the password files.
The name field in the
.I /etc/shadow
entry and all the fields (except the password field) in the
.I /etc/passwd
entry can be modified by this command.
Only fields entered on the command line will be modified.
.Ex
\f4passmgmt \-d\f1
.Ee
deletes the entry for username from the password files.
It will not remove any files that the user owns on the system;
they must be removed manually.
.Ex
\f4passmgmt \-f days\f1
.Ee
sets the period of inactivity for username in the shadow
password file.
.Ex
\f4passmgmt \-e when\f1
.Ee
sets the expiration date for the account.  The \f4when\fP argument is
an input string to the \fIgetdate\fP(3) routine.  If the environment
variable \fIDATEMSK\fP is not set, the file \fI/etc/datemsk\fP is used
by \fIgetdate\fP to process this input argument.  Errors from \fIgetdate\fP
processing are reported.  Expiration dates must be greater than today.
.PP
The following options are available:
.TP 12
.BI \-c comment
A short description of the login.
It is limited to a maximum of 128 characters and defaults to an empty field.
.TP
.BI \-h homedir
Home directory of
.IR name .
It is limited to a maximum of 256 characters and defaults to
.IR /usr/people .
.TP
.BI \-u uid
UID
of the
.IR name .
This number must range from 0
to the maximum non-negative value for the system.
It defaults to the next available
UID
greater than 99.
For an NIS entry, the default is 0.
Without the \f3\-o\fP option, it enforces the uniqueness of a
UID.
.TP
.B \-o
This option allows a
UID
to be non-unique.
It is used only with the \f3\-u\fP option.
.TP
.BI \-g gid
GID
of the
.IR name .
This number must range from 0 to the maximum non-negative value
for the system.
The default is 1 for a local entry and 0 for an NIS entry.
.TP
.BI \-s shell
Login shell for
.IR name .
It should be the full pathname of the program
that will be executed when the user logs in.
The maximum length of \f2shell\fP is 255 characters.
The default is for this field to be set to
.IR /bin/sh .
.TP
.BI \-l logname
This option changes the
.I name
to
.IR logname .
It also can change a local entry to an NIS entry by
.sp .8v
.RS
	\f4passmgmt \-m \-l\f1 \f2+name name\f1
.RE
.IP
or change an NIS entry to a local entry by
.sp .8v
.RS
	\f4passmgmt \-m \-l\f1 \f2name +name\f1
.RE
.IP
It is used only with the \f3\-m\fP option.
.PP
The total size of each login entry is limited to a maximum
of 4095 bytes (\f3BUFSIZ\fP-1, defined in \f2/usr/include/stdio.h\f1)
in each of the password files.
.SH SHARE II ACTIONS
If the Share II system is installed and enabled, then
\f2passmgmt\f1
automatically creates and deletes lnodes
as well as updating the password and shadow password files.
Normally, only superusers are able to use
\f2passmgmt\f1,
but if Share II is installed and enabled, then any user with a set
\f3admin\f1
or
\f3uselim\f1
flag can also use it.
.PP
\f2passmgmt \-a\f1
checks for an lnode with a UID equal to the UID of the
newly-created entry in the password files.
If such an lnode already exists, then it is left untouched.
If such an lnode does not exists and the invoker has
a set \f3uselim\f1 flag, then a new lnode is created and the parent
(\f3sgroup\f1) of the newly created lnode
is initialized as the lnode
\f3other\f1,
or if no such lnode exists,
\f3root\f1.
.PP
If
\f2passmgmt \-m\f1
is used to alter the UID of an existing user (the
\f3\-u\f1
option),
then a new lnode is created with the new UID.
If such an lnode already exists, then it is left untouched.
If the original UID was unique, then the old lnode is deleted.
The contents of the old lnode are not copied to the new lnode.
.Ex
\f4passmgmt \-d\f1
.Ee
deletes the lnode having the UID of the deleted password entry,
if that UID was unique.
.PP
Users with only a set
\f3admin\f1
flag (subadministrators) are subject to the following restrictions:
.IP \(bu 3
If using
\f3passmgmt \-a\f1
to add a nonunique UID (with
\f3\-o\f1),
then an lnode with that UID must already exist,
and must be a member of the invoker's scheduling group.
.IP \(bu 3
If using
\f3passmgmt \-a\f1
to add a unique UID, then there must not exist any orphan lnodes
which already have that UID as their lost parent (\f3sgroup\f1).
If this criterion is satisfied, than a  new lnode is created blank
and initialized with the invoker's lnode as its parent (\f3sgroup\f1).
.IP \(bu 3
If using
\f3passmgmt \-m\f1
to perform any modification to a user,
then the modified user's lnode must exist and be a member of the invoker's
scheduling group.
.IP \(bu 3
If a user's UID is changed using
\f3passmgmt \-m \-u\f1,
then if the new UID is not unique (the
\f3\-o\f1
option was used),
an lnode with that UID must already exist
and be a member of the invoker's scheduling group.
Otherwise, if the new UID is unique,
a new lnode is created blank and initialized with
the invoker's lnode as its parent (\f3sgroup\f1).
In both cases, the
original lnode of the user is deleted if it was unique
in the passwd file.
.IP \(bu 3
If using
\f3passmgmt \-d\f1
to delete a user, then the deleted user's lnode must exist, be a member of
the invoker's scheduling group and have no child lnodes.
.SH CAVEAT
The
\f3passmgmt \-m \-u\f1
command will erase all usage, limit, privilege, and accumulated accounting
information of the user whose UID is altered.
.SH FILES
.nf
/etc/passwd
/etc/shadow
/etc/opasswd
/etc/oshadow
/etc/limconf
.fi
.SH SEE ALSO
passwd(1),
ypchpass(1),
yppasswd(1),
passwd(4),
shadow(4).
.SH DIAGNOSTICS
The
.I passmgmt
command exits with one of the following values:
.TP 5
0
SUCCESS.
.TP
1
Permission denied.
.IP
In the case where the Share II system is enabled,
it means that the invoker is not the superuser, and does not have a set
\f3uselim\f1
or
\f3admin\f1
flag.
Otherwise, the invoker is a user with only a set
\f3admin\f1
flag (subadministrator),
but is violating one of the restrictions described above.
.TP
2
Invalid command syntax.
Usage message of the
.B passmgmt
command will be displayed.
.TP
3
Invalid argument provided to an option.
.TP
4
UID
in use.
.IP
In the case where the Share II system is enabled, it means that
the lnode is
\f2active\f1
(that is, has processes attached) and, hence, cannot be deleted.
.TP
5
Inconsistent password files (e.g.,
.I name
is in the
.I /etc/passwd
file and not in the
.I /etc/shadow
file, or vice versa).
.TP
6
Unexpected failure.
Password files unchanged.
.IP
In the case where the Share II system is enabled, it means that
\f2passmgmt\f1
ran out of memory, or was unable to create or delete an lnode
for an unknown reason.
.TP
7
Unexpected failure.
Password file(s) missing.
.TP
8
Password file(s) busy.
Try again later.
A
.TP
9
.I name
does not exist (if \f3\-m\f1 or \f3\-d\f1 is specified),
already exists (if \f3\-a\f1 is specified), or
.I logname
already exists (if \f3\-m \-l\f1 is specified).
.SH NOTE
You cannot use a colon or <cr> as part of an argument
because it will be interpreted as a field separator in the password file.
.P
If the shadow file is used, the NIS entries get the password from
the shadow file exclusively and must have an entry for each NIS
user name.
This will not permit the use of the
general NIS entry, \f3+::0:0:::\f1, or netgroup expansions.
