calmsacibis995/irix-6517-src/eoe/man/man1m/peer_snmpd.1m
.TH peer_snmpd 1M
.SH NAME
peer_snmpd \- Simple Network Management Protocol daemon
.SH SYNOPSIS
.nf
\fB/usr/etc/peer_snmpd config-file parameter-file\fP
.fi
.SH DESCRIPTION
\f2peer_snmpd\fP is a daemon which implements versions one and two 
(V1 and V2p) of the Simple Network Management Protocol (SNMP) 
as specified in Internet RFC series 1441-1452.  The daemon, called 
the SNMP agent, can be configured to run
from the network startup script at boot time by the command
\f2chkconfig snmpd on\fP or started from the command line.  You must be
superuser (root) to run \f2peer_snmpd\fP.  \f2peer_snmpd\fP listens on
a \f2udp\fP(7P) socket for the \f2snmp\fP service for SNMP queries.  If
no such service can be found, a default port of 161 is used.

The configuration file (typically /etc/peer_snmpd_config) is read
at startup to determine behavior, and the parameters file (typically
/etc/peer_nov) is used to store the values of setable variables in
the Management Information Base (MIB).  The snmp startup script reads
the file /etc/config/peer_snmpd.options to determine these parameters
at boot.
.SH SECURITY
peer_snmpd is a bilingual SNMP Agent that implements Community String 
based security (SNMPv1 packets) as well Party based security (SNMPv2p
packets).  Please see \f4peer_snmpd_config\fP(4) for v1 configuring community 
strings and v2 parties. 
.SH FILES
.DT
/usr/etc/peer_snmpd
.br
/etc/peer_snmpd_config
.SH "SEE ALSO"
\f4peer_snmpd_config\fP(4)
.PP
RFC 1157, RFC 1213, RFC 1441 - RFC 1452.
