calmsacibis995/irix-6517-src/eoe/man/man1m/ping.1m
'\"macro stdmacro
.\" Copyright (c) 1985 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)ping.8      6.5 (Berkeley) 8/16/89
.\"
.TH PING 1M
.SH NAME
ping \- send ICMP ECHO_REQUEST packets to network hosts
.SH SYNOPSIS
.B /usr/etc/ping
.RB [ \-dDfLnoPqQrRv ]
.RB [ \-c
.IR count ]
.RB [ \-s
.IR size ]
.br
.ti +5n
.RB [ \-i
.IR interval ]
.RB [ \-l
.IR preload ]
.RB [ \-p
.IR pattern ]
.RB [ \-T
.IR ttl ]
.br
.ti +5n
.RB [ \-t
.IR tos ]
.RB [ \-w
.IR maxwait ]
.br
.ti +5n
.RB [ \-I
.IR ifaddr ]
.RB [ \-g
.IR gateway ]
.RB [ \-h
.IR host ]
.I host
.SH DESCRIPTION
.I Ping
is a tool for network testing, measurement and management.
It utilizes the
ICMP protocol's ECHO_REQUEST datagram to elicit an
ICMP ECHO_RESPONSE from a host or gateway.
ECHO_REQUEST datagrams (``pings'') have an IP and ICMP header,
followed by an 8-byte timestamp, and then an arbitrary number
of ``pad'' bytes used to fill out the packet.
.PP
The
.I host
can be the name of a host or its
Internet address.
The options are:
.TP
.BI \-c " count"
Stop after sending (and waiting the specified delay to receive)
.I count
ECHO_RESPONSE packets.
.TP
.B \-d
Set the SO_DEBUG option on the socket being used.
.TP
.B \-D
Set the
.I Don't Fragment
bit in the IP header.
This can be used to determine the path MTU.
.TP
.B \-f
Flood ping.  Send ECHO_REQUEST packets as fast as they are answered with
ECHO_RESPONSE packets or one hundred times per second, whichever is more.
(The repetition rate can be adjusted with the \f3\-i\f1 option.)
For every ECHO_REQUEST sent a period (\.) is printed, while for every
ECHO_REPLY received a backspace is printed.
This provides a rapid display of how many packets are being dropped.
.I "This can be extremely stressful on a network and should be used with caution."
.TP
.BI \-g " gateway"
Use Loose Source Routing to send the ECHO_REQUEST packets via
.IR gateway .
.TP
.BI \-h " host"
is an alternate way of specifying the target host instead of as the
last argument.
.TP
.BI \-i " interval"
Wait
.I interval
seconds between sending each packet.
The default is to wait for one second between each packet, except when
the \-f option is used when the default is "0.01" second or 10 milliseconds.
.TP
.BI \-I " interface"
Send multicast datagrams via the network interface specified by
the interface's hostname or IP address.
Send non-multicast datagrams with the specified source address.
.TP
.BI \-l " count"
Preload the network by sending
.I count
packets as fast as possible before
falling into the normal mode of behavior.
.TP
.B \-L
When sending to a multicast destination address, don't loop the datagram
back to ourselves.
.TP
.B \-n
Numeric output only.
No attempt will be made to look up symbolic
names for host addresses.
This is useful to avoid waiting to convert the addresses of distant
hosts to names.
.TP
.B \-o
Exit successfully after receiving one reply packet.
.TP
.BI \-p " pattern"
You may specify up to 16 ``pad'' bytes to fill out the
packet you send.  This is useful for diagnosing data-dependent
problems in a network.
For example, ``\-p\ ff'' will cause the sent packet to be filled with all ones.
.TP
.BI \-P
Use a psuedo-random sequence for the data instead of the default,
fixed sequence of incrementing 8-bit integers.
This is useful to foil compression on PPP and other links.
.TP
.B \-q
Quiet output.  Nothing is displayed except the summary line on termination.
.TP
.B \-Q
Do not display responses such as Network Unreachable ICMP messages
concerning the ECHO_REQUESTs sent.
.TP
.B \-r
Bypass the normal routing tables and send directly to a host on an attached
network.
If the host is not on a directly-attached network,
an error is returned.
This option can be used to ping a local host through an interface
that has no route through it (e.g., after the interface was dropped by
.IR routed (1M)).
.TP
.B \-R
Record Route.  Includes the RECORD_ROUTE option in the ECHO_REQUEST
packet and displays the route buffer on returned packets.
Note that the IP header is only large enough for eight such routes,
and only six when using the \f3\-g\f1 option.
Many hosts ignore or discard this option.
.TP
.BI \-s " size"
Send datagrams containing
.I size
bytes of data.
The default is 56, which translates into 64 ICMP data bytes
when combined with the 8 bytes of ICMP header data.
The maximum allowed value is 61396.
.TP
.BI \-t " tos"
Use the specified hexadecimal type of service.
.TP
.BI \-T " ttl"
Changes the default time-to-live.
.TP
.B \-v
Verbosely list ICMP packets other than ECHO_RESPONSE that are received
by the system.
By default, only ICMP packets (including ECHO_RESPONSEs) concerning the
ECHO_REQUEST packets sent by \f2ping\f1 are listed.
When verbosity is turned on,
almost all ICMP packets are listed, including error messages
concerning other network traffic.
.TP
.BI \-w " maxwait"
Specifies the number of seconds
to wait for a response to a packet before transmitting the next one.
The default is 10.0.
.PP
.I Ping
should be used primarily for manual fault isolation.
Because of the load it can impose on the network,
it is unwise to use
.I ping
during normal operations or from automated scripts.
When using \f2ping\f1 for fault isolation,
it should first be run on the local
host, to verify that the local network interface is up and
running.
Then, hosts and gateways further and further away
should be ``pinged''.
.PP
\f2Ping\f1 repeated sends individual datagrams
(by default one per second), and
prints one line of output for every ECHO_RESPONSE returned.
.PP
On a trusted system with IP Security Options enabled, if
the network idiom is not MONO,
.I ping
also prints a second line containing
the hexadecimal representation of the IP security option
in the ECHO_RESPONSE.
.PP
If the
.BI \-c " count"
option is given, only that number of requests is sent.
If there is no response,
then  no output other than the final summary is produced
Round-trip times and packet loss statistics are computed.
If duplicate packets are received, they are not included in the packet
loss calculation, although the round trip time of these packets is used
in calculating the minimum/average/maximum round-trip time numbers.
When the specified number of packets have been sent (and received) or
if the program is terminated with an interrupt (SIGINT),
a brief summary is displayed.
When not using the
.B \-f
(flood) option, the first interrupt, usually generated by control-C or DEL,
causes
.I ping
to wait for its outstanding requests to return.  It will wait no longer
than the longest round trip time encountered by previous, successful
pings.  The second interrupt stops
.I ping
immediately.
.SH DETAILS
An IP header without options is 20 bytes.
An ICMP ECHO_REQUEST packet contains an additional 8 bytes worth
of ICMP header followed by an arbitrary amount of data.
When a
.I packetsize
is given, it indicates the size of this extra piece of data
(the default is 56).
Thus the amount of data received inside of an IP packet of type ICMP
ECHO_REPLY will always be 8 bytes more than the requested data space
(the ICMP header).
.PP
If the data space is at least eight bytes large,
.I ping
uses the first eight bytes of this space to include a timestamp to compute
round trip times.
If less than eight bytes of pad are specified, no round trip times are given.
.SH DUPLICATE AND DAMAGED PACKETS
.I Ping
will report duplicate and damaged packets.
Duplicate packets should never occur, and seem to be caused by
inappropriate link-level retransmissions.
Duplicates may occur in many situations and are rarely (if ever) a
good sign, although the presence of low levels of duplicates may not
always be cause for alarm.
.PP
Damaged packets are obviously serious cause for alarm and often
indicate broken hardware somewhere in the
.I ping
packet's path (in the network or in the hosts).
.SH TRYING DIFFERENT DATA PATTERNS
The (inter)network layer should never treat packets differently depending
on the data contained in the data portion.
Unfortunately, data-dependent problems have been known to sneak into
networks and remain undetected for long periods of time.
In many cases the particular pattern that will have problems is something
that doesn't have sufficient ``transitions'', such as all ones or all
zeros, or a pattern right at the edge, such as almost all zeros.
It isn't necessarily enough to specify a data pattern of all zeros (for
example) on the command line because the pattern that is of interest is
at the data link level, and the relationship between what you type and
what the controllers transmit can be complicated.
.PP
This means that if you have a data-dependent problem you will probably
have to do a lot of testing to find it.
If you are lucky, you may manage to find a file that either can't be sent
across your network or that takes much longer to transfer than other
similar length files.
You can then examine this file for repeated patterns that you can test
using the \f3\-p\f1 option of \f2ping\f1.
.SH TTL DETAILS
The TTL value of an IP packet represents the maximum number of IP routers
that the packet can go through before being thrown away.
In current practice you can expect each router in the Internet to decrement the
TTL field by exactly one.
.PP
The maximum possible value of this field is 255, and most Unix systems set
the TTL field of ICMP ECHO_REQUEST packets to 255.
.PP
In normal operation ping prints the ttl value from the packet it receives.
When a remote system receives a ping packet, it can do one of three things
with the TTL field in its response:
.TP 2
\(bu
Not change it; this is what Berkeley Unix systems did before the 4.3BSD-tahoe
release.
In this case the TTL value in the received packet will be 255 minus the
number of routers in the round-trip path.
.TP 2
\(bu
Set it to 255; this is what IRIX and current Berkeley Unix systems do.
In this case the TTL value in the received packet will be 255 minus the
number of routers in the path
.I from
the remote system
.I to
the
.IR ping ing
host.
.TP 2
\(bu
Set it to some other value.
Some machines use the same value for ICMP packets that they use for
TCP packets, for example either 30 or 60.
Others may use completely wild values.
.SH EXIT STATUS
\f2Ping\f1 returns 0 on success (the host is alive),
and non-zero if the arguments are incorrect or the host is not responding.
.SH BUGS
Many Hosts and Gateways ignore the RECORD_ROUTE option.
.PP
The maximum IP header length is too small for options like
RECORD_ROUTE to be completely useful.
There's not much that can be done about this, however.
.PP
Flood pinging is not recommended in general, and flood pinging the
broadcast address should only be done under very controlled conditions.
.PP
The record-route option does not work with many hosts and routers.
.SH SEE ALSO
netstat(1), ifconfig(1M), routed(1M)
