calmsacibis995/irix-6517-src/eoe/man/man1m/portmap.1m
.TH portmap 1M
.SH NAME
portmap \- TCP, UDP port to RPC program number mapper
.SH SYNOPSIS
.nf
\f3/usr/etc/portmap\f1 [ \f3\-vmAbC\f1 ] [ \f3\-f\f1 \f2forkcnt\f1 ] \c
[ \f3\-a\f1 \f2mask\f1,\f2match\f1 | \f3\-a\f1 \f2match\f1 ]
.fi
.SH DESCRIPTION
.I portmap
is a server that converts RPC program numbers
into TCP or UDP protocol port numbers.
It must be running in order to make RPC calls.
.PP
When an RPC server is started, it tells
.I portmap
what port number it is listening to,
and what RPC program numbers it is prepared to serve.
When a client wishes to make an RPC call to a given program number,
it first contacts
.I portmap
on the server machine to determine
the port number where RPC packets should be sent.
.PP
After
.I portmap
starts,
.IR inetd (1M)
can register its standard RPC servers.
.PP
Options to customize
.IR portmap 's
behavior
are read from the file
.I /etc/config/portmap.options
during system initialization.
The options are:
.TP
.B \-v
Verbose: prints error messages using
.IR syslog (3B)
when a service fails or when an unprivileged process or
remote host tries to set or unset a port mapping.
.TP
\f3\-f \f2forkcnt\f1
Specify the maximum number of child processes to handle
broadcast or multicast requests.
The default is 10.
.TP
\f3\-a \f2mask\f1,\f2match\f1
.PD 0
.TP
\f3\-a \f2match\fP
This option permits restriction of most of the portmap services to
a subset of hosts or networks.
(The portmap null procedure is not restricted.)
The
.IR mask ,
and
.I match
arguments are IP addresses in Internet dot notation (see
.IR inet (3N))
that represent masks, hosts or networks.
The \f2mask\fP and \f2match\fP arguments must be separated by a comma
with no intervening whitespace.
If \f2mask\fP and the comma are missing,
the argument is interpreted as a Class A, B, or C network number
and the mask is set to the value appropriate for the network's class.
.PD
.RS
.LP
The
.B \-a
option can be repeated up to 50 times.
For each mask and match specified,
the requesting client host's address is logically-ANDed with \f2mask\fP;
if the result equals \f2match\fP, the client's request is processed.
If none of the mask-match comparisons succeed, the request is rejected.
Requests from all of the local host's addresses are always permitted.
.PP
For example, if
.I /etc/config/portmap.options
contains
.Ex
-a 255.255.255.0,128.32.199.0
-a 192.0.2.0
-a 255.255.255.255,192.26.51.3
.Ee
access is restricted to any host on the Class B 128.32.199 subnet
or the Class C 192.0.2 network or to the host with the 192.26.51.3 address.
Requests from clients on any other networks are rejected.
.RE
.TP
.B \-A
This option is equivalent to a series of \f3\-a\f1 options
listing all of the addresses of interfaces on the machine, with
their netmasks.
It is convenient for authorizing hosts on directly connected
networks and point-to-point links without explicitly enumerating
the networks.
The restrictions defined by \f3\-A\f1 do not count against the limit
of 50 \f3\-a\f1 options.
.TP
.B \-b
This option causes the \f3\-a\f1 and \f3\-A\f1 options to apply only
to packets that arrive via multicast.
.TP
.B \-m
Enable reception of RPC requests sent to
.IR portmap 's
multicast address, provided their sources meet the restrictions
imposed by \f3\-a\f1 or \f3\-A\f1.
Multicast requests received from what should be local addresses are always
ignored.
The \f3\-a\f1 and/or \f3\-A\f1 options
should always be used with \f3\-m\f1 on machines that
can be reached by multicast packets from the Internet, such
as MBONE feeds.
The \f3\-b\f1 option is handy with \f3\-m\f1 on systems shielded from
the Internet by firewalls, where all networks that can be reached via
unicast or broadcast are trusted.
.TP
.B \-C
Turn on compatibility mode.  This will allow local applications to
register with \f4portmap\f1 using a network address other 
than the loopback address.  Applications that do not use the SGI-provided
RPC interfaces to register with portmap may require this option to 
function properly.  However, use of this option will also introduce a known 
\f4security\f1 problem.
.SH "SEE ALSO"
inetd(1M),
rpcinfo(1M).
.PP
\f2IRIX Network Programming Guide\f1
.SH BUGS
If
.I portmap
crashes, all servers that use it (for example,
.IR nsd (1M),
and
.IR inetd (1M))
must be restarted.
