calmsacibis995/irix-6517-src/eoe/man/man1m/pppstat.1m
'\"macro stdmacro
.TH pppstat 1M
.UC 4
.SH NAME
pppstat \- Point-to-Point Protocol (PPP) Status
.SH SYNOPSIS
.B pppstat
[\f3\-n\f1\] [\f3\-u \f2unit\f1] [\f3\-i \f2interval\f1] [\f3\-m \f2d|r|z\f1]
.SH DESCRIPTION
\f3pppstat\f1 displays the current status of PPP links.
Both configuration values (e.g. IP addresses, protocols, and packet sizes)
and operational values (e.g. recent compression performance, corrupted
packets, and current links in the multilink bundle) are displayed.
.PP
The options are:
.TP
.B \-n
display numbers instead of names.
.TP
.BI \-u " unit"
display the stat of PPP unit \f2unit\f1 instead of the first active unit.
.TP
.BI \-i " interval"
refresh the screen every \f2interval\f1 seconds instead of once per second.
.TP
.BI \-m " d|r|z"
display using \f2d\f1 or delta mode (changes since last screen update),
\f2r\f1 or reset mode or values since link start, or
\f2z\f1 or zeroed mode or values since last zeroed.
.PP
The current status of a PPP link is displayed on seven screens.
The first four or "link" screens indicate what is happening on one of the
links in a multilink bundle.
The fifth or "I/O" screen displays input and output status and counts
for the overall multilink bundle.
The sixth displays accounting information, such as how long the links
in the bundle have been active and how many phone calls have been
attempted.
The seventh displays various generally uninteresting values,
such as the next multilink serial number and how often the
type-of-service (TOS) queuing mechanisms have been invoked.
.PP
.B pppstat
accepts single-character commands while it is running.
Single digits select the corresponding screen.
Plus (+) and minus (\-) select the previous or next active interface
or unit.
The letters "D", "Z", and "R" select "delta" (changes since last screen
update),
"zeroed" (values since last "Z"), and "reset modes" (values since link start).
.PP
After the configuration has been checked (e.g. IP addresses)
the most important or at least commonly monitored values are
the number of packets with bad FCS in screens 1-4, the current bit rates
in screen 5, and the number of links in the bundle and PPP processes
adding links in screen 6.
.SH Screens 1-4
The per-link screens are empty when the corresponding link in the
multilink bundle is not active.
When a link is active, its screen includes information about:
.TP
.B peer:
the Ident string received from the peer, which for IRIX includes information
about the hardware and software.
.TP
.BR link\ type,
whether synchronous or asynchronous, and whether the phone call was
answered or originated.
.TP
.B raw\ input and output
in total bytes.
.TP
.B link\ rate
in bits per second if know and not inferred (e.g. specified in
control file).
.TP
.BR RTT
or measured round-trip-time.
.TP
.B MRU, MTU, MRRU, MTRU
or maximum transmit and receive unit (packet) sizes
and reassembled unit (multilink packet) sizes.
.TP
bad packets
or packets discarded because with bad checksums (\f3FCS\f1), insufficient
buffer memory (\f3no buf\f1),
too small to contain a packet (\f3tiny\f1),
\f3aborted\f1 by the peer, too \f3long\f1, or ridiculously
long \f3babble\f1 frames.
Note that when using a modem, null frames are often sent before packet
after a link has been idle to minimize the effects of line noise.
.TP
compression
various internal values of the data and header (or "VJ") compression
machinery are displayed on the bottom of the screens 1-4
.SH Screen 5
The I/O screen contains general input/output information, including:
.TP
.BR input " and " output
counts of the \f3raw\f1 or compressed bytes moved and the number of
bytes of \f3IP\f1 packets.  Note that without compression, the number
of raw bytes is more than the number of IP bytes.  The \f3recent\f1
input and output bit rates are displayed along with an indication of
whether those rates appeared to the PPP system \f3medium\f1 or \f3high\f1
compared to the capacity of the multilink bundle.
.TP
\f3avail\f1able and \f3previous\f1
bits per second of the overall multilink bundle as estimated by the
PPP system are displayed below the measured rates.
.TP
compression
When compression is done "above" the multilink bundle, so that
the per-link compression is the same as the compression of the
entire bundle, the bottom of screen 5 contains information about
the compression machinery like that found on screens 1-4.
.SH Screen 6
The accounting screen tells about the number of phone calls, their
duration, and what the machinery is doing about adding or removing
links.
.SH FILES
.nf
.ta \w'/tmp/.ppp-rendezvous   'u
/tmp/.ppp-rendezvous	rendezvous with PPP daemons
.fi
.SH SEE ALSO
ppp(1m)
