calmsacibis995/irix-6517-src/eoe/man/man1m/prtvtoc.1m
'\"! tbl|mmdoc
'\"macro stdmacro
.nr X
.if \nX=0 .ds x} prtvtoc 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
prtvtoc \- print disk volume header information
.SH SYNOPSIS
.nf
\f3/etc/prtvtoc\f1 [[\f3\-aefhms\f1] [\f3\-t\f1 \f2fstab\f1]] \c
[\f2rawdiskname\f1]
.fi
.SH DESCRIPTION
.I prtvtoc
prints a summary of the information in the volume header for a single
disk or all of the local disks attached to a system
(see \f4vh\fP(7M)).
The command is usually used only by the superuser.
.PP
The
.I rawdiskname
name should be the raw device filename of a disk volume header in the form
.I /dev/rdsk/dks?d?vh.
.PP
Note:
.I prtvtoc
knows about the special file directory naming conventions, so the
.I /dev/rdsk
prefix can be omitted.
.PP
If no name is given, the information for the root disk is printed.
.PP
In single disk mode,
.I prtvtoc
prints information about the disk geometry (number of cylinders, heads,
and so on), followed by information about the partitions.
For each partition, the type is indicated (for example,
filesystem, raw data, and so on).
Cylinders can be non-integral
values, as they may not correspond to actual physical values, for
some drive types.
For filesystem partitions,
.I prtvtoc
shows if there is actually a filesystem on the partition, and if it is
mounted, the mount point is shown.
Mount points shown in square brackets
indicate the mount point of the logical volume the partition belongs to.
.PP
The following options to \f2prtvtoc\fP can be used:
.TP 11
.B \-s
Print only the partition table, with headings but without the comments.
.TP
.B \-h
Print only the partition table, without headings and comments.
Use this option when the output of the
.I prtvtoc
command is piped into another command.
.TP
.BI "\-t " fstab
Use the file
.I fstab
instead of \f2/etc/fstab\f1.
.PP
The following options create summaries from all disk volume headers:
.TP 11
.B \-a
Show abbreviated partition listings for all disks attached to the system.
.TP
.B \-m
List all partitions in use by local filesystems.
The listing includes
partitions that belong to logical volumes.
.TP
.B \-e
Extended listing.
This combines the \f3-a\f1 and \f3-m\f1 options as well as
reporting unallocated (free) partitions, and overlapping mounted partitions.
.SH EXAMPLE
The output below is for a SCSI system (root) disk obtained by invoking
.I prtvtoc
without parameters.  A change from earlier releases is that we no longer
treat disk drives as though they were of fixed geometry (most SCSI disks
no longer have fixed geometry), synthesizing a geometry that made the
capacity work.  Now they are simply treated as a stream of blocks, so
there is no longer any information about cylinders and other drive
geometry, just partition information.
.Ex
Printing label for root disk

* /dev/root (bootfile "/unix")
*     512 bytes/sector
Partition  Type  Fs   Start: sec    Size: sec   Mount Directory
 0          efs  yes        4608      4108800  
 1          raw          4113408        81408  
 8       volhdr                0         4608  
10       volume                0      4194816  
.Ee
This next output is for a SCSI option disk obtained by invoking
.I prtvtoc
with drive
dks0d2vh
as the parameter.
.Ex
* /dev/rdsk/dks0d2vh (bootfile "/unix")
*     512 bytes/sector
Partition  Type  Fs   Start: sec    Size: sec   Mount Directory
 7          xfs  yes        4560      8684310   /usr/people
 8       volhdr                0         4560  
10       volume                0      8688870
.Ee
.SH SEE ALSO
dvhtool(1M),
fx(1M),
dks(7M),
vh(7M).
