calmsacibis995/irix-6517-src/eoe/man/man1m/pwck.1m
.nr X
.if \nX=0 .ds x} pwck 1M "System Administration Utilities" "\&"
.TH \*(x}
.SH NAME
pwck \- password file checker
.SH SYNOPSIS
.nf
\f3pwck\f1 [[\f4\-p\f1] file]
.fi
.SH DESCRIPTION
.I pwck
scans the password file and notes any inconsistencies.
The checks include validation of: the number of fields,
login name, user ID, group ID,
and whether the login directory
and the program-to-use-as-Shell exist.
The default password file is
.IR /etc/passwd .
.PP
.I pwck
has the ability to parse YP entries in the password file.
.PP
The \f4\-p\f1 option prevents checking of the login directory 
and shell fields, useful for NIS administrators in checking the
yppasswd file, where each login directory is not usually locally available.
.SH FILES
/etc/passwd
.SH SEE ALSO
passwd(4).
.SH DIAGNOSTICS
.TP
\f7Too many/few fields\f1
An entry in the password file does not have the proper number of
fields.
.TP
\f7Logname field null\f1
The login name field of an entry is empty.
.TP
\f7Bad character(s) in logname\f1
The login name in an entry contains one or more non-alphanumeric characters.
.TP
\f7Logname too long/short\f1
The login name in an entry has more than 8 characters.
.TP
\f7Invalid UID\f1
The user ID field in an entry is not numeric or is greater than
2147483647.
(Note that if the UID is > 65535, then files can not be created on 
EFS filesystems.)
.TP
\f7Invalid GID\f1
The group ID field in an entry is not numeric or is greater than
2147483647.
(Note that if the GID is > 65535, then files can not be created on 
EFS filesystems.)
.TP
\f7Login directory null\f1
The login directory field in an entry is empty.
.TP
\f7Login directory not found\f1
The login directory field in an entry refers to a directory that does not
exist.
.TP
\f7Login directory illegal, try pathchk(1)\f1
The login directory field in an entry refers to an illegal directory name.
Try running pathchk(1) on the login directory name.
.TP
\f7Optional shell file not found\f1
The login shell field in an entry refers to a program or shell script that
does not exist.
.TP
\f7Optional shell file not found, try pathchk(1)"\f1
The login shell field in an entry refers to a program or shell script with
an illegal path name.  Try running pathchk(1) on the login shell file name.
.TP
\f7No netgroup name\f1
The entry is a Yellow Pages entry referring to a netgroup, but no
netgroup is present.
.TP
\f7Bad character(s) in netgroup name\f1
The netgroup name in a Yellow Pages entry contains characters other than
lower-case letters and digits.
.TP
\f7First char in netgroup name not lower case alpha\f1
The netgroup name in a Yellow pages entry does not begin with a lowercase
letter.
