calmsacibis995/irix-6517-src/eoe/man/man1m/pwconv.1m
.\" Copyright 1989 AT&T
.nr X
.if \nX=0 .ds x} pwconv 1M "" "\&"
.TH \*(x}
.SH NAME
\f4pwconv\f1 \- install and update \f4/etc/shadow\f1 with information from \f4/etc/passwd\f1
.SH SYNOPSIS
.nf
\f4pwconv\f1
.fi
.SH DESCRIPTION
The \f4pwconv\fP command creates and updates \f4/etc/shadow\f1
with information from \f4/etc/passwd\f1.
.PP
If the \f4/etc/shadow\f1 file does not exist, \f4pwconv\fP creates
\f4/etc/shadow\f1 with information from \f4/etc/passwd\f1.
The command populates \f4/etc/shadow\f1
with the user's login name, password, and password aging information.
If password aging information does not exist in \f4/etc/passwd\f1
for a given user, none is added to \f4/etc/shadow\f1.
However, the last changed information is always updated.
.PP
If the \f4/etc/shadow\f1
file does exist, the following tasks are performed:
.IP \(bu 3
Entries that are in the \f4/etc/passwd\f1 file and not in the
\f4/etc/shadow\f1 file are added to the \f4/etc/shadow\f1 file.
.IP \(bu
Entries that are in the \f4/etc/shadow\f1 file and not in the
\f4/etc/passwd\f1 file are removed from \f4/etc/shadow\f1.
.IP \(bu
Password attributes (for example, password and aging information)
in an \f4/etc/passwd\f1
entry are moved to the corresponding entry in
\f4/etc/shadow\f1.
.PP
The \f4pwconv\fP program
is a privileged system command that cannot be executed by ordinary users.
.PP
The contents of the \f4/etc/passwd\f1 and \f4/etc/shadow\f1 files are saved
in \f4/etc/opasswd\f1 and \f4/etc/oshadow\fP, respectively.
The system can be restored to its preconversion state by replacing the
content of the \f4/etc/passwd\f1 file with the content of \f4/etc/opasswd\f1
and removal of \f4/etc/shadow\f1 (if it did not exist prior to the run of
\f4pwconv\fP) or its replacement by \f4/etc/oshadow\fP.
These files are overwritten each time the \f4pwconv\fP program is run.
The use of some of the system administration tools causes \f4pwconv\fP
to be run, and therefore the backup files to be overwritten, each time
an entry is added, deleted, or modified.
.SH NOTES
.I pwconv
does not copy NIS entries from \f4/etc/passwd\f1. However, a shadow file can
be served by NIS using nsd (see \fBshadow(4)\fP).
.SH FILES
.nf
\f4/etc/passwd\f1
\f4/etc/shadow\f1
\f4/etc/opasswd\f1
\f4/etc/oshadow\f1
.fi
.SH "SEE ALSO"
passwd(1).
.SH DIAGNOSTICS
The
\f4pwconv\f1
command exits with one of the following values:
.P
.PD 0
.IP 0 5
Success.
.IP 1 5
Permission denied.
.IP 2 5
Invalid command syntax.
.IP 3 5
Unexpected failure.
Conversion not done.
.IP 4 5
Unexpected failure.
Password file(s) missing.
.IP 5 5
Password file(s) busy.
Try again later.
.PD
