calmsacibis995/irix-6517-src/eoe/man/man1m/quotaon.1m
.TH quotaon 1M
.SH NAME
quotaon, quotaoff \- turn filesystem quotas on and off
.SH SYNOPSIS
.nf
\f3/usr/etc/quotaon\f1 [ \f3\-v\f1 ] filesystem ...
\f3/usr/etc/quotaon\f1 [ \f3\-v\f1 ] [ \f3\-a\f1 ]
.sp .8v
\f3/usr/etc/quotaoff\f1 [ \f3\-vd\f1 ] filesystem ...
\f3/usr/etc/quotaoff\f1 [ \f3\-vd\f1 ] [ \f3\-a\f1 ]
\f3/usr/etc/quotaoff\f1 [ \f3\-o enforce\f1 ] filesystem ...
.fi
.SH "DESCRIPTION"
.I quotaon
announces to the system that disk quotas should be enabled on one or
more local filesystems. The filesystem(s) specified must be mounted at the
time. 
.I quotaoff
announces to the system that filesystems specified should
have any disk quotas turned off. Both these commands behave slightly
differently between EFS and XFS filesystems.
.LP
On EFS filesystems, a quota file must be present in the root
directory of the specified filesystem and be named
.IR quotas .
.LP
XFS filesystems have two components to their disk quota system: accounting and
limit enforcement (see 
.IR quotas (4)
). Except in the case of the root filesystem, XFS filesystems
require that quota accounting be turned on at mount time. It is possible to 
enable and disable limit enforcement on any XFS filesystem after quota accounting
is already turned on. The default is to turn on/off both accounting and 
enforcement. 
 
These commands
update the status field of devices located in
.I /etc/mtab
to indicate when quotas are on or off for each filesystem.
.SS "Options to quotaon"
.TP
.B \-a
All EFS filesystems in
.I /etc/fstab
marked read-write with quotas
will have their quotas turned on.
This is normally used at
boot time to enable quotas. This option does not apply to XFS filesystems.
.TP
.B \-v
Display a message for each filesystem where quotas are turned on. 
This is typically useful to find out if the command succeeded or not.
See also the
.B \-s
option to
.IR repquota (1M)
for monitoring the quotaon/off status of a given filesystem.
.P
Quotas on a root XFS filesystem will not take effect until the system is
rebooted (with the same filesystem as the root filesystem).
.SS "Options to quotaoff"
.TP
.B \-d
Remove all the disk space taken up by quota information. This option must be
used cautiously since it also deletes the limits of all users.
One possibility is to use it in conjunction with
.IR repquota (1M)
and 
.IR edquota (1M)
as outlined in 
.IR quotas (4).
This command applies only to XFS file systems. It is not possible to delete
quota information while leaving quotas turned on.
.TP
.B \-a
Force all local EFS and XFS filesystems in
.I /etc/fstab
to have their quotas disabled.
.TP
.B \-v
Display a message for each filesystem affected.
.TP
.B \-o enforce
.B enforce
turns off just the limit enforcement.
The default is to turn off everything. This applies to XFS filesystems only.
.SS "Turning on quotas on XFS filesystems (examples)"
.TP
.B o
\f3Turning On Quotas On an XFS Filesystem Other Than the Root:\f1
Use
.IR mount (1M)
or
.IR /etc/fstab (4)
option
.B quota
to enable both accounting and limit enforcement.
.I quotaon
utility cannot be used for this purpose.
.TP
.B o
\f3Turning On Quotas On an XFS Root Filesystem:\f1
Use
.I quotaon
.B \-v
.I \/
,
.I sync
, and
.I reboot.
This procedure will enable both accounting and limit enforcement.
.TP
.B o
\f3Turning Off Quota Limit Enforcement On Any XFS Filesystem:\f1
Make sure that quota accounting and enforcement are both turned on using
.I repquota
.B \-s.
Use
.I quotaoff
.B \-vo enforce
to disable limit enforcement.  
This may be done while the filesystem is mounted.
.TP
.B o
\f3Turning On Quota Limit Enforcement On Any XFS Filesystem:\f1
Make sure that quota accounting is turned on using
.I repquota
.B \-s.
Use
.I quotaon
.B \-v. 
This may be done while the filesystem is mounted.
.SH BUGS
.P
It is not possible to enable quotas on XFS realtime filesystems.
.SH FILES
.PD 0
.TP 20
quotas
quota file at the EFS filesystem root
.TP
/etc/mtab
mounted filesystems
.TP
/etc/fstab
default filesystems
.PD
.SH "SEE ALSO"
quotactl(2),
fstab(4),
mtab(4),
repquota(1M),
edquota(1M),
quotas(4).
