calmsacibis995/irix-6517-src/eoe/man/man1m/quotacheck.1m
.TH quotacheck 1M
.SH NAME
quotacheck \- EFS filesystem quota consistency checker
.SH SYNOPSIS
.nf
\f3/usr/etc/quotacheck\f1 [ \f3\-v\f1 ] [ \f3\-p\f1 ] filesystem ...
\f3/usr/etc/quotacheck\f1 [ \f3\-v\f1 ] [ \f3\-p\f1 ] \f3\-a\f1
\f3/usr/etc/quotacheck\f1 [ \f3\-v\f1 ] \f3\-n\f1 nusers \c
filesystem ...
\f3/usr/etc/quotacheck\f1 [ \f3\-v\f1 ] \f3\-n\f1 nusers \f3\-a\f1
.fi
.SH DESCRIPTION
.I quotacheck
examines local EFS filesystems,
builds a table of current disk usage,
and compares this table against that stored
in the disk quota file for the filesystem.
If any inconsistencies are detected, both the
.I quotas
file and the current system copy of the
incorrect quotas are updated (the latter only
occurs if quotas has been enabled for the filesystem).
The filesystem has to be mounted for
.I quotacheck
to be able to
operate on it.
.I quotacheck
ignores XFS filesystems since the XFS quota system is
journalled and therefore inherently consistent.
.PP
If the
.B \-a
flag is supplied in place of any filesystem
names,
.I quotacheck
checks all the local filesystems indicated in
.I /etc/fstab
to be read-write with disk quotas.
.PP
Normally
.I quotacheck
operates silently.
If the
.B \-v
option is supplied,
.I quotacheck
indicates the disk quotas for each
user whose quota information was modified.
.PP
If the
.B \-p
flag is supplied then parallel passes are run on
the filesystems required, using the pass numbers in
.I /etc/fstab
in an identical fashion to
.IR fsck (1M).
.PP
.I quotacheck
expects each filesystem to be checked to have a
quota file with the name
.I quotas
in the root directory.
If none is present,
.I quotacheck
ignores the filesystem.
.PP
The
.I quotas
file has an index followed by the users' quota information.
If
while adding users
with the help of the
.IR edquota (1M)
command, there is no more space left in the index,
the superuser can increase the index size with the
.B \-n
option to permit the addition of more users to the
.I quotas
file.
.I nusers
is the new number of users for whom sufficient index size should be allocated.
The default index size allows quotas for 2048 users.
It is not
possible to shrink the index size.
It is advisable to remount the filesystem after using this option.
.PP
.I quotacheck
is normally run at boot time from the
.I /etc/rc2.d
directory, see
.IR rc2 (1M).
.PP
.I quotacheck
accesses the raw device in calculating the actual
disk usage for each user.
Thus, the filesystems
checked should be quiescent while
.I quotacheck
is running.
.SH EXAMPLES
.Ex
quotacheck -v -n 3000 /usr
.Ee
Increases the
.I quotas
file index size to support 3000 users (up from the default of 2048)
for the
.I /usr
filesystem.
.SH FILES
/etc/fstab	default filesystems
.SH "SEE ALSO"
fsck(1M),
quotaon(1M),
quotactl(2).
