calmsacibis995/irix-6517-src/eoe/man/man1m/rarpd.1m
.TH rarpd 1M
.SH NAME
rarpd \- \&DARPA Reverse Address Resolution Protocol daemon
.SH SYNOPSIS
.nf
\f3/usr/etc/rarpd\f1 [\f3\-d\f1] [\f3\-l\f1 \f2logfile\f1] \c
[\f2interface\f1 ...]\f1
.fi
.SH DESCRIPTION
.I rarpd
responds to Reverse Address Resolution Protocol (Reverse ARP,
RARP) requests.
It puts itself in the background, and requires root privileges.
.PP
The Reverse ARP protocol is used by systems at boot time to discover
their 32-bit Internet Protocol (IP) address given their 48-bit
Ethernet address.
In order for a RARP request to be answered,
the requesting system's name-to-IP-address entry must exist in the
.I /etc/hosts
file and its name-to-Ethernet-address entry must exist in the
.I /etc/ethers
file.
Note that if the server running
.I rarpd
is using the network information service (NIS),
the server's
.I /etc
files are ignored and the appropriate NIS maps are queried.
.PP
Normally
.I rarpd
serves all configured IP interfaces which support broadcasting.
Optional
.I interface
arguments restrict service to only those interfaces.
The
.B \-d
option causes
.I rarpd
to run in the foreground and log diagnostics on its standard error output.
The
.B \-l
option causes
.I rarpd
to record requests in
.IR logfile .
.SH FILES
.nf
.ta \w'/etc/config/rarpd.options\ \ \ \ \ 'u
/var/adm/SYSLOG	system log
/etc/init.d/network	networking start-up script
/etc/config/rarpd	configuration switch
/etc/config/rarpd.options	configuration options
.fi
.SH SEE ALSO
bootp(1M),
chkconfig(1M),
ifconfig(1M),
ethers(4),
hosts(4).
.PP
Finlayson, Ross, Timothy Mann, Jeffrey Mogul, and Marvin Theimer,
.IR "A Reverse Address Resolution Protocol" ,
RFC 903, Network Information Center, SRI International, Menlo Park, CA,
June 1984.
