calmsacibis995/irix-6517-src/eoe/man/man1m/rc0.1m
.nr X
.if \nX=0 .ds x} rc0 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
rc0 \- run commands required to enter single-user mode or halt the system
.SH SYNOPSIS
.nf
\f3/etc/rc0\f1
.fi
.SH DESCRIPTION
This file is executed by an entry in
.I /etc/inittab
and is responsible for performing those operations that bring the
system down to either the administrative maintenance state,
traditionally state \f3s\fP, called the "single-user" state,
or to the system halt state in preparation for powering the system down.
.PP
.I /etc/rc0
runs files beginning with \f3K\f1 in \f2/etc/rc0.d\f1.
These files are executed by
.I /bin/sh
in ascii sort-sequence order
(see \f3FILES\f1 below for more information).
.PP
Each of these files can also check the state of the corresponding
.I chkconfig
flag for that function.
If the state is
.B on
the script goes on to shut down or otherwise stop that function;
if the state is
.B off
it does not attempt to stop that function on the theory
that since that flag is off, it was never started in the first place.
(See
.IR chkconfig (1M)).
.PP
The functions performed by the
.I /etc/rc0
command and associated
.I /etc/rc0.d
files include:
.PP
Stop System Services and Daemons
.sp .8v
.RS
Various system services
(such as networking or print spooling) are gracefully terminated.
.sp .8v
When new services are added that should be terminated when the system is shut
down, the appropriate files are installed in \f2/etc/rc0.d\f1.
.RE
.PP
Terminate Processes
.sp .8v
.RS
A SIGTERM signal is sent to all running processes by
.IR killall (1M);
this lets processes stop themselves cleanly.
.RE
.PP
Kill Processes
.sp .8v
.RS
A SIGKILL signal is sent to all remaining processes;
no process can resist SIGKILL.
.sp .8v
At this point the only processes left are those associated with
.I /etc/rc0
and a few privileged system processes.
.RE
.PP
Unmount All Filesystems
.sp .8v
.RS
Only the root filesystem (/) remains mounted.
.RE
.SH FILES
Files in
.I /etc/rc0.d
must begin with a
.B K
followed by a number and the rest of the filename.
Upon entering run level 0 or 6,
files beginning with
.B K
are executed with an argument of
.B stop .
Files in
.I /etc/rc0.d
are typically symbolic links to files in
.IR /etc/init.d .
Files beginning with other characters are ignored.
See \f2rc2\f1(1M) for more information.
.SH SEE ALSO
killall(1M),
rc2(1M),
shutdown(1M).
