calmsacibis995/irix-6517-src/eoe/man/man1m/rc2.1m
.nr X
.if \nX=0 .ds x} rc2 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
rc2 \- run commands required for multi-user environment
.SH SYNOPSIS
.nf
\f3/etc/rc2\f1
.fi
.SH DESCRIPTION
\f3/etc/rc2\f1 is executed via an entry in
.I /etc/inittab
and is responsible for the initializations
that bring the system to a ready-to-use state,
traditionally state 2, which is called the "multi-user" state.
.PP
.I /etc/rc2
runs files beginning with \f3S\f1 in \f2/etc/rc2.d\f1.
These files are executed by
.I /bin/sh
in ascii sort\-sequence order
(see \f3FILES\f1 below for more information).
.PP
Each of these files
may also check the state of the corresponding
.I chkconfig
flag for that function.
If the state is
.BR on ,
the script starts that function;
if the state is
.BR off ,
it does not start that function.
(See
.IR chkconfig (1M)).
.PP
The functions performed by the
.I /etc/rc2
command and associated
.I /etc/rc2.d
files include:
.RS
.sp .8v
Setting and exporting the TIMEZONE variable.
.sp .8v
Setting-up and mounting the user (\f2/usr\f1) and other filesystem(s).
.sp .8v
Cleaning up (remaking) the
.I /tmp
directory.
.sp .8v
Initializing the network interfaces, mounting network filesystems,
and starting the appropriate daemon processes.
.sp .8v
Starting the
.I cron
daemon by executing
.IR /etc/cron .
.sp .8v
Cleaning up (deleting) uucp locks
status, and temporary files in the
.I /var/spool/uucp
directory.
.RE
.PP
Other functions can be added, as required, to support the
addition of hardware and software features.
.SH EXAMPLES
The following are simplified examples of the files found in
.IR /etc/rc2.d .
The filenames are prefixed by an
.B S
and a number indicating the execution order
of the files.
.PP
filesystems
.br
.RS
.nf
# set up and mount filesystems
cd /
fsck -m -c -y
/etc/mount -at efs
.fi
.RE
.PP
.nf
rmtmpfiles
.RS
# clean up /tmp
rm \-rf /tmp
mkdir /tmp
chmod 777 /tmp
chgrp sys /tmp
chown sys /tmp
.fi
.RE
.PP
.nf
uucp
.RS
# clean-up uucp locks, status, and temporary files
rm \-rf /var/spool/locks/*
.fi
.RE
.PP
The file
.I /etc/TIMEZONE
is included early in
.IR /etc/rc2 ,
thus establishing the default time zone for all commands that follow.
.PP
See
.IR rc0 (1M)
for the system shutdown procedure.
.SH FILES
Files in
.I /etc/rc2.d
must begin with an
.B S
or a
.B K
followed by a number and the rest of the filename.
Upon entering run level 2,
files beginning with
.B S
are executed with an argument of
.B start ;
if entering run level 2 from some state other than single-user
mode (ie: from other than run level 1 or s), files beginning with
.BR K ,
are first executed with an argument of
.BR stop .
Files in
.I /etc/rc2.d
are typically symbolic links to files in
.IR /etc/init.d .
Files beginning with other characters are ignored.
.SH SEE ALSO
rc0(1M),
shutdown(1M).
