calmsacibis995/irix-6517-src/eoe/man/man1m/registrar.1m
.TH registrar 1M
.SH NAME
registrar \- \&IP address update command for NIS hosts data base
.SH SYNOPSIS
.nf
\f3registrar\f1 \f2host-file\f1 \f3"make hosts"\f1
.fi
.SH DESCRIPTION
.IR registrar ,
which runs on a NIS master only,
is a NIS hostname data base update program.
A hostname registration request can be sent from either the
.IR yp_host (1M)
command, or from
the PROM
IP address auto-registration function.
This requests is initially sent to a RPC daemon process
.IR rpc.ypupdated (1M).
.I registrar
is invoked indirectly by
.IR rpc.ypupdated (1M)
by an intermediate make file
.IR updaters (4).
.P
The
.I host-file
parameter
should be the host file that is used in
NIS database makefile,
.IR /var/yp/Makefile .
Usually,
it is
.IR /etc/hosts .
.P
.I registrar
knows how to receive the input
parameters from
.IR rpc.ypupdated (1M).
The input parameters tell
.I registrar
whether to allocate a new IP address, to change the existing
hostname entry, or to delete the entry, along with the necessary
information to service the request.
.P
When adding a new hostname entry, there is no authentication checking.
As long as the
new hostname and the aliases are not yet used, the registration
request is always executed.
When changing or deleting hostname entry, the NIS master root
password has to be passed along with the command.
.P
The new IP address is selected with the first available
address that is in the same network/subnet specified in the request.
The system administrator can, however, mark a specific range
in the
.I /etc/hosts
for address allocation by a special comment line.
The format of this line should be
.Ex
# registrar start=\f2xxx\f7 end=\f2yyy\f7 mask=0x\f2zzzzzzzz\f1
.Ee
where
.I xxx
is the IP address with the smallest local
network address in the range,
.I yyy
is the IP address with largest local network address in the range, and
.I zzzzzzzz
is the 8-byte hexadecimal mask value.
.I xxx
and
.I yyy
must fall into the same network, or the same subnet if netmask is
specified.
.P
There can be several lines of comment for the address allocation for
the same network or subnet.
.I registrar
uses the first available address by searching through
the comment lines sequentially.
In case all address ranges described by the comment lines are used,
.I registrar
chooses the lowest available IP address that is in the same
network or subnet.
.SH FILES
/etc/hosts
.br
/var/yp/updaters
.SH EXAMPLE
Use
.Ex
#registrar start=192.26.1.10 end=192.26.1.20 mask=0xffffff00
.Ee
to reserve 192.26.1.10 through 192.26.1.20
for network 192.26.1.
.SH SEE ALSO
yp_host(1M),
ypupdated(1M),
updaters(4).
