calmsacibis995/irix-6517-src/eoe/man/man1m/renice.1m
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)renice.8	6.2 (Berkeley) 5/19/86
.\"
.TH renice 1M "May 19, 1986"
.SH NAME
renice \- alter priority of running processes
.SH SYNOPSIS
.nf
\f3/etc/renice\f1 [ \f3\-n\f1 increment | priority ] [ [ \f3\-p\f1 \c
] pid ... ]
	[ [ \f3\-g\f1 ] pgrp ... ] [ [ \f3\-u\f1 ] user ... ]
.fi
.SH DESCRIPTION
.I renice
alters the
scheduling priority of one or more running processes.
.IR renice 'ing
a process group causes all processes in the process group
to have their scheduling priority altered.
.IR renice 'ing
a user causes all processes owned by the user to have
their scheduling priority altered.
.PP
The
.B \-n
.I increment
specifies how the system scheduling priority of the specified
process(es) is to be adjusted.
The
.I increment
option-argument is a positive or negative decimal integer that
is used to modify the system scheduling priority of the
specified process(es).
The
.I priority
value is taken as the actual system scheduling priority, rather
than as an increment to the existing scheduling priority.
.PP
The parameters are interpreted as process ID's, process group
ID's, or user names as follows.
By default, the processes to be affected are specified by
their process ID's.
To force
parameters to be interpreted as process group ID's, the
.B \-g
option can be used.
To force the
parameters to be interpreted as user names, the
.B \-u
option can be used.
Supplying
.B \-p
resets
interpretation to be (the default) process ID's.
For example,
.Ex
\f4/etc/renice +1 987 -u daemon root -p 32\f1
.Ee
changes the priority of process ID's 987 and 32, and
all processes owned by users daemon and root.
.PP
Users other than the superuser can only alter the priority of
processes they own
and can only monotonically increase their ``nice value''
within the range 0 to PRIO_MAX (20).
(This prevents overriding administrative fiats.)
The superuser
can alter the priority of any process
and set the priority to any value in the range PRIO_MIN (\-20)
to PRIO_MAX.
Useful priorities are:
.TP
20
The affected processes run only when nothing else
in the system wants to.
.TP
0
The ``base'' scheduling priority.
.TP
anything negative
Make things go very fast.
.SH FILES
/etc/passwd     to map user names to user ID's
.SH SEE ALSO
getpriority(2),
setpriority(2).
