calmsacibis995/irix-6517-src/eoe/man/man1m/repquota.1m
.TH repquota 1M
.SH NAME
repquota \- summarize quotas for a local filesystem
.SH SYNOPSIS
.nf
\f3/usr/etc/repquota\f1 [ \f3\-sv\f1 ] filesystem ...
\f3/usr/etc/repquota\f1 [ \f3\-sv\f1 ] [ \f3\-a\f1 ]
\f3/usr/etc/repquota\f1 [ \f3\-e\f1 \f2outputfile\f1 ] filesystem ...
\f3/usr/etc/repquota\f1 [ \f3\-e\f1 \f2outputfile\f1 ] [ \f3\-a\f1 ]
.fi
.SH DESCRIPTION
.I repquota
outputs a summary of the disk usage and quotas for the specified
filesystems for all users declared in the local 
.I /etc/passwd 
file.
For each user the current number of files and amount of space
(in kilobytes) is printed, along with any quotas created with
.IR edquota (1M).
Using 
.I repquota,
it is possible to obtain information
about the overall XFS quota system as well as output 
XFS quota limits in a format understood by 
.IR edquota.
.SH OPTIONS
.TP
.B \-a
Report on all filesystems indicated in
.I /etc/fstab
to be read-write and have quotas turned on.
.TP
.B \-s
Report statistics on XFS quota internals such as the space occupied by
quota information and quota on/off status. This information is encapsulated
in
.B fs_quota_stat
structure defined in
.I <sys/quota.h>.
.TP
.B \-e
Append all quota limits of all users in 
.I /etc/passwd
to the file
.I outputfile
in a format that edquota can read in. This, for example, is very useful 
in preserving the limits of a large number of users for later use.
.TP
.B \-v
Report all quotas, even if there is no usage.
.LP
Only the superuser can view quotas which are not their own. XFS filesystems do
keep accounting information for the superuser; however, limits are never imposed.
.SH FILES
.PD 0
.TP 20
quotas
quota file at the EFS filesystem
root
.TP
/etc/fstab
default filesystems
.TP
/etc/passwd
list of user accounts on the system.
.PD
.SH BUGS
.P
.IR repquota
only displays quota information for users declared in 
.I /etc/passwd
file on the local system.
.P
.IR repquota 
does not work over remotely mounted filesystems.
.P
Options
.B \-s, \-e
do not work on EFS filesystems.
.PD
.SH SEE ALSO
edquota(1M),
quota(1),
quotacheck(1M),
quotaon(1M),
quotactl(2).
