calmsacibis995/irix-6517-src/eoe/man/man1m/rexd.1m
.\" @(#)rexd.8c	1.2 87/08/23 3.2/4.3NFSSRC
.\" @(#)rexd.8c	1.2 87/02/10 NFSSRC
.\" @(#)rexd.8c 1.1 86/09/25 SMI;
.TH rexd 1M
.SH NAME
rexd \- \&RPC-based remote execution server
.SH SYNOPSIS
.nf
\f3/usr/etc/rpc.rexd\f1
.fi
.SH DESCRIPTION
.I rexd
is the
.IR rpc (4)
server for remote program execution.
This daemon is started by \f2inetd\f1(1M) whenever a
remote execution request is made (see the note below).
For non-interactive programs, standard file descriptors are connected
directly to TCP connections.
Interactive programs involve pseudo-terminals, similar to
the login sessions provided by
.IR rlogin (1C).
This daemon may use NFS to mount filesystems specified
in the remote execution request.
.LP
.I rexd
should be used on trusted networks only.
It is not automatically enabled in the
.I /etc/inetd.conf
file.
To enable
.IR rexd ,
edit
.I inetd.conf
and remove the comment character preceding the rexd entry
and signal
.I inetd
to read the file:
.Ex
\f4/etc/killall -HUP inetd\f1
.Ee
.SH DIAGNOSTICS
Diagnostic messages are logged to
.IR syslogd (1M)
and returned to the requester.
.SH RESTRICTIONS
The superuser cannot execute commands using
.I rexd
client programs such as
.IR on (1C).
.SH FILES
.PD 0
.TP 27
/dev/ttyq\f2n\f1
pseudo-terminals used for interactive mode
.TP
/etc/passwd
authorized users
.TP
/usr/tmp_rex/rexd?????
temporary mount points for remote filesystems
.PD
.SH SEE ALSO
inetd(1M),
on(1C),
exports(4),
rpc(4).
.SH BUGS
Access control is not secure.
.PP
Does not properly handle window size information sent by Sun workstations.
