calmsacibis995/irix-6517-src/eoe/man/man1m/rhost.1m
'\"macro stdmacro
.\"
.\"     @(#)rhost.1m    
.\"
.if n .pH man1.rhost @(#)rhost  30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} RHOST 1M "" "\&"
.if \nX=1 .ds x} RHOST 1M ""
.if \nX=2 .ds x} RHOST 1M "" "\&"
.if \nX=3 .ds x} RHOST "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
rhost \- set the attributes of remote hosts and networks.
.SH SYNOPSIS
.B /usr/etc/rhost
.RB [ \-l\0 \f2<lookup_host>\fP]
.RB [ \-f\0 \f2<cfile>\fP]
.RB [ \-r\0 \f2<remote>\fP]
.RB [ \-k\0]
.RB [ \-n\0]
.RB [ \-d\0]
.SH DESCRIPTION
On systems with TSIX networking enabled, the kernel uses an 
internal lookup table,
called the internal Remote Host Database (RHDB), 
to enforce per host security policy.
The rhosts command loads the RHDB with the
attributes of remote hosts and
networks, specified in
.IR /etc/rhost.conf .
.SS Options
.TP 16
\-l \f2<lookup_host>\fP
The
.B \-l
will check the RHDB for a host name.
.TP 16
\-f \f2<cfile>\fP
.B /etc/rhost.conf
is the default file used to create the RHDB.
Use the 
.B \-f
option to change the name of the default file.
When using a different file other then the default, make sure it has
the appropriate security policies.
.TP 16
\-r \f2<remote>\fP
The
.B \-r
option is defined, but not used.
.TP 16
\-k
The
.B \-k
option is used to give host information based on type.
.TP 16
\-n
The
.B \-n
option checks the RHDB file only.
.TP 16
\-d
The
.B \-d
give some debug information.
It replaces the
.B \-v
option.
.PP
The 
.IR /etc/rhost.conf
file consists, minimally, of a series of host attribute profile
assignments of the form:
.PP
.RS 5
.I "<name>: =  <attribute> = <value>: [<attribute> = <value>:]" 
.RE
.PP
Newline characters within a host attribute profile must be escaped.  
It is usually most convenient to specify a series
of commonly used profiles as templates, then use the templates
to assign the profiles to specific hosts.
A template looks exactly like a host profile assignment, except
that one of the attribute-value pairs is:
.PP
.RS 5
.I "default_spec = .:" 
.RE
.PP
Either host names or IP addresses may be used to specify
hosts.  If a host name is used, an entry for that host
must appear in the local
.I /etc/hosts
file, as
.B rhost
is run before
network information services (NIS) are available.
A wildcard IP address, that is, an address with
zeros in some slots, may be used to specify a 
range of IP addresses.  For example,

.RS 5
128.01.01.0:    
.br
128.01.0.0:
.br
128.0.0.0
.br
128.0.0.0:
.RE

are valid host specifications.  
When
.B rhost
resolves addresses, it first looks for a complete address,
followed by a wildcard with one zero byte, and so forth.
This allows the administrator to specify, for example:

.RS 5
0.0.0.0:        The whole world is untrusted
.br
128.01.01.0:    Except this network, which speaks CIPSO
.br
128.01.01.01:   Except this host, which is TSIX.
.RE

.PP
A sample copy of 
.I /etc/rhost.conf
has been provided on your system.
The file begins with a series of templates,
including default_tnet and default_sgipso.
These templates are used later in the
file to assign profiles to specific hosts for example:
.PP
.RS 5
.I "localhost:  default_spec = default_tsig:" 
.RE
.PP
The following attributes are recognized:
.TP
host_type
.TP
smm_type
Session Manager IDs.  
Identifies the protocol used to communicate with a host.
Acceptable values are
tsix_1_1 and single_level.  Other values are ignored.
For more information, see trusted_networking(7m).
.TP
nlm_type
IP Security Options.  Acceptable Trusted IRIX values are
unlabeled, cipso_1, cipso_2, ripso_bso, sgipso, and
sgipso2.  Cipso_1 and cipso_2 indicate tag types 1 and 2
of the CIPSO specification.  Sgipso and sgipso2 are synonyms.
Other values are ignored.
For more information, see trusted_networking(7m).
.TP
ipsec
.TP
default_spec
Indicates that this is a template.
.TP
cache_size
.TP
min_sl
Minimum sensitivity label.
.TP
max_sl
Maximum sensitivity label.
.TP
min_integ
Minimum integrity label.
.TP
max_integ
Maximum integrity label.
.TP
def_sl
Default sensitivity label.
.TP
def_integ
Default integrity label.
.TP
def_ilb
Information label. Ignored.
.TP
def_clearance
Default clearance.
.TP
def_uid
Default user ID.
.TP
def_luid
.TP
def_sid
.TP
def_gid
Default group ID.
.TP
def_ngrps
.TP
def_gids
.TP
def_audit
.TP
def_privs
.TP
max_privs
.TP
vendor
.TP
Domain of Interpretation.
.TP 
flags
Indicates which attributes are mandatory
on packets received from a host.
The following values are recognized:
import,
export,
deny_access,
mand_sl,
mand_integ,
mand_ilb,
mand_privs,
mand_luid,
mand_ids,
mand_sid,
mand_pid, and
mand_clearance.
