calmsacibis995/irix-6517-src/eoe/man/man1m/rlogind.1m
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)rlogind.1M	6.3 (Berkeley) 5/24/86
.\"
.if n .pH man1.rlogind @(#)rlogind	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} RLOGIND 1M "Silicon Graphics" "\&"
.if \nX=1 .ds x} RLOGIND 1M "Source Code Control System Utilities"
.if \nX=2 .ds x} RLOGIND 1M "" "\&"
.if \nX=3 .ds x} RLOGIND "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
rlogind \- remote login server 
.SH SYNOPSIS
.B /usr/etc/rlogind
[
.B \-aln
]
.SH DESCRIPTION
.I Rlogind
is the server for the 
.IR rlogin (1C)
program.  The server provides a remote login facility
with authentication based on privileged port numbers from trusted hosts.
The
.B \-a
option verifies the remote host name and address match on all incoming
connections.
Normally this check is performed only for connections from hosts in the
local domain.
The
.B \-l
option disables validation using
.I .rhosts
files,
unless the user is logging in as the superuser.
Transport-level keep-alive messages are enabled unless the
.B \-n
option is present.
The use of keep-alive messages allows sessions to be timed out
if the client crashes or becomes unreachable.
These options should specified in the
.I /etc/inetd.conf
file (see
.IR inetd (1M)).
.PP
.I Rlogind
listens for service requests at the port indicated in
the ``login'' service specification; see
.IR services (4).
When a service request is received the following protocol
is initiated:
.IP 1) 4
The server checks the client's source port.
If the port is not in the range 512\-1023, the server
aborts the connection.
.IP 2)
The server checks the client's source address
and requests the corresponding host name (see
.IR gethostbyaddr (3N),
.IR hosts (4)
and
.IR named (1M)).
If the hostname is in the same domain as the server (according to
the last two components of the domain name),
or if the
.B \-a
option is given,
the addresses for the hostname are requested,
verifying that the name and address correspond.
Address verification failures are logged with
.IR syslog (3B).
If the hostname cannot be determined or verified,
the dot-notation representation of the host address is used
for authentication.
.PP
Once the source port and address have been checked, 
.I rlogind
allocates a pseudo terminal (see 
.IR pty (7M)),
and manipulates file descriptors so that the slave
half of the pseudo terminal becomes the 
.BR stdin ,
.BR stdout ,
and
.B stderr 
for a login process.
The login process is an instance of the
.IR login (1)
program, invoked with the
.B \-r
or
.B \-R
options.  The login process then proceeds with the authentication
process as described in
.IR rshd (1M),
but if automatic authentication fails, it reprompts the user
to login as one finds on a standard terminal line.
.PP
The parent of the login process manipulates the master side of
the pseudo terminal, operating as an intermediary
between the login process and the client instance of the
.I rlogin
program.  In normal operation, the packet protocol described
in
.IR pty (7M)
is invoked to provide ^S/^Q type facilities and propagate
interrupt signals to the remote programs.  The login process
propagates the client terminal's baud rate and terminal type,
as found in the environment variable, ``TERM''; see
.IR environ (5).
The screen or window size of the terminal is requested from the client,
and window size changes from the client are propagated to the pseudo terminal.
.SH DIAGNOSTICS
All diagnostic messages are returned on the connection
associated with the
.BR stderr ,
after which any network connections are closed.
An error is indicated by a leading byte with a value of 1.
.PP
.B ``Try again.''
.br
A
.I fork
by the server failed.
.PP
.B ``/bin/sh: ...''
.br
The user's login shell could not be started.
.SH BUGS
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an ``open'' environment.
.PP
A facility to allow all data exchanges to be encrypted should be
present.
.PP
A more extensible protocol should be used.
'\".so /pubs/tools/origin.bsd
