calmsacibis995/irix-6517-src/eoe/man/man1m/rmt.1m
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)rmt.8c	6.1 (Berkeley) 4/27/85
.\"
.TH RMT 1M
.UC 5
.SH NAME
rmt \- remote magtape protocol module
.SH SYNOPSIS
.B /etc/rmt
.SH DESCRIPTION
.I Rmt
is a program used by the remote programs
in manipulating a magnetic tape drive through an interprocess
communication connection.
.I Rmt
is normally started up with an
.IR rexec (3N)
or
.IR rcmd (3N)
call.
.PP
The 
.I rmt
program accepts requests specific to the manipulation of
magnetic tapes, performs the commands, then responds with
a status indication.  All responses are in ASCII and in
one of two forms. 
Successful commands have responses of:
.PP
.ti +0.5i
\f3A\f2number\f1\en
.PP
where 
.I number
is an ASCII representation of a decimal number.
Unsuccessful commands are responded to with:
.PP
.ti +0.5i
\f3E\f2error-number\f1\en\f2error-message\f1\en
.PP
where
.I error-number
is one of the possible error
numbers described in
.IR intro (2),
and
.I error-message
is the corresponding error string as printed
from a call to
.IR perror (3).
The protocol is comprised of the
following commands (a space is present between each token):
.TP 15
.B Odevice\enmode\en
Open the specified 
.I device
using the indicated
.IR mode .
.I Device
is a full pathname and
.I mode
is an ASCII representation of a decimal
number suitable for passing to
.IR open (2).
If a device had already been opened, it is
closed before a new open is performed.
.TP 15
.B Vversion#\en
This command is sent by the client program to indicate the
.I version#
of the 'librmt' library that the client program 
is linked with. If 
.B rmt
own protocol is the same or  more advanced than that of the client program, 
.B rmt
will adjust to the client program protocol and return the client 
.I version# .
However, if the client program   
.I version#
is more advanced than 
.B rmt
own protocol version number then 
.B rmt
will return its actual version number and expect the client program to adjust
to 
.B rmt
protocol.
The returned value is the ASCII representation
of the version number. 
.TP 15
.B Cdevice\en
Close the currently open device.  The
.I device
specified is ignored.
.TP 15
.B Lwhence\enoffset\en
Perform an
.IR lseek (2)
operation using the specified parameters.
The response value is that returned from the
.I lseek
call.
.TP 15
.B Wcount\en
Write data onto the open device.
.I Rmt
reads
.I count
bytes from the connection, aborting if
a premature end-of-file is encountered.
The response value is that returned from
the
.IR write (2)
call.
.TP 15
.B Rcount\en
Read
.I count
bytes of data from the open device.
If
.I count
exceeds the size of the data buffer (10 kilobytes), it is
truncated to the data buffer size.
.I Rmt
then performs the requested 
.IR read (2)
and responds with 
\f3A\f2count-read\f1\en if the read was
successful; otherwise an error in the
standard format is returned.  If the read
was successful, the data read is then sent.
.TP 15
.B Ioperation\encount\en
Perform a MTIOTOP 
.IR ioctl (2)
command using the specified parameters.
The parameters are interpreted as the
ASCII representations of the decimal values
to place in the 
.I mt_op
and
.I mt_count
fields of the structure used in the
.I ioctl
call.  The return value is the
.I count
parameter when the operation is successful.
.TP 15
.B S\en
Return the status of the open device, as
obtained with a MTIOCGET 
.I ioctl
call.  If the operation was successful,
an ``ack'' is sent with the size of the
status buffer, then the status buffer is
sent (in binary).
.TP 15
.B Q\en
Perform a MTSCSIINQ
.IR ioctl (2)
command. 
If the operation was successful,
an ``ack'' is sent with the size of the
inquiry buffer, then the inquiry buffer is
sent (in binary).
.TP 15
.B B\en
Perform a MTIOCGETBLKSIZE
.IR ioctl (2)
command.
If the operation was successful,
an ``ack'' is sent with the size of the
block size buffer, then the block size buffer is
sent (in binary).
.TP 15
.B Z\en
Perform a 
.IR fstat (2)
system call on the currently opened device.
If the operation was successful,
an ``ack'' is sent with the size of the
``stat'' structure, then the actual ``stat'' structure is
sent (in binary).
.PP
Any other command causes 
.I rmt
to exit.
.SH DIAGNOSTICS
All responses are of the form described above. If 
.B rmt
is invoked with an argument, that argument will be treated as a file name and 
debug information will be logged in that file.
.SH "SEE ALSO"
rcmd(3N),
rexec(3N),
mtio(7),
.SH BUGS
People tempted to use this for a remote file access protocol
are discouraged.
'\".so /pubs/tools/origin.bsd
