calmsacibis995/irix-6517-src/eoe/man/man1m/rpc.passw.1m
.TH rpc.passwd 1M
.SH NAME
rpc.passwd \- server for modifying NIS password file
.SH SYNOPSIS
.nf
\f3/usr/etc/rpc.passwd\f1 \f2file\f1 [ \f3\-m\f1 \f2arg1 arg2\f1 ... ]
.fi
.SH DESCRIPTION
.I rpc.passwd
is a server that handles password change requests from
.IR yppasswd (1).
It changes a password entry in
.IR file ,
which is assumed to be in the format of
.IR passwd (4).
An entry in
.I file
is only changed if the password presented by
.IR yppasswd (1)
matches the encrypted password of that entry.
.LP
If the
.B \-m
option is given, then after
.I file
is modified, a
.IR ypmake (1M)
is performed in
.IR /var/yp .
Any arguments following the flag are passed to
.IR ypmake .
.LP
This server should be run on the host serving as the
network information service (NIS) master.
It is started from the
.I /etc/init.d/network
startup script if the
.B yp
and
.B ypmaster
configuration flags are set on (see
.IR network (1M)).
The startup script invokes the server using
.I /etc/passwd
as the NIS password file and causes
password changes to be propagated immediately.
To use a different NIS passwd file, put the filename in
.I /etc/config/rpc.passwd.options
and put the following the following line in
.I /etc/config/ypmaster.options
substituting the new filename for \f2file\fP:
.Ex
PWFILE=\f2file\fP
.Ee
.SH FILES
/etc/passwd
.br
/etc/config/rpc.passwd.options
.br
/etc/config/ypmaster.options
.SH SEE ALSO
network(1M),
ypmake(1M),
yppasswd(1),
passwd(4),
ypfiles(4).
.SH CAVEAT
This server will eventually be replaced with a more general
service for modifying any NIS map.
