calmsacibis995/irix-6517-src/eoe/man/man1m/rpcinfo.1m
.TH rpcinfo 1M
.SH NAME
rpcinfo \- report RPC information
.SH SYNOPSIS
.nf
\f3/usr/etc/rpcinfo \-b\f1 program-number version-number
\f3/usr/etc/rpcinfo \-m\f1 program-number version-number
\f3/usr/etc/rpcinfo \-d\f1 program-number version-number
\f3/usr/etc/rpcinfo \-p\f1 [ host ]
\f3/usr/etc/rpcinfo \f1[\f3 \-C\f1 ] \f3\-u\f1 host program-number [ version-number ]
\f3/usr/etc/rpcinfo \-t\f1 host program-number [ version-number ]
.fi
.SH DESCRIPTION
.I rpcinfo
makes an RPC call to an RPC server and reports what it finds.
.SH OPTIONS
.TP
.B \-b
Make an
RPC
broadcast to procedure 0 of the specified
.I program-number
and
.I version-number
using
UDP
and report all hosts that respond.
.TP
.B \-m
Like
.B \-b
but uses an
RPC
multicast.
.TP
.B \-d
Delete the existing registration for the
RPC
service of the specified
.I program-number
and
.IR version-number .
.TP
.B \-p
Probe the portmapper on
.IR host ,
and print a list of all registered RPC programs.
If
.I host
is not specified, it defaults to the value returned by
.IR hostname (1).
.TP
.B \-u
Make an RPC call to procedure 0 of
.I program-number
using UDP, and report whether a response was received.
The
.I version-number
defaults to 1.
If
.B \-C
is used in conjunction with
.BR \-u ,
a PMAPPROC_CALLIT request will be used rather than PMAPPROC_GETPORT followed
by the call to procedure 0.
.TP
.B \-t
Make an RPC call to procedure 0 of
.I program-number
using TCP, and report whether a response was received.
The
.I version-number
defaults to 1.
.LP
The
.I program-number
argument can be either a name or a number.
.SH FILES
/etc/rpc     names for rpc program numbers
.SH SEE ALSO
portmap(1M),
rpc(4).
.PP
.IR "IRIX Network Programming Guide"
