calmsacibis995/irix-6517-src/eoe/man/man1m/rshd.1m
'\"macro stdmacro
.if n .pH man1.rshd @(#)rshd	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} RSHD 1M "Silicon Graphics" "\&"
.if \nX=1 .ds x} RSHD 1M "Source Code Control System Utilities"
.if \nX=2 .ds x} RSHD 1M "" "\&"
.if \nX=3 .ds x} RSHD "" "" "\&"
.TH RSHD 1M
.UC 5
.SH NAME
rshd \- remote shell server
.SH SYNOPSIS
.B /usr/etc/rshd [-alnL]
.SH DESCRIPTION
.I Rshd
is the server for the
.IR rcmd (3N)
routine and, consequently, for the
.IR rsh (1C)
program.  The server provides remote execution facilities
with authentication based on privileged port numbers from trusted hosts.
The
.B \-a
option verifies the remote host name and address match on all incoming
connections.
Normally this check is performed only for connections from hosts in the
local domain.
The
.B \-l
option disables validation using
.I .rhosts
files.
Transport-level keep-alive messages are enabled unless the
.B \-n
option is present.
The use of keep-alive messages allows sessions to be timed out
if the client crashes or becomes unreachable.
The
.B \-L
option causes all successful accesses to be logged to
.IR syslogd (1M)
as
.I auth.info
messages.
These options should specified in the
.I /etc/inetd.conf
file (see
.IR inetd (1M)).
.PP
.I Rshd
listens for service requests at the port indicated in
the ``cmd'' service specification; see
.IR services (4).
When a service request is received the following protocol
is initiated:
.IP 1) 4
The server checks the client's source port.
If the port is not in the range 512\-1023, the server
aborts the connection.
.IP 2) 4
The server reads characters from the socket up
to a null (`\e0') byte.  The resultant string is
interpreted as an ASCII number, base 10.
.IP 3) 4
If the number received in step 2 is non-zero,
it is interpreted as the port number of a secondary
stream to be used for the
.BR stderr .
A second connection is then created to the specified
port on the client's machine.  The source port of this
second connection is in the range 513\-1023.
.IP 4) 4
The server checks the client's source address
and requests the corresponding host name (see
.IR gethostbyaddr (3N),
.IR hosts (4)
and
.IR named (1M)).
If the hostname cannot be determined,
the dot-notation representation of the host address is used.
.IP 5) 4
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
is interpreted as the user identity on the
.BR client 's
machine.
.IP 6) 4
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
is interpreted as a user identity to use on the
.BR server 's
machine.
.IP 7) 4
A null terminated command to be passed to a
shell is retrieved on the initial socket.  The length of
the command is limited by the upper bound on the size of
the system's argument list.
.IP 8) 4
.I Rshd
then validates the user according to the following steps.
The local (server-end) user name is looked up in the password file.
If the lookup fails, the connection is terminated.
.I Rshd
then tries to validate the user using
.IR ruserok (3N),
which uses the file
.I /etc/hosts.equiv
and the
.I .rhosts
file found in the user's home directory.
If the user is not the super-user, (user id 0), the file
.I /etc/hosts.equiv
is consulted for a list of hosts considered ``equivalent''.
If the client's host name is present in this file, the
authentication is considered successful.  If the lookup
fails, or the user is the super-user, then the file
.I .rhosts
in the home directory of the remote user is checked for
the machine name and identity of the user on the client's
machine.  If this lookup fails, the connection is terminated.
The
.B \-l
option prevents
.IR ruserok (3N)
from doing any validation based on the user's ``.rhosts'' file,
unless the user is the superuser.
.IP 9) 4
If the file
.I /etc/nologin
exists and the user is not the super-user, the connection is closed.
.IP 10) 4
A null byte is returned on the initial socket
and the command line is passed to the normal login
shell of the user.  The
shell inherits the network connections established
by
.IR rshd .
.SH SHARE II ACTIONS
If the Share II system is installed and enabled, then
the following privilege and resource checks are made
immediately after validation checks are passed
but before the shell is started:
.IP 1. 4n
If your
\f4nologin\f1
flag is set, or you already have another connection and your
\f4onelogin\f1
flag is set, then you are denied connection.
.IP 2.
If a disk usage exceeds its soft disk limit in any of your domains,
then a message is printed and you are given a
\f2warning\f1.
If you accumulate too many warnings, further connection attempts are denied and
you must see your subadministrator to rectify the situation.
Whenever you connect with no disk usages in excess of any soft limits,
all your accumulated warnings are cleared.
.IP 3.
If you do not have permission to use an
\f2rsh\f1
connection, as determined by the terminal permission flag
\f4terminal.flag.rsh\f1,
then you are denied connection.
.IP 4.
Some installations place limits on terminal connect-time,
which apply equally to connection by way of 
\f2rsh\f1.
If you have already reached your connect-time limit, then you are
denied connection.
Otherwise, if you have a limit, your remaining connect-time is printed.
.PP
If all of these checks are passed,
\f4rshd\f1
proceeds normally.
.SH FILES
.TP \w'/etc/limconf'u+3m
\f4/etc/limconf\f1
The compiled Share II configuration file (machine readable).
.PD
.SH SEE ALSO
login(1), rsh(1C), rexecd(1M), rcmd(3N), ruserok(3N), share(5)
.SH DIAGNOSTICS
Except for the last one listed below,
all diagnostic messages
are returned on the initial socket,
after which any network connections are closed.
An error is indicated by a leading byte with a value of
1 (0 is returned in step 10 above upon successful completion
of all the steps prior to the execution of the login shell).
.PP
.B ``locuser too long''
.br
The name of the user on the client's machine is
longer than 16 characters.
.PP
.B ``remuser too long''
.br
The name of the user on the remote machine is
longer than 16 characters.
.PP
.B ``command too long ''
.br
The command line passed exceeds the size of the argument
list (as configured into the system).
.PP
.B ``Login incorrect.''
.br
No password file entry for the user name existed.
(Logged to the
.IR syslogd (1M)
daemon as an
.I auth.notice
message.)
.PP
.B ``No remote directory.''
.br
The
.I chdir
command to the home directory failed.
(Logged
as an
.I auth.notice
message.)
.PP
.B ``Permission denied.''
.br
The authentication procedure described above failed.
(Logged
as an
.I auth.notice
message.)
.PP
.B ``Connection received using IP options (ignored)''
.br
The remote host tried to use explicit IP source routing.
.PP
.B ``Connection from <host> on illegal port''
.br
The remote host used a nonprivileged port.
.PP
.B ``Can't find name for <address>''
.br
No hostname was found for the IP address.
The authentication procedure described above will use the IP address.
.PP
.B "``Host addr <x> not listed for host <y>''"
.br
The remote host's name and address did not match.
The authentication procedure described above will use the IP address instead
of the name.
.PP
.B ``Can't make pipe.''
.br
The pipe needed for the
.BR stderr ,
wasn't created.
.PP
.B ``Try again.''
.br
A
.I fork
by the server failed.
.PP
.B ``<shellname>: ...''
.br
The user's login shell could not be started.  This message is returned
on the connection associated with the
.BR stderr ,
and is not preceded by a flag byte.
.br
.PP
The Share II specific diagnostic messages are listed as follows:
.PP
\f3``Warning <X> of <Y>: soft disk limit exceeded.''\fP
.br
One of your domains has a disk usage in excess of its soft limit.
.PP
\f3``Connection denied.  Too many warnings.''\fP
.br
You have reached your warning limit.  See your subadministrator.
.PP
\f3``Connection denied.  Already logged in \- only one login allowed.''\fP
.br
You are already connected to the system and your
\f4onelogin\f1
flag is set.
.PP
\f3``Connection denied.  Currently barred from logging in.''\fP
.br
Your
\f4nologin\f1
flag is set.
.PP
\f3``Connection denied.  No permission to use this terminal.''\fP
.br
You are not allowed to log in at this terminal because of a clear
\f4terminal.flag.rsh\f1
flag.
.PP
\f3``You have a remaining terminal connect-time of <Y>.''\fP
.br
You may use this connection until you have used up your remaining
connect-time, at which point you are forced to disconnect.
.PP
\f3``Connection denied.  Terminal connect-time limit exceeded.''\fP
.br
You have already reached your terminal connect-time limit.
.PP
\f3``Share not configured \- no limit checks.''\fP
.br
The configuration file is unreadable for some reason, so
terminal privileges, connect-time limits and disk space limits
could not be checked.
.SH BUGS
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an ``open'' environment.
.PP
A facility to allow all data exchanges to be encrypted should be
present.
.PP
A more extensible protocol should be used.
.SH NOTES
.I rshd
will set the
.I LANG
environment variable if it is specified in
.BR $HOME/.lang .
