calmsacibis995/irix-6517-src/eoe/man/man1m/rstat.1m
.TH RSTAT 1M
.SH NAME
rstat \- show resource reservation status
.SH SYNOPSIS
.na
.B rstat 
[
.B \-fpn
] [
.B \-h
.I node_name
]
.br
.ad
.SH DESCRIPTION
.LP
\fIRstat\fP displays the RSVP reservation state on the local system or
on any specific remote node.

In default operation, \fIrstat\fP displays reservation state for each
interface and each session (destination address and port) for which
there is a reservation.  Each line contains the interface name, the
style, the session address and port, the filter spec selecting
sender(s), and the next hop address.  If there is path state but no
reservation, \fIrstat\fP simply lists the session with the notation
"(no resv)".  Additional information can be displayed, under control of
the options.

If there is no RSVP daemon on this node or if the daemon is earlier than
Release 3.1, \fIrstat\fP will time out after 5 seconds.
.SH OPTIONS
.TP
.B \-f
Display the flowspec for each reservation, in the line following the
standard line.
.TP
.B \-n
Display all IP addresses in numeric (i.e., dotted-decimal) form, do not
try to convert them to DNS names.
.TP
.B \-p
Display path state for each session, following the corresponding reservation
state.  There will be one line for each sender, containing the session
address and port, the sender template, and the previous hop address.
If the \fBf\fP flag is also present, there will be second line for each
sender containing the sender tspec.
.TP
.B \-h
Return the reservation status from the node named \fInode_name\fP,
instead of the local node.
.LP
.ne 3
.SH "SEE ALSO"
.TP
rsvpd(1m), rtap(1m), rsvpeep(1m), rsvpfilter(1m), psifconfig(1m)

.cm .SH BUGS
