calmsacibis995/irix-6517-src/eoe/man/man1m/rsvpd-snmpagent.1m
.TH rsvpd-snmpagent 1M local "Silicon Graphics Inc."
.SH NAME
rsvpd-snmpagent \- \&Silicon Graphics RSVP & IntSrv SNMP Agent
.SH DESCRIPTION
\f4rsvpd-snmpagent\fP is the part of the \f4rsvpd\fP daemon
which implements RSVP (RFC 2206) and Integrated Services (RFC 2213)
MIBs, using the Simple Network Management Protocol (SNMP).
rsvpd can be configured to run at boot time by the 
command \f2chkconfig rsvpd on\fP, or started from the command line.  You 
must be super-user (root) to run rsvpd.  For more information,
please see the rsvpd(1M) man page.
.P
The rsvpd-snmpagent allows read-only access to all RSVP and IntSrv
MIB variables, except intSrvIfAttribMaxAllocatedBits,
which is read-write.
.P
The rsvpd-snmpagent portion of rsvpd acts as a subagent to the PEER Networks Master Agent 
\f4peer_snmpd\fP.  The SNMP Agent peer_snmpd must be started up before or
shortly after rsvpd is started.
peer_snmpd is the master SNMP Agent that listens to incoming 
SNMP requests on UDP port 161.  rsvpd-snmpagent connects to peer_snmpd 
via the SMUX protocol, and registers the MIB subtrees that it 
implements, with peer_snmpd.  When a Network Manager sends a request 
for a MIB object within one of those subtrees, peer_snmpd will first 
authenticate the request, and then communicate with rsvpd-snmpagent to get 
the response, and then sends the response back to the Manager.
.P
For more information on peer_snmpd, please refer to the man page for 
peer_snmpd.  For more information on the SMUX protocol, please refer 
to RFC1227.
.P

.SH FILES
.DT
/etc/config/rsvpd.conf

.SH "SEE ALSO"
\f4peer_snmpd\fP(1M),
\f4rsvpd\fP(1M)
.PP
RFCs: 2206, 2213, 1441-1452 (SNMP Protocol RFCs)
.PP
RFC 2206 (RSVP MIB), RFC 2213 (Integrated Services MIB)
.PP
RFC 1227 (SMUX Protocol)

