calmsacibis995/irix-6517-src/eoe/man/man1m/rtap.1m
.TH RTAP 1M
.SH NAME
rtap \- real-time application program
.SH SYNOPSIS
.na
.B rtap 
[
.B \-f
.I file_name
]
.br
.ad
.SH DESCRIPTION
.LP
\fIRtap\fP is an interactive test program that drives the RSVP daemon
through the RSVP API.  \fIRtap\fP may be used either as a standalone
application, or it may be linked directly into the RSVP daemon.

\fIRtap\fP repeatedly displays the command prompt \*Q>\*U, and executes
each command as it is entered.  For the standalone version, \fB\-f\fP
parameter will execute a stream of commands from the file
\fIfile_name\fP; at the end of that file, \fIrtap\fP will enter
interactive mode.

This man page describes the \fIrtap\fP program included with Release
4.0 of RSVP.  This version of \fIrtap\fP can open multiple sessions
simultaneously.

.SH COMMANDS
.LP
Each \fIrtap\fP command is a single line, starting with the command
verb.  The command verb can be abbreviated.  The command verb may
optionally be preceded by a thread designator of the form:
`Tn' where n is a positive integer.  If there is no thread designator
on a command, it assume the thread of the last designator that appeared.
When \fIrtap\fP starts, T1 is assumed.

The basic \fIrtap\fP commands are as follows:.

.PP
.HP
\fBhelp\fP or \fB?\fP

Display a complete list of \fIrtap\fP commands and their syntax.
.HP
\fBquit\fP

Exit.
.HP
\fBdest\fP <proto> <dest addr>[:<dest port> ]

Calls rapi_session() to define a new session by destination address and
optional port.  Any previous session for the same thread must have been
closed.  The required <proto> parameter must be one of the strings:
`udp' or 'tcp', or `proto <nn>', where <nn> is an integer IP protocol
id.

.HP
\fBsender\fP [ [ <src host>:]<src port> \ <Tspec> ]

Calls rapi_sender() to specify sender attributes and start sending path
state.  It may be issued repeatedly to modify the sender attributes.
The destination from the most recent \fBdest\fP command is assumed.  If
the parameters are entirely omitted, the current sender is removed.

The source host (<src host>) parameter is optional; its default is the
default IP address of the local node.  The Tspec parameter is
required.  The TTL passed in the rapi_sender call is the most recent
value specified in a \fBttl\fP command, or the default TTL value.

.HP
\fBreserve\fP <style> \ [ <reservation parameters> ]

Here <style> can be any of: \*Qwf\*U, \*Qff\*U, or \*Qse\*U.

If <reservation parameters> is omitted, the command deletes the
current reservation (<style> is actually irrelevant, but it must
be present).  Otherwise, they must take the form appropriate to
the style:

.RS
.HP
wf

[*] <flowspec>
.HP
ff

<filtspec> <flowspec> [ <filtspec> <flowspec> ] ...
.HP
se

[<filtspec> ...] <flowspec>
.RE
.HP
\fBclose\fP

Call rapi_release() to close the session.

.HP
\fBttl\fP <integer>

Specify TTL for use in the next \fIsender\fP command in this thread.

.HP
\fBdmask\fP <integer>

Specify debug mask of daemon.

.HP
\fBdlevel\fP <integer>

Specify debug level of daemon.

.HP
\fBconfirm\fP

Cause next reservation request to trigger confirmation upcall.

.HP
\fBreceive\fP [ <receive host> ]

Joins the multicast group indicated by \fIreceive host\fP.  This is
necessary for a UDP-encapsulation-only host running the RSVP daemon, in
order for the daemon to receive Path messages.  The optional <receive
host> parameter specifies the address of a local interface on which
group will be joined; if it is omitted, the default interface will be
used.
.HP
\fBstatus\fP

Show status of session.
.HP
\fBsleep\fP <seconds>

Delay for specified number of seconds.
.LP

Command parameters include filterspecs, flowspecs, and Tspecs.
.HP
Filter specs

A filterspec is represented as <host> [:<port>], where <host> is
an IP host name or numeric IP address and the optional
parameter <port> is an integer.
.HP
Flowspecs

A flowspec is a sequence of parameters enclosed in square brackets.
The following forms are allowed:

	[ gx <R> <S>  <r> <b> <p> <m> <M> ]

	[ cl <r> <b> <m> <M> ]

	[ g <r> <b> <delay> <service level> ]

	[ p <r> <b> <delay> <service level> ]

The first two forms correspond to the Guaranteed and Controlled-Load
integrated service specifications, respectively, and result in
extended-legacy format parameter lists for the API.  The parameters are
as defined in the corresponding service documents.  The last two forms
are for backward compatiblity; either results in a legacy format
parameter list that will be crudely mapped into an integrated service
Controlled-Load specification.
.HP
Tspecs

A Tspec is a sequence of parameters enclosed in square brackets.
The following forms are allowed:

	[ t <r> <b> <p> <m> <M> ]

	[ g <r> <b> ]

	[ p <r> <b> ]

The first form creates an extended-legacy format parameter list for a
general Tspec, according to the integrated services specifications.
The last three forms are for backward compatiblity; each results in a
legacy format parameter list that will be crudely mapped into a general
Integrated Services Tspec.  Only the <r> and <b> parameters are required.

.SH "SEE ALSO"
.LP
rsvpd(1m), rstat(1m), rsvpeep(1m), rsvpfilter(1m), psifconfig(1m)

.SH BUGS

The sleep command works properly only for the standalone version of
\fIrtap\fP.
