calmsacibis995/irix-6517-src/eoe/man/man1m/runacct.1m
.\" Copyright 1992, 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.TH runacct 1M
.SH NAME
\f4runacct\f1 \- run daily accounting
.SH SYNOPSIS
.nf
\f4/usr/lib/acct/runacct\f1 [\f2mmdd\fP [\f2state\fP]]
.fi
.SH DESCRIPTION
\f4runacct\fP
is the main daily accounting shell procedure.
It is normally initiated via
\f4cron\fP.
\f4runacct\fP
processes connect, fee, disk, and process accounting files.
It also prepares summary files for
\f4prdaily\fP
or billing purposes.
\f4runacct\fP
is distributed only to source code licensees.
.PP
\f4runacct\fP
takes care not to damage active accounting files or summary
files in the event of errors.
It records its progress by writing descriptive diagnostic
messages into
\f2active\f1.
When an error is detected, a message is written to
\f4/dev/console\f1,
mail (see \f4mail\fP(1)) is sent to
\f4root\f1 and \f4adm\f1,
and \f4runacct\fP terminates.
\f4runacct\fP
uses a series of lock files to protect against re-invocation.
The files
\f4lock\f1 and \f4lock1\f1
are used to prevent simultaneous invocation, and
\f4lastdate\f1
is used to prevent more than one invocation per day.
.PP
\f4runacct\fP
breaks its processing into separate, restartable
\f2states\f1
using
\f2statefile\f1
to remember the last
\f2state\f1
completed.
It accomplishes this by writing the
\f2state\f1
name into
\f2statefile\f1.
\f4runacct\fP
then looks in
\f2statefile\f1
to see what it has done and to determine what to process next.
\f2states\f1
are executed in the following order:
.TP 13
\f4SETUP\f1
Move active accounting files into working files.
.TP
\f4WTMPFIX\f1
Verify integrity of
\f4wtmp\fP
file, correcting date changes if necessary.
.TP
\f4CONNECT\f1
Produce connect session records in
\f4tacct.h\f1
format.
.TP
\f4PROCESS\f1
Convert process accounting records into
\f4tacct.h\f1
format.
.TP
\f4MERGE\f1
Merge the connect and process accounting records.
.TP
\f4FEES\f1
Convert output of
\f4chargefee\fP
into
\f4tacct.h\f1
format and merge with connect and process accounting records.
.TP
\f4DISK\f1
Merge disk accounting records with connect, process, and fee accounting
records.
.TP
\f4MERGETACCT\f1
Merge the daily total accounting records in \f4daytacct\f1
with the summary total accounting records in
\f4/var/adm/acct/sum/tacct\f1.
.TP
\f4CMS\f1
Produce command summaries.
.TP
\f4USEREXIT\f1
Any installation dependent accounting programs can be included here.
.TP
\f4CLEANUP\f1
Clean up temporary files and exit.
.PP
To restart \f4runacct\fP after a failure,
first check the
\f2active\f1 and \f2fd2log\fP
files for diagnostics, then fix any corrupted data files,
such as \f4pacct\f1 or \f4wtmp\f1.
The
\f4lock\f1, \f4lock1\f1, and
\f4lastdate\f1 files must be removed
before \f4runacct\fP can be restarted.
The argument
\f2mmdd\f1
is necessary if \f4runacct\fP is being restarted,
and
specifies the month and day for which
\f4runacct\fP
reruns the accounting.
The entry point for processing is based on the contents of
\f2statefile\f1;
to override this,
include the desired
\f2state\f1
on the command line to designate where processing
should begin.
.PP
The report generation commands check the environment in order to allocate enough memory to handle
system with large configuration.
The environment variables can be set in the
appropriate
\f2crontab\fP
files where
\f4runacct\fP
is usually invoked.
.SH "EXAMPLES"
To start \f4runacct\fP:
.Ex
\f4nohup runacct 2 > /var/adm/acct/nite/fd2log &\f1
.Ee
To restart \f4runacct\fP:
.Ex
\f4nohup runacct 0601 2 >> /var/adm/acct/nite/fd2log &\f1
.Ee
To restart \f4runacct\fP at a specific \f2state\fP:
.Ex
\f4nohup runacct 0601 MERGE 2 >> /var/adm/acct/nite/fd2log &\f1
.Ee
.SH FILES
.nf
.ft 4
/var/adm/wtmp
/var/adm/pacct\f2incr\f4
/usr/src/cmd/acct/tacct.h
/usr/src/cmd/acct/ctmp.h
/var/adm/acct/nite/active
/var/adm/acct/nite/daytacct
/var/adm/acct/nite/lock
/var/adm/acct/nite/lock1
/var/adm/acct/nite/lastdate
/var/adm/acct/nite/statefile
.ft 1
.fi
.SH REFERENCES
acct(1M),
acctcms(1M),
acctcom(1),
acctcon(1M),
acctmerg(1M),
acctprc(1M),
acctsh(1M),
cron(1M),
fwtmp(1M),
mail(1),
acct(2),
acct(4),
utmp(4).
.SH NOTICES
Normally it is not a good idea to restart
\f4runacct\fP
in the
\f4SETUP\f1
\f2state\f1.
Run
\f4SETUP\f1
manually and restart via:
.Ex
\f4runacct \f2mmdd\fP WTMPFIX\f1
.Ee
If
\f4runacct\fP
failed in the
\f4PROCESS\f1
\f2state,\f1
remove the last
\f4ptacct\f1
file because it is not complete.
.PP
Each time \f4runacct\fP is run, it resets the \f4/var/adm/wtmp\fP file.
This make programs like \f4last\fP(1) less useful.
