calmsacibis995/irix-6517-src/eoe/man/man1m/rwhod.1m
'\"macro stdmacro
.if n .pH man1.rwhod @(#)rwhod	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} RWHOD 1M "Silicon Graphics" "\&"
.if \nX=1 .ds x} RWHOD 1M "Source Code Control System Utilities"
.if \nX=2 .ds x} RWHOD 1M "" "\&"
.if \nX=3 .ds x} RWHOD "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
rwhod \- system status server 
.SH SYNOPSIS
.B /usr/etc/rwhod
[
.B \-m 
[
.I ttl
]
]
.SH DESCRIPTION
.I Rwhod
is the server which maintains the database used by the
.IR rwho (1C)
and
.IR ruptime (1C)
programs.  Its operation is predicated on the ability to
.I broadcast
or
.I multicast
messages on a network.
.I Rwhod
is started at system initialization if the configuration flag
.I rwhod
is set ``on'' with 
.IR chkconfig (1M).
Site-dependent 
options and arguments to 
.I rwhod 
belong in the file
.IR /etc/config/rwhod.options .
.PP
.I Rwhod
operates as both a producer and consumer of status information.
As a producer of information it periodically
queries the state of the system and constructs
status messages which are broadcast or multicast on a network.
As a consumer of information, it listens for other
.I rwhod
servers' status messages, validating them, then recording
them in a collection of files located in the directory
.IR /usr/spool/rwho .
.PP
The server transmits and receives messages at the port indicated
in the ``rwho'' service specification; see 
.IR services (4).
The messages sent and received, are defined in <protocols/rwhod.h>:
.PP
.nf
\s-1
.ta 0.5i 1.0i 2.3i
struct	outmp {
	char	out_line[8];		/* tty name */
	char	out_name[8];		/* user id */
	long	out_time;		/* time on */
};
.sp
struct	whod {
	char	wd_vers;		/* protocol version # */
	char	wd_type;		/* packet type: \s-2WHODTYPE_STATUS\s0 */
	char	wd_pad[2];
	int	wd_sendtime;		/* time stamp by sender */
	int	wd_recvtime;		/* time stamp applied by receiver */
	char	wd_hostname[32];	/* host's name */
	int	wd_loadav[3];		/* load average as in uptime */
	int	wd_boottime;		/* time system booted */
	struct	whoent {
		struct\ outmp we_utmp;	/* active tty info */
		int\ we_idle;	/* tty idle time */
	} wd_we[1024 / sizeof (struct whoent)];
};
.fi
\s+1
.PP
All fields are converted to network byte order prior to
transmission.  The load averages 
represent smoothed CPU loads over the 5, 10, and 15 minute 
intervals prior to a server's transmission; they are multiplied by 100
for representation in an integer.
.PP
The host name
included is that returned by the
.IR gethostname (2)
system call, with any trailing domain name omitted.
The array at the end of the message contains information about
the users logged in to the sending machine.  This information 
includes the contents of the 
.IR utmp (4)
entry for each non-idle terminal line and a value indicating the
time in seconds since a character was last received on the terminal line.
.PP
Messages received by the
.I rwho
server are discarded unless they originated at an
.I rwho
server's port.  In addition, if the host's name, as specified
in the message, contains any unprintable ASCII characters, the
message is discarded.  Valid messages received by
.I rwhod
are placed in files named
.RI whod. hostname
in the directory
/usr/spool/rwho.
These files contain only the most recent message, in the
format described above.
.PP
Status messages are generated approximately once every
3 minutes.
.I Rwhod
performs an
.IR nlist (3)
on /unix every 30 minutes to guard against
the possibility that this file is not the system
image currently operating.
.P
.I Rhwod
recognizes the following options:
.IP \-m
causes 
.I rwhod 
to use IP multicast (instead of
broadcast or unicast) on all multicast-capable interfaces
(excluding the loopback interface).  The multicast
reports are sent with a time-to-live of 1, to prevent
forwarding beyond the directly-connected subnet(s).
.IP "\-m \f2ttl\fP"	
causes 
.I rwhod 
to send IP multicast datagrams with a
time-to-live of \f2ttl\fP, via the default multicast interface only rather
than all interfaces.  \f2ttl\fP must be between 0 and
32.  Note that "\-m 1"
is different than "\-m", in that "\-m 1" specifies
transmission on one interface only.
This allows the information to be relayed between networks.
.P
When "\-m" is used without a \f2ttl\fP argument, the program accepts multicast
.I rwhod 
reports from all multicast-capable interfaces.  If a \f2ttl\fP argument
is given, it accepts multicast reports from only one interface, the one
on which reports are sent (which may be controlled via the host's routing
table).  Regardless of the "\-m" option, the program accepts broadcast or
unicast reports from all interfaces.  Thus, this program will hear the
reports of old, non-multicasting 
.IR rwhod 's, 
but, if multicasting is used,
those old 
.IR rwhod 's 
won't hear the reports generated by this program.
.SH "SEE ALSO"
rwho(1C),
ruptime(1C),
rup(1C)
.SH BUGS
Status information should be sent only upon request rather than continuously.
People often interpret the server dying
or network communication failures
as a machine going down.
'\".so /pubs/tools/origin.bsd
