calmsacibis995/irix-6517-src/eoe/man/man1m/sar.1m
'\"macro stdmacro
.if n .pH g1a.sar @(#)sar	30.5 of 2/3/86
.if t .ds ' \h@.05m@\s+4\v@.333m@\'\v@-.333m@\s-4\h@.05m@
.if n .ds ' '
.if t .ds ` \h@.05m@\s+4\v@.333m@\`\v@-.333m@\s-4\h@.05m@
.if n .ds ` `
.nr X
.if \nX=0 .ds x} SAR 1M "Performance Measurement Utilities" "\&"
.if \nX=1 .ds x} SAR 1M "Performance Measurement Utilities"
.if \nX=2 .ds x} SAR 1M "" "\&"
.if \nX=3 .ds x} SAR "" "" "\&"
.TH \*(x}
.nh
.SH NAME
sar: sa1, sa2, sadc \- system activity report package
.SH SYNOPSIS
.B /usr/lib/sa/sadc
[t n]
[\|ofile\|]
.PP
.B /usr/lib/sa/sa1
[t n]
.PP
.B /usr/lib/sa/sa2
.RB [\| \-ubdDycwaqvmprtghIA\| ]
.RB [ \-s 
time\|]
.RB [ \-e
time\|]
.RB [ \-i
sec\|]
.SH DESCRIPTION
System activity data can be accessed at the special request
of a user
(see
.IR sar (1))
and automatically on a routine basis as described here.
The operating system contains a number of
counters that are incremented as various system actions occur.
These include counters for
.SM CPU
utilization,
buffer usage,
disk
.SM I/O
activity,
.SM TTY
device
activity, switching
and system-call activity, file-access,
queue activity, inter-process communications, paging and graphics.
.PP
.I sadc
and
shell procedures,
.I sa1
and
.IR sa2 ,
are used to sample,
save, and process this data.
.PP
.IR sadc ,
the data collector,
samples system data
.I n
times every
.I t
seconds and writes in binary format to
.I ofile
or to standard output.
If
.I t
and
.I n
are omitted,
a special record is written.
This facility is used at system boot time, when booting to a 
multiuser state,
to mark the time at which the counters restart from zero.
For example, the \f3/etc/init.d/perf\f1 file writes the 
restart mark to the daily data by the command entry:
.RS
.sp
su sys \|\-c "/usr/lib/sa/sadc /var/adm/sa/sa\*`date +%d\*`"
.sp
.RE
.PP
The shell script
.IR sa1 ,
a variant of
.IR sadc ,
is used to collect and store data in binary file
.BI /var/adm/sa/sa dd
where
.I dd
is the current day.
The arguments
.I t
and
.I n
cause records to be written
.I n
times at an interval of
.I t
seconds, or once if omitted.
The entries in
.B /usr/spool/cron/crontabs/sys
(see
.IR cron (1M)):
.RS
.sp
0 \(** \(** \(** 0-6 /usr/lib/sa/sa1
.br
20,40 8\-17 \(** \(** 1\-5 /usr/lib/sa/sa1 
.sp
.RE
will produce records every 20 minutes during working hours and hourly
otherwise.
.PP
The shell script
.IR sa2 ,
a
variant of
.IR sar (1),
writes a daily report
in file
.BI /var/adm/sa/sar dd\f1.\fP
The options are explained in
.IR sar (1).
The
.B /usr/spool/cron/crontabs/sys 
entry:
.PP
.RS
5 18 \(** \(** 1\-5 /usr/lib/sa/sa2 \-s 8:00 \-e 18:01 \-i 1200 \-A
.RE
.PP
will report important activities hourly during the working day.
.SH FILES
.RI /var/adm/sa/sa "dd	"
daily data file
.br
.RI /var/adm/sa/sar "dd	"
daily report file
.br
.RB /tmp/sa . "adrfl	"
address file
.SH SEE ALSO
sar(1), timex(1),
cron(1M)
.\"	@(#)sar.1m	6.2 of 9/2/83
.Ee
'\".so /pubs/tools/origin.att
