calmsacibis995/irix-6517-src/eoe/man/man1m/sat_select.1m
.TH sat_select 1M
.SH NAME
sat_select \- preselect events for the system audit trail to gather
.SH SYNOPSIS
.nf
\f3sat_select\f1 [ \f3\-h\f1 ] [ \f3\-out\f1 ] [( \f3\-on\f1 | \f3\-off\f1 ) \c
event ... ]
.fi
.SH DESCRIPTION
.I sat_select
directs the system audit trail
to collect records describing certain events
and to ignore records describing certain other events.
.I sat_select
with no arguments lists the audit events currently being collected.
.P
The effect of multiple executions of
.I sat_select
is cumulative.
.P
The auditable event types are described in the
.IR "IRIX Admin: Backup, Security, and Accounting" .
For a brief, online description, see the
comments in
.IR /usr/include/sys/sat.h .
.P
See
.IR audit (1M)
or the
.I "IRIX Admin: Backup, Security, and Accounting"
guide for more information on configuring the audit subsystem.
.P
If the audit daemon,
.IR satd (1M),
isn't running,
.I sat_select
does not select any audit events for auditing.
This is to prevent inadvertently halting the system, which can happen if
an audit daemon is not running to remove events from the queue.
.SH OPTIONS
.TP 13
.B \-h
Help is provided.
The names of all possible audit events are displayed.
.TP
.B \-out
The names of all active audit events are displayed in same format that
.I sat_select
uses for its command line arguments.
.TP
.BI \-on " event"
Select records containing the specified audit \f2event\fP.
The format of the event string is defined in the
.IR sat_eventtostr (3)
reference page.
If \f3all\f1 is given as the event string, all event types are selected.
.TP
.BI \-off " event"
Ignore records containing the specified audit \f2event\fP.
The format of the event string is defined in the
.IR sat_eventtostr (3)
reference page.
If \f3all\f1 is given as the event string, all event types are ignored.
.SH FILES
.ta \w'/etc/config/auditXXX'u
.nf
/etc/init.d/audit	system audit startup script
/etc/config/audit	configuration file, \f3on\f1 if auditing is enabled
/etc/config/sat_select.options
	optional file for site-dependent \f2sat_select\f1 options
.fi
.SH EXAMPLES
To collect records describing all System V IPC events
(creation, change, access, or removal of
semaphores, message queues, and shared memory segments),
in addition to whatever events were previously selected
for collection,
give this command:
.Ex
\f4sat_select -on sat_svipc_create -on sat_svipc_change \\
-on sat_svipc_access -on sat_svipc_remove\f1
.Ee
To ignore records describing all events,
regardless of what may have been previously selected,
but to collect records initiated by trusted administrative programs
such as
.I login
and
.I su,
give this command:
.Ex
\f4sat_select -off all -on sat_ae_audit -on sat_ae_identity \\
-on sat_ae_custom\f1
.Ee
To save the current audit state in a file that
.I sat_select
can read:
.Ex
\f4sat_select -out > /etc/config/sat_select.options\f1
.Ee
To restore the audit state from a previously saved file:
.Ex
\f4sat_select `cat /etc/config/sat_select.options`\f1
.Ee
.SH "SEE ALSO"
sat_interpret(1M),
sat_reduce(1M),
sat_summarize(1M),
satd(1M),
satctl(2),
sat_eventtostr(3).
.PP
\f2IRIX Admin: Backup, Security, and Accounting\f1
