calmsacibis995/irix-6517-src/eoe/man/man1m/sat_summarize.1m
.TH sat_summarize 1M
.SH NAME
sat_summarize \- generate statistics on a stream of audit records
.SH SYNOPSIS
.nf
\f3/bin/sat_summarize\f1 [ \f3\-bdelotuv\f1 ] [ \f3\-z timezone\f1 ] \c
 [ \f2infile\f1 ]
.fi
.SH DESCRIPTION
.I sat_summarize
prints a statistical summary of the audit trail to the standard output
device.
Data is displayed
either when end of file is reached on input
or when
.I sat_summarize
receives the
.B SIGUSR1
signal.
.PP
Run time options determine the format of the printout and which statistics
are presented.
.SH OPTIONS
.TP 9
.B \-b
Print statistics in brief mode (default).
.TP
.B \-d
Debug mode.  Prints out additional information about the audit log file such
as record and header size.
.TP
.B \-e
Display numbers of audit records found, by event type.
.TP
.B \-f
File descriptors are mapped to the filenames to which they apply whenever
possible.
.TP
.B \-l
Linear mode.  Display the statistics in a very terse one line per record
format.
.TP
.B \-o
Input (whether standard input or file input)
is copied to standard output.
This option makes it possible to use
.I sat_summarize
as one of a chain
of audit tools connected by pipes.
.TP
.B \-t
Print average rate of audit trail generation, in records per minute, and
number of audit records generated in the last minute.
.TP
.B \-u
Display numbers of audit records found, by user.
.TP
.B \-v
By default, zero valued entries from user or event lists are not printed.
The verbose option enables printing of zero valued entries.
.TP
.B \-z timezone
Set the timezone to that of the file.
.TP
.I infile
Data is taken from
.IR infile .
If
.I infile
is not specified, data is taken, by default, from the standard input.
The format of
.I infile
is identical to the output generated by
.IR satd (1M)
and
.IR sat_reduce (1M).
.SH DEFAULT
If no arguments are given,
.B \-e
is assumed.
.I sat_summarize
displays the numbers of audit records, broken down by event type.
.SH EXAMPLE
.I sat_summarize
is ordinarily used in combination with other audit filters.
To obtain audit records and
display a complete statistical summary,
execute this command sequence:
.Ex
\f4satd -o -f /var/adm/sat | sat_summarize -t -e -u\f1
.Ee
.SH "SEE ALSO"
audit(1M),
kill(1),
sat_interpret(1M),
sat_reduce(1M),
sat_select(1M),
satd(1M).
.PP
\f2IRIX Admin: Backup, Security, and Accounting\f1
