calmsacibis995/irix-6517-src/eoe/man/man1m/sat_echo.1m
.TH sat_echo 1M
.SH NAME
sat_echo \- echo standard input into the system audit trail
.SH SYNOPSIS
.nf
\f3sat_echo\f1 { \f3\-F\f1 | \f3\-S\f1 } \f2satevent\f1
.fi
.SH DESCRIPTION
.I sat_echo
inserts the data from its standard input into the system audit trail.
(Only the first 65535 bytes of standard input are used; the rest are discarded.)
Use
.I sat_echo
in shell scripts that enforce security policy
and must generate audit records.
.SH OPTIONS
Either
.B \-F
or
.B \-S
must be supplied,
but not both at once.
.I satevent
is a required argument.
.PP
The options are:
.TP 11
.B \-F
The action described by this audit record
.IR failed .
.TP
.B \-S
The action described by this audit record
.IR succeeded .
.TP
.I satevent
The printed representation of an audit event type,
as described in
.IR sat_strtoevent (3).
If you want to customize the audit trail with the addition
of event types specific to your site, use the
.I sat_ae_custom
event type.
If you need to distinguish between different types of
.I sat_ae_custom
events, structure the event specific data so that it
begins with a sub-event type.
.SH EXAMPLE
Suppose a site security officer (SSO) wanted to make sure that the auditor
was made aware of any changes to system databases in
.IR /etc .
After the system was installed, the SSO would have created a master
file describing the
.I /etc
tree.
.Ex
\f4find /etc -print | xargs ls -dlM > /var/adm/etc-master\f1
.Ee
A shell script is run nightly that compares the current state
of the
.I /etc
tree with the state when the master was made.
When discrepancies are found, an audit record is generated.
.Ex
\f4find /etc -print | xargs ls -dlM > /tmp/etc-tonight
diff /var/adm/etc-master /tmp/etc-tonight > /tmp/etc-diff
if [ -s /tmp/etc-diff ]
     sat_echo -F sat_ae_custom < /tmp/etc-diff
else
     echo "Nightly /etc check shows no discrepancies." | \\
     sat_echo -S sat_ae_custom
fi\f1
.Ee
.SH SEE ALSO
satwrite(2),
sat_strtoevent(3).
