calmsacibis995/irix-6517-src/eoe/man/man1m/satmpd.1m
'\"macro stdmacro
.nr X
.if \nX=0 .ds x} SATMPD 1M "Trusted Networking Commands" "\&"
.if \nX=1 .ds x} SATMPD 1M "Trusted Networking Commands"
.if \nX=2 .ds x} SATMPD 1M "" "\&"
.if \nX=3 .ds x} SATMPD "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
satmpd \- Security Attribute Token Mapping Protocol Daemon
.SH SYNOPSIS
.B /usr/bin/satmpd 
[ 
.B \-c 
.I configdir 
] 
[ 
.B \-d 
.I debug-options 
] 
[
.B \-l
.I logfile
]
[ 
.B \-p 
.I port 
] 
.SH DESCRIPTION
A daemon that implements the Security Attribute Token Mapping Protocol,
(SATMP).  It is also known as the Token Mapping Daemon.
.SH OPTIONS
.TP 
.BI \-c " configdir"
Set the location of satmpd configuration files to 
.IR configdir .
.TP 
.BI \-d " debug-options"
Turn on the requested debugging options.
These must be entered as a single option or as a
comma-separated list with no whitespace.
Acceptable values are STARTUP, FILE_OPEN, DIR_OPEN, OPEN_FAIL,
OPENDIR_FAIL, PROTOCOL, and ALL.  The
.B \-d
option may be given more than once.
.TP
.BI \-l " logfile"
Direct debugging output to file
.IR logfile .
.TP 
.BI \-p " port"
Force satmpd to listen on alternate port 
.IR port .
.SH "CONFIGURATION FILES"
The following configuration files are required.  It is an
unrecoverable error if any of these are missing.
.SS ATTRIDS
This file contains human-readable names of the SATMP attributes plus their
numerical values.  Each ATTRIDS entry consists of a single
line with the following format:
.PP
.RS 5
<attribute>:<number>
.RE
.PP
The 
.B ATTRIDS
file supplied with your system contains the following entries:
.PP
.RS 5
SEN_LABEL:0
.br
NATIONAL_CAVEATS:1
.br
INTEGRITY_LABEL:2
.br
INFO_LABEL:3
.br
PRIVILEGES:4
.br
AUDIT_ID:5
.br
IDS:6
.br
CLEARANCE:7
.br
AUDIT_INFO:8
.br
UNASSIGNED_9:9
.br
ACL:10
.br
UNASSIGNED_11:11
.RE
.PP
The following attributes are not supported
under Trusted IRIX and are silently ignored: NATIONAL_CAVEATS,
INFO_LABEL,
CLEARANCE, AUDIT_INFO,
ACL,
UNASSIGNED_9, and
UNASSIGNED_11.
.SS REQATTR
This file contains human-readable names of 
the attributes all clients must support. These
names must match those in ATTRIDS.  For example:
.PP
.RS 5
SEN_LABEL
.br
PRIVILEGES
.br
ACL
.RE
.SS WEIGHTS
This file contains information regarding weights assigned to
domains of translation.  When the local and remote host have
more than one domain of translation in common for a given
attribute, the weight is used to determine which domain of 
translation is used.  Weight entries should be listed in
descending order within the file, one per line, with
the following format:
.PP
.RS 5
<attribute>:<domain>:<weight>
.RE
.PP
For example:
.PP
.RS 5
ACL:SGI:255
.br
ACL:DECMLS:250
.br
ACL:SUN:245
.RE
.SS "localmap"
This file contains remote-to-local attribute mapping information. 
Each entry consists of one-line with the following format:
.PP
.RS 5
<attribute>:<domain>:<source>:<dest>
.RE
.PP
The meaning of <source> and <dest> is attribute specific.  If the map
in any domain has a <source> field with the value "NATIVE_MAPPING",
the map is ignored and SGI native mapping is assumed.  Otherwise,
the meaning of <source> and <dest> is as follows:
.PP
.B PRIVILEGES
.PP
<source> is the remote representation, as one "word". The
remote representation of the privilege set is broken up
into words, which are then matched against <source>.
.PP
<dest> is an SGI format capability set. Again, only the
effective set matters, and a one-to-many mapping is possible.
.PP
Examples:
.PP
.RS 5
PRIVILEGES:SGI:mac-read:CAP_MAC_READ+e
.br
PRIVILEGES:SGI:all-privs:all+eip
.RE
.PP
.B AUDIT_ID
.PP
<source> is the remote user name and
<dest> is the local user name.
.PP
Examples:
.PP
.RS 5
AUDIT_ID:SGI:gails:gsmith
.br
AUDIT_ID:SGI:cbj:charles
.RE
.PP
.B IDS
.PP
User and group ids are listed on separate lines.
For each, <source> is the remote name and 
<dest> is the local name.
.PP
Examples:
.PP
.RS 5
IDS:SGI:user,gails:gsmith
.br
IDS:SGI:group,square:wheel
.RE
.PP
.B SEN_LABEL
.br
.B INTEGRITY_LABEL
.PP
For each entry, <source> is the remote representation and 
<dest> is the local representation.
.PP
Mandatory access control
labels consist of a sensitivity
label and an integrity label.  For each of these,
there are some administrative labels, which consist
only of a type, and other labels, msentcsec and mintbiba, that consist of
components.  Administrative labels are represented by entries
with the attribute "type".  The sensitivity label
"msentcsec" and the integrity label "mintbiba"
are not specified as types.  Instead, each level or grade
and category or division is specified on a single line.  Note that
grades should be specified as "level" and division as "category". 
.PP
Examples:
.PP
.RS 5
SEN_LABEL:SGI:type,msenhigh:highadmin
.br
SEN_LABEL:SGI:level,lords:senate
.br
SEN_LABEL:SGI:level,commons:house
.br
SEN_LABEL:SGI:category,crimson:red
.RE
The daemon is implemented to facilitate matching
between Trusted IRIX representations and those of
other vendors, which do not have separate types
for administrative labels.  To map a remote,
non Trusted IRIX representation to a local
representation, the remote label representation is 
first compared with
"type" entries.  If it matches in toto, then is not a
msentcsec or mintbiba label and the local label representation
in the "type" entry is the complete local
representation of that label.
Otherwise, the remote representation is broken into words.
The largest subsequence of words is matched against "level" entries. 
If no subsequence matches (in other words,
even the first word of the label has no match) it is rejected.
Otherwise, any remaining words are matched 
one at a time against entries
of type "category".
.SS "remotemap"
This file contains local-to-remote attribute mapping information. 
The  entries have the same format as in
.BR localmap .
.PP
The meaning of <source> and <dest> is attribute specific. If the map
in any domain has a <source> field with the value "NATIVE_MAPPING",
the map is ignored and SGI native mapping is assumed.  Otherwise,
the meaning of <source> and <dest> is as follows:
.PP
.B PRIVILEGES
.PP
<source> is an SGI format capability set. Only the effective
capabilities are examined.  Multiple
capabilities may be specified; a many-to-one mapping is
possible.
.PP
<dest> is the remote representation of <source>
.PP
Examples:
.PP
.RS 5
PRIVILEGES:SGI:CAP_MAC_READ+e:mac-read
.br
PRIVILEGES:SGI:all+eip:all-privs
.RE
.PP
.PP
.B AUDIT_ID
.PP
<source> is the local user name and
<dest> is the remote user name.
.PP
Examples:
.PP
.RS 5
AUDIT_ID:SGI:gsmith:gails
.br
AUDIT_ID:SGI:charles:cbj
.RE
.PP
.B IDS
.PP
User and group ids are listed on separate lines.
For each, <source> is the local name and 
<dest> is the remote name.
.PP
Examples:
.PP
.RS 5
IDS:SGI:user,gsmith:gails
.br
IDS:SGI:group,wheel:square
.RE
.PP
.B SEN_LABEL
.br
.B INTEGRITY_LABEL
.PP
For each entry, <source> is the local representation and 
<dest> is the remote representation.
.PP
Examples:
.PP
.RS 5
SEN_LABEL:SGI:type,highadmin:msenhigh
.br
SEN_LABEL:SGI:level,senate:lords
.br
SEN_LABEL:SGI:level,house:commons
.br
SEN_LABEL:SGI:category,red:crimson
.RE
.PP
The daemon is implemented to correctly map local
Trusted IRIX representations  to those of
other vendors, which do not have separate types
for administrative labels. 
If the local label is not a msentcsec or
mintbiba label, then it is
matched against "type" entries, and the remote
label representation is complete.
If the local label is a msentcsec or mintbiba label, 
its local representation is divided into a level, or
grade, and one or more categories, or divisions.
The remote label represenation is constructed
by matching the level or grade
portion  against "level" entries, and matching each
category or grade against "category" entries.
.SH "SEE ALSO"
iflabel(1m),
rhost(1m),
samp(7p),
satmp(7p),
trusted_networking(7),
tsix(7p).
