calmsacibis995/irix-6517-src/eoe/man/man1m/scsiha.1m
.TH scsiha 1m
.SH NAME
scsiha \- probe and control scsi buses
.SH SYNOPSIS
.nf
\f3scsiha\f1 [\f3\-lprt\f1] [\f3\-D\f1 \f2debuglevel\f1] \c
[\f3\-L\f1 \f2targetID|\f3all\f1] {\f2bus_number\f1 | \f2device\f1} ...
.fi
.SH DESCRIPTION
.I scsiha
is used to perform operations on fibrechannel loops of SCSI devices
and parallel SCSI buses.
.PP
The following options apply to both parallel SCSI and fibrechannel SCSI:
.TP
.B \-p
Probe for devices on the bus or loop.
On parallel SCSI buses, this option causes the driver to look
for devices at every ID on the SCSI bus.
On fibrechannel SCSI loops, this option causes the driver to look
for devices at every ID that was reported in use at the most recent
loop initialization.
On parallel SCSI buses, when a device is found at
lun 0, all other luns are then probed.
When devices or luns are not
valid, a warning message may be printed on the console.
With fibrechannel, the Report Luns SCSI command is used to determine
which LUNs are valid.  If the Report Luns command returns error,
only LUN 0 is assumed to be valid.
.IP
After probing, new devices will have a controller number of "-1"
until \f3ioconfig -f /hw\f1 is run to update the hardware graph.
.TP
.B \-r
Perform a SCSI bus reset and/or reset host adapter.
.IP
\f3This affects all devices on that SCSI bus, causing current commands
to be aborted, and specially set parameters to be reset, in many cases.
Tape drive state will be reset after this, and any tape operations in
progress will be aborted\fP.
.IP
This option should therefore be used with some caution.  In very rare
cases, it may cause a device to become unusable without a powercycle.
There are times
when it is desired to reset devices or adapters that appear to be
hung, however, so this function is provided.
Some host adapter drivers will reset the adapter as part of this ioctl.
Fibrechannel adapters will perform loop initialization,
making this operation similar to the \f3\-l\f1
option, except that the adapter will also be reset.
.TP
.B \-D \f2debuglevel\f1
Set the debug level in the host adapter driver.
Where supported, this
option changes the verbosity of a given host adapter driver.
In general, 0 is least verbose, with no specific upward limit.
.PP
The following option only applies to some parallel SCSI adapters:
.TP
.B \-t
Return interesting SCSI bus and attached target parameters. Bus
parameters include whether the bus is single-ended or differential,
the SCSI host ID and the selection timeout. The target parameters
include whether the device is capable of operating in narrow or wide
mode, whether it's capable of doing synchronous transfer and if so,
what the period and offset is.
.PP
The following options only apply to Fibrechannel SCSI adapters:
.TP
.B \-l
Perform loop initialization.  During loop initialization, all devices
on the loop will attempt to acquire a target ID.  SGI devices will
attempt to get the ID they have been selected for, either by settings
on and position within an enclosure, or by dials/switches on the device.
If multiple devices have the same ID selection, only one device will
get that ID.  Other devices will attempt to acquire IDs not in already
in use.
.IP
\f3This option may have a side effect of aborting current commands
outstanding on the adapter, so it should be used with care.  The
disk driver will typically reissue the aborted commands, but there
will be a performance impact while commands are reissued.
.IP
.TP
.B \-L \f2targetID\f1
Send LIPRST to the specified device and then perform loop initialization.
This option is much like \f3-l\f1 above, except that it also requests that
the device resets itself.  Not all devices will honor the request.
RAID controllers typically don't while disk drives typically do.
This option can be used in rare cases where a device is not functioning
properly,
but is still able to complete loop initialization and acquire a target
ID.  For example, if a drive gets timeouts on attempts to probe
(using the \f3-p\f1 option above), then this option may bring it back
to working condition.  In this respect, the \f3-L\f1 option can be used for
reasons similar to \f3-r\f1 on parallel SCSI buses.
.TP
.B \-L all\f1
This option is like the \f3-L\f1 option directly above, except that
it directs all devices to reset themselves.  Only devices that
implement FC-AL-2 or later will respond to this.  This option can
be used if a loop is malfunctioning, and it is suspected that one
or more devices may be causing the malfunction, but it isn't known
which.  RAID controllers typically don't honor the "self-reset"
function of the LIPRST
.IP
\f3The -L options may have a side effect of aborting current commands
outstanding on the adapter, and it if the device honors the reset
function, outstanding commands to it will be dropped.  The
disk driver will typically reissue the aborted commands, but there
will be a performance impact while commands are reissued and while
a device resets.
.SH EXAMPLES
To reset parallel scsi bus 2, use one of these commands:
.Ex
\f4scsiha -r 2
scsiha -r /hw/scsi_ctlr/2/bus\f1
.Ee
To probe scsi bus 0, use one of these commands:
.Ex
\f4scsiha -p 0
scsiha -p /hw/scsi_ctlr/0/bus\f1
.Ee
To reset target 8 and then perform loop initialization on fibrechannel
bus 6, do the following:
.Ex
\f4scsiha -L 8 6
scsiha -L 8 /hw/scsi_ctlr/6/bus\f1
.SH FILES
/hw/scsi_ctlr/*/bus     the scsi bus operation devices
.SH SEE ALSO
ioconfig(1M),
scsicontrol(1M),
scsiha(7M).
.SH NOTE
This command is normally usable only by the superuser, because
the standard permissions of the devices in
.I /hw/scsi_ctlr/*
restrict
access to other users.
.PP
With Fibrechannel adapters, if a loop is broken after a system has been
operational, numerous attempts will be made to reinitialize the loop,
after which
the host adapter driver will give up on the loop.
At this point, if the hardware condition causing the broken loop is
fixed (box of drives powered back on, cable reinserted, etc.), the
\f3-r\f1 option should be used to re-establish loop operation.
.PP
The source to this program is also shipped as sample source code
in the \f3irix_dev.gifts.scsi\fP subsystem as part of IDO.
.PP
The Performance Co-Pilot (see
.I PCP(1))
may be used to monitor SCSI devices, however 
configuration changes by
.I scsiha
may not be asynchronously detected.
If SCSI devices are being monitored,
.I libirixpmda(5)
may be notified and forced to reset using the command:

.in 1.5i
.ft CW
.nf
> pmstore irix.xbow.switch 1
.fi
.ft R
.in
