calmsacibis995/irix-6517-src/eoe/man/man1m/scsicontrol.1m
'\"macro stdmacro
.TH scsicontrol 1m
.SH NAME
scsicontrol \- probe and control scsi devices
.SH SYNOPSIS
.B /usr/sbin/scsicontrol
.B [-CDHISacdegilmqsv] [-b blockize]
.I device ...
.SH DESCRIPTION
.I scsicontrol
may be used to print info from the SCSI inquiry commands, which
normally indicate the device type, manufacturer, and similar info.
Other options may be used show
more data, or to issue commands that control the operation of the
device, or the bus as a whole.  By using the debug option
.RB ( -d ),
the exact command sent, and the data returned (if any) is displayed,
along with more extensive error information.
.PP
The device(s) may be specified without the normal
.I /dev/scsi
prefix, if desired.
.PP
.TP
.B -C
Send the SGI-specific command that causes the CD-ROM drive to
reply to the inquiry command (see
.B -i
below) as a CD-ROM drive.  On poweron, or after a SCSI bus reset
(either as part of error recovery or from a user issued command),
the CD-ROM drives sold by SGI respond to inquiry as a hard
disk.  This was done because older systems would otherwise refuse
to boot from the CD-ROM drive.
.TP
.B -D
Send the SCSI self test (diagnostic) command to the device.
.TP
.B -H
Send the SCSI halt, or stop, command.  This causes the device to
stop the media, or in some cases, to unload it.
.TP
.B -S
Send the SCSI start, or load, command.  This causes the device to
start the media, or in some cases, to load it.
.TP
.B -a
Attempt to negotiate with the device to operate in asynchronous mode.
This will usually mean a lower data rate on the SCSI bus, but is less
sensitive to scsi cabling problems, etc.  Some devices will negotiate
synchronous mode, but may not work correctly in that mode.  This can
also be forced by changing the configuration variables for the scsi
controller driver (e.g., the
.I wd93_syncenable
array in the file
.IR /var/sysgen/master.d/wd93 ).
Also see the
.B -s
option below.
.TP
.B -d
Debug mode.  This causes all commands sent to the device and  the data
that is returned, if any, to be printed.  Extensive information about
errors is also printed when they occur.
.TP
.B -e
Open the device in exclusive mode.  This will fail (with busy status)
if the device is in use by some other process or SCSI driver.
If it succeeds, other opens will then fail.  This mode applies to the
host controller driver, and does not issue any SCSI commands to the
device (in particular, the reserve unit command is not sent).
.TP
.B -g
Get the host adapter flags for this SCSI bus.  This is mostly of
interest to driver writer's, but it does provide a way to determine
if the SCSI disconnect option has been disabled on the bus.
.TP
.B -i
Send the SCSI inquiry
command, and display the info in a readable fashion.  The information
typically includes the device type, the manufacturer, the SCSI version,
and some of the optional SCSI features the device supports.
Also see
.B -I
below.
.TP
.B -I
display all the data from the
.BR -i \ or\  -v
options in both hex and ascii form.  Implies
.B -i
if neither
.BR -i \ or\  -v
were given on the command line.
.TP
.B -q
Quiet mode.  Don't print the name of each device as it is opened,
unless an error occurs.
.TP
.B -s
Attempt to negotiate with the device to operate in synchronous mode.
This is normally done by the operating system when the device is first
used, but that may fail, and the system will not then re-attempt to
negotiate.  Some drivers will suppress the negotiation.
Operating in synchronous mode will usually mean a higher data rate on the
SCSI bus, but this mode is more sensitive to SCSI cabling problems.
Additionally, some devices will negotiate successfully for this mode,
but will not work correctly.
Also see the
.B -a
option above.
.TP
.B -v
Issue the SCSI
.B inquiry
command with the vital products modifier, and display the data in a
readable fashion.  The vital product data often includes the serial
number, and the additional information about the device.
Also see
.B -I
above.
.TP
.B -c\ blocksize
For devices that support the readcapacity command, print the capacity
of the device, and if it's block oriented, the number of bytes per
block.
.TP
.B -b\ blocksize
Set the blocksize (for disks, CDROMs, and some types of tape drives)
to the given value, and also report the previous value.
.B blocksize
may be given in decimal, hex (with leading 0x), or octal (with leading 0).
Not all devices support changing their block size.
.TP
.B -l
Print the current values of all the supported logsense pages.  This
can sometimes be useful in debugging device problems, but almost always
requires the device specific manual from it's manufacturer, to be of use.
.TP
.B -m
Print the current values of all the supported modesense pages.  Mostly
of use to people debugging problems or writing devscsi drivers.
.SH FILES
/dev/scsi/sc* - the generic scsi driver devices
/dev/scsi/jag* - the generic scsi driver devices
.SH SEE ALSO
dsopen(3X), ds(7M), scsiha(1M), scsiha(7M).
.SH NOTE
This command is normally usable only by the superuser, because
the standard permissions of the devices in /dev/scsi restrict
access to other users.
.PP
The source to this program is also shipped as sample source code
in the \f3irix_dev.gifts.scsi\fP subsystem as part of \f4IDO\fP.
