calmsacibis995/irix-6517-src/eoe/man/man1m/share_setup.1m
'\"macro stdmacro
.TH "SHARE_SETUP" 1M
.SH NAME
share_setup, client_setup, verify \- diskless software installation tools
.SH SYNOPSIS
.B share_setup
.br
.B client_setup
.br
.B verify
[
.B \-cs
]
.I filename
.br
.SH DESCRIPTION
.I Share_setup
,
.I client_setup
, and
.I verify
are tools that help create proper configuration files for diskless 
installation.
.B Configuration files 
are fed into share_inst(1M), client_inst(1M), and clone_client(1M) 
so that installation tools will know the hardware 
information for the machines that will act as diskless clients.
.P
.I Share_setup
allows a user to interactively create a configuration file for a 
share tree while
.I client_setup 
allows the same for a client tree configuration file.
.P
.I Verify
is a program that checks the validity of a share or client configuration
file.  If the file is fine, 
.I verify
exits silently else it returns the 
line number of the offending line in 
.I filename
and the type of error.
.P
.SH OPTIONS
.IP "\f3\-c \f2filename\f1" 1i
Tells verify to check the file 
.I filename
as if it is a client tree configuration file
.IP "\f3\-s \f2fliename\f1" 1i
Tells verify to check the file 
.I filename
as if it is a share tree configuration file
.SH NOTE
Please see the
.I Diskless System Administration Guide
for more details.  This man page was not intended to give enough
information to perform a complete install.  The 
.I NFS release notes
contain additional installation information not included in the guide.
.P
All diskless scripts are meant to be executed from the /var/boot 
directory.
.SH FILES
/var/boot/share_inst		Share tree install script
.br
/var/boot/share_setup		Script to create share tree config files
.br
/var/boot/share.dat			Template for release.dat
.br
/var/boot/client_inst		Client tree install script
.br
/var/boot/client_setup		Script to create client tree config files
.br
/var/boot/client.dat		Template for class.dat
.br
/var/boot/clone_client		Tree cloning script
.br
/var/boot/verify			Script to check *.dat files
.SH SEE ALSO
inst(1M), share_inst(1M)
