calmsacibis995/irix-6517-src/eoe/man/man1m/share_inst.1m
'\"macro stdmacro
.TH "SHARE_INST" 1M
.SH NAME
share_inst, client_inst, clone_client \- diskless software installation tools
.SH SYNOPSIS
.B share_inst
.B \-r
.I release
[
.B \-d
]
.br
.B client_inst
.B \-r
.I release
.B \-c
.I class
.B \-h
.I host
[
.B \-d
]
.br
.B clone_client
.B \-r
.I release
.B \-c
.I class
.B \-f
.I hostfile
.B \-clone
.I clone-root
.br
.SH DESCRIPTION
.I Share_inst
,
.I client_inst
, and
.I clone_client
are tools that install the system software for diskless workstations.
.P
.I Share_inst
installs the portion of the IRIX operating system that
diskless workstations can share.
This shared software is known as the 
.B "share tree."
A share tree can contain only one IRIX
.B release;
a separate share tree must be installed for each additional IRIX
release that clients require.
.P
.I Client_inst
installs the software that is used exclusively by an individual
diskless client.
This software, known as the
.B "client tree,"
contains the non-shareable
portions of an IRIX release, such as configuration files and other
private files that pertain only to a particular client.
.P
.I Clone_client
allows you to install multiple client trees at once.  By feeding it a 
hostfile, one can install many trees with no interaction.  Also, 
.I clone_root
can be either a 
.B "share tree"
or a 
.B "client tree."
.P
For each IRIX release,
.I share_inst
needs a parameter file,
.I /var/boot/share.dat,
to supply the necessary configuration information.
.I Share.dat
is a template file: /var/boot contains a working copy of
.I share.dat
for each IRIX release that the diskless server supports.
The working copy of
.I share.dat
for a given share tree is assigned the name of the IRIX
release that the share tree contains.
.P
Since
.I share.dat
is a shell script that is invoked from
.I share_inst,
it should always be executable.
When modifying the file,
a good practice is to change only the strings within the double
quotes.
.P
.I share.dat
contains the following variables:
.sp
.PD 0
.TP 15
.B DISKLESS
directory prefix for the share root, client root, and swap root
.sp
.TP
.B SHARE
directory name for share root
.sp
.TP
.B SERVER_NIS
indicates whether NIS is used for name lookups during installation.
This option will not work with non-SGI NIS masters.  The bootparam
information which gets set in the SGI NIS master takes time to
propogate back to the diskless server.
.PD
.P
The
.I client.dat
file performs that same function for
.I client_inst
as
.I share.dat
performs for
.I share_inst.
.I Client.dat
contains parameters that configure a specific class or workstation
architecture.
.P
The
.I client.dat
file contains the following variables:
.sp
.PD 0
.TP 15
.B CLROOT
directory name for client root
.sp
.TP
.B SWAP
name of the directory where the swap file will be created.  The swap directory must be
on the same server as client root.
.sp
.TP
.B SWAPSIZE
size of swap file.  The default is set to 20 MB.
.sp
.TP
.B NISDOMAIN
NIS domain of client if the client's domain is different than the server's
.sp
.TP
.B CPUARCH
type of CPU architecture on clients in this class.
If the supporting
.B "share tree"
is configured for this class of clients exclusively,
this variable may be set in
.I share.dat.
.sp
.TP
.B CPUBOARD
type of cpu board on the clients in this class.
If the supporting
.B "share tree"
is configured for this class of clients exclusively,
this variable may be set in
.I share.dat.
.sp
.TP
.B GFXBOARD
type of graphics board on the clients in this class.
If the supporting
.B "share tree"
is configured for this class of clients exclusively,
this variable may be set in
.I share.dat.
.sp
.TP
.B MACH
type of machine tag assigned to this clients in this class.
If the supporting
.B "share tree"
is configured for this class of clients exclusively,
this variable may be set in
.I share.dat.
.sp
.TP
.B VIDEO
type of video option on clients in this class.
If the supporting
.B "share tree"
is configured for this class of clients exclusively,
this variable may be set in
.I share.dat.
.PD
.P
Both
.I share_inst
and
.I client_inst
are shell scripts that call
.IR inst (1M)
to perform the software installation.
They also modify files, like /etc/fstab and /etc/hosts, in the resulting
trees, so the diskless workstation can be brought up correctly.
When
.I share_inst
creates the 
.B "share tree,"
it populates the tree with the shareable files.
By definition, files whose pathnames begin with /usr, /sbin,
/lib, and /stand
are shareable.
When
.I client_inst
creates the
.B "client tree,"
it makes a swap file and modifies client boot parameters.
It also exports necessary directories to the appropriate host.
.P
.SH OPTIONS
.IP "\f3\-r \f2release\f1" 1i
Using release
.I release.
The file
.I release.dat
should exist in the /var/boot directory.
.IP "\f3\-c \f2class\f1" 1i
Using class
.I class.
The file
.I class.dat
should exist in the /var/boot directory.
.IP "\f3\-h \f2host\f1" 1i
Indicates the client tree is created for workstation named
.I host.
The
.I host
must be a valid hostname, i.e. it should have
already been assigned an IP address.  This parameter
does not have any effect when creating the share tree.
.IP "\f3\-f \f2hostfile\f1" 1i
A file containing a list of valid hostnames
.IP "\f3\-clone \f2clone-root\f1" 1i
Indicates that the
.B "client tree"
is to be created by cloning an existing
.B "client tree"
or
.B "share tree"
.I clone-root
is the full pathname of the source client\/share tree.
.IP "\f3\-d\f1" 1i
To remove the diskless tree.  The default is to install the tree.
.SH EXAMPLE
.B "/var/boot/share_inst -r 6_5"
.P
will create a share tree for a specific release
.IR 6_5 .
The
.I /var/boot/6_5.dat
file should exist before you run the command.
.P
. B "/var/boot/client_inst -r 6_5 -c RACER -h goldfinger"
.P
will create a client tree for class
.IR RACER
and
machine
.IR goldfinger .
The
.I /var/boot/RACER.dat
file should exist before you run the command.
.SH NOTE
Please see the
.I Diskless System Administration Guide
for more details.  This man page was not intended to give enough
information to perform a complete install.  The 
.I NFS release notes
contain additional installation information not included in the guide.
.SH FILES
/var/boot/share_inst		Share tree install script
.br
/var/boot/share_setup		Script to create share tree config files
.br
/var/boot/share.dat			Template for release.dat
.br
/var/boot/client_inst		Client tree install script
.br
/var/boot/client_setup		Script to create client tree config files
.br
/var/boot/client.dat		Template for class.dat
.br
/var/boot/clone_client		Tree cloning script
.br
/var/boot/verify			Script to check *.dat files
.SH SEE ALSO
inst(1M), share_setup(1M), yp_bootparam(1M)
