calmsacibis995/irix-6517-src/eoe/man/man1m/shutdown.1m
.nr X
.if \nX=0 .ds x} shutdown 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
shutdown \- shut down system, change system state
.SH SYNOPSIS
.nf
\f3cd /;\f1 \f3/etc/shutdown\f1 [ \f3\-y\f1 ] [ \f3\-g\f1grace_period [ \c
\f3\-i\f1init_state ] [ \f3\-p\f1 ]
.fi
.SH DESCRIPTION
This command is executed by the superuser to change the state of the
machine.
By default, it brings the system down into the
PROM
monitor.
.PP
The command sends a warning message and a final message before it starts
actual shutdown activities.
By default, the command asks for confirmation before it starts shutting down
daemons and killing processes.
The options are used as follows:
.TP 17
.B \-y
Pre-answers the confirmation question so the command
can be run without user intervention.
A default of 60 seconds is allowed between the warning message and
the final message.
Another 60 seconds is allowed between the final message and the
confirmation, unless the grace period is less than 60 seconds, in
which case the grace period is used.
.TP
.BI \-g grace_period
Allows the superuser to change the number of seconds from the
60-second default.
.TP
.BI \-i init_state
Specifies the state that
.IR init (1M)
is to be put in following the warnings, if any.
By default, system state "\f30\f1" is used.
.TP
.B \-p
If the new init_state is 0, \f3\-p\f1 requests that the power be
turned off after the system is shut down.
Only some systems
support this.
For automatically turning the system back on,
see
.IR wakeupat (1M).
.PP
The definitions of the
.I init_state
values that
.I shutdown
accept are:
.TP 17
state 0
Stop the
IRIX
system and go to the firmware monitor.
At this point it is safe to power down the machine.
The
.I /etc/rc0
procedure is called upon entering this
.I init_state
to perform various system cleanup functions.
.TP
state 1, s, S
Bring the machine to the state traditionally called single-user,
which provides a quiescent system and a
superuser shell running on the system console.
Upon entering this state,
the system kills all user processes
and unmounts all filesystems except the root (local filesystems may
be remounted before the shell prompt appears, in some implementations).
The
.I /etc/rc0
procedure is called to do these and various other system cleanup functions.
.TP
state 6
Stop
the
IRIX
system and reboot to the state defined by the
.I initdefault
entry in
.IR /etc/inittab .
.SH SEE ALSO
init(1M),
uadmin(1M),
rc0(1M),
rc2(1M),
wakeupat(1M),
inittab(4).
