calmsacibis995/irix-6517-src/eoe/man/man1m/smtconfig.1m
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)smtconfig.1m	6.4 (Berkeley) 5/22/86
.\"
.if n .pH man1.smtconfig @(#)smtconfig	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} SMTCONFIG 1M "Silicon Graphics" "\&"
.if \nX=1 .ds x} SMTCONFIG 1M "Source Code Control System Utilities"
.if \nX=2 .ds x} SMTCONFIG 1M "" "\&"
.if \nX=3 .ds x} SMTCONFIG "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
smtconfig \- configure or display FDDI interface parameters 
.SH SYNOPSIS
.B /usr/etc/smtconfig
.I interface
.RI [ address_family ]
.RI [ address ]
.RI [ parameters ]
.br
.B /usr/etc/smtconfig
.I interface
.SH DESCRIPTION
.I smtconfig
is used to configure FDDI network interfaces.
.I smtconfig
is invoked at boot time from 
.I /etc/init.d/network
to define the network address
of each FDDI interface present on a machine. 
You may also use it once the system is up
to redefine an interface's address
or other operating parameters.
.LP
The
.I interface
parameter is a string of the form ``name unit'', for example, ``ipg0''.
Use
.IR smtstat (1)
or 
.IR netstat (1)
to display the names of FDDI interfaces on the machine.
.LP
Since an interface may receive transmissions in differing protocols,
each of which may require separate naming schemes, it is necessary
to specify the
.IR address_family ,
which may change the interpretation of the remaining parameters.
.\"The address families currently supported are ``inet'' and ``ns''.
Currently, just the ``inet'' address family is supported.
.LP
For the Internet family,
the address is either 
an Internet address expressed in the Internet standard
``dot notation'' (see
.IR inet (3N)),
or a host name present in the 
.IR hosts (4)
file,
.IR /etc/hosts .
(Other 
.I hosts 
databases, such as 
.I named 
and NIS, are ignored.)
.PP
Only the superuser may modify the configuration of a network interface.
.PP
The following parameters may be set with 
.IR smtconfig :
.TP 15
.B up
Mark an interface ``up''. 
This parameter may be used to enable an interface after an ``smtconfig down.''
It happens automatically when setting the first address on an interface.
If the interface was reset when previously marked down,
the hardware will be re-initialized.
.TP 15
.B down
Mark an interface ``down''.  When an interface is
marked ``down'', the system will not attempt to
transmit messages through that interface. 
If possible, the interface will be reset to disable reception as well.
This action does not automatically disable routes using the interface.
.TP 15
.B arp
Enable the use of the Address Resolution Protocol in mapping
between network level addresses and link level addresses (default). 
This is currently implemented for mapping between Internet
addresses and FDDI MAC addresses. 
.TP 15
.B \-arp
Disable the use of the Address Resolution Protocol.
.TP 15
.BI metric " n"
Set the routing metric of the interface to
.IR n ,
default 0.
The routing metric is used by the routing protocol
.RI ( routed (1m)).
Higher metrics have the effect of making a route
less favorable; metrics are counted as addition hops
to the destination network or host.
.TP 15
.BI netmask " mask"
."\(Inet only)
Specify how much of the address to reserve for subdividing
networks into subnetworks.
The mask includes the network part of the local address
and the subnet part, which is taken from the host field of the address.
The mask can be specified as a single hexadecimal number
with a leading 0x, with a dot-notation Internet address,
or with a pseudo-network name listed in the network table
.IR networks (4).
The mask contains 1s for the bit positions in the 32-bit address
which are to be used for the network and subnet parts,
and 0s for the host part.
The mask should contain at least the standard network portion,
and the subnet field should be contiguous with the network
portion.
.TP 15
.B broadcast
."\(Inet only)
Specify the address to use to represent broadcasts to the
network.
The default broadcast address is the address with a host part of all 1s.
.TP 15
.B debug
Enable driver-dependent debugging code; usually, this turns on
extra console error logging.
.TP 15
.B \-debug
Disable driver-dependent debugging code.
.TP 15
.B primary
Select an interface as the primary network interface for this host.
.PP
.I smtconfig
displays the current configuration for a network interface
when no optional parameters are supplied.
If a protocol family is specified,
.I smtconfig 
will report only the details specific to that protocol family.
.SH DIAGNOSTICS
Messages that indicate the specified interface does not exist, the
requested address is unknown, or the user is not privileged
if trying to alter an interface's configuration.
.SH "FILES"
/etc/hosts	host-address database
.SH "SEE ALSO"
smtstat(1), fddi(7m), network(1M), inet(3N)
