calmsacibis995/irix-6517-src/eoe/man/man1m/smtd.1m
.TH smtd 1M local "Silicon Graphics, Inc."
.SH NAME
smtd \- \&FDDI Station Management protocol daemon
.SH SYNOPSIS
.nf
\f3/usr/etc/smtd\f1
.fi
.SH DESCRIPTION
.I smtd
is the FDDI Station Management (SMT) protocol daemon.
It performs non-time critical SMT functions such as the SMT frame-based
protocols (NIF and SRF), Ring Management protocol (RMT), Configuration
Management (CMT), and status monitoring.
FDDI management and status monitor programs can access
.I smtd
using SNMP, the Simple Network Management Protocol, as defined in RFC 1067.
.IR smtstat (1),
.IR smtinfo (1)
and
.IR smtring (1M)
are tools to query the daemon for various SMT information.
.PP
.I smtd
is invoked by
.IR smtconfig (1M)
when an FDDI interface is configured.
.PP
.I smtd
logs its messages to
.IR syslog (3C).
By default, a logging level of LOG_ERR is used reporting only
errors which cause termination, interface reset, or performance degradation.
.PP
The following signals have the specified effect when sent to the
server process using the
.IR kill (1)
or
.IR killall (1M)
commands.
.IP SIGUSR1 10
Increases debugging output; each SIGUSR1 increments the debug level.
.IP SIGUSR2 10
Decreases debugging output; each SIGUSR2 decrements the debug level.
.PP
So with one SIGUSR1 signal sent to
.IR smtd ,
the debug level is LOG_WARNING.
With three SIGUSR1 signals sent to
.IR smtd ,
the debug level is LOG_INFO.
.SH FILES
/etc/fddi/smtd.mib      FDDI SNMP MIB
.br
/etc/fddi/smtd.conf     FDDI SMT configuration file
.SH SEE ALSO
smtconfig(1M),
syslog(3B).
