calmsacibis995/irix-6517-src/eoe/man/man1m/smtping.1m
'\"macro stdmacro
.\" Copyright (c) 1985 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"     @(#)smtping.8      6.5 (Berkeley) 8/16/89
.\"
.TH SMTPING 1M
.SH NAME
smtping \- send FDDI SMT Echo Request frames to FDDI stations
.SH SYNOPSIS
.B /usr/etc/smtping
.RB [ \-dfnqv ] 
.RB [ \-c 
.IR count ] 
.RB [ \-s 
.IR size ] 
.RB [ \-l 
.IR preload ] 
.br
.ti +5n
.RB [ \-i 
.IR interval ]
.RB [ \-I 
.IR interface ]
.RB [ \-p 
.IR pattern ]
.I host
.SH DESCRIPTION
.I smtping
is a tool for FDDI ring testing, measurement and management.
It sends the FDDI Station Management (SMT) Echo request frames to elicit an
Echo response frame from other FDDI stations or concentrators. 
Echo request frames (``pings'') have a MAC header, a SMT header,
a transaction ID and an INFO field.
The INFO field has an 8-byte timestamp, and then an arbitrary number
of ``pad'' bytes used to fill out the packet.
The
.I smtping
tests for SMT connectivity;
the related utility,
.IR ping (1M),
tests for the higher-level IP/ICMP connectivity.
.PP
The 
.I host
can be a MAC address of a host or the symbolic name
of its MAC address which can be found in
.IR /etc/ethers
or the NIS
.I ethers.byname
map. The options are:
.TP
.BI \-c " count"
Stop after sending (and receiving) 
.I count 
Echo frames.
.TP
.B \-d
Set the SO_DEBUG option on the socket being used.
.TP
.B \-f
Flood ping.  Outputs frames as fast as they come back or one hundred times
per second, whichever is more.  For every Echo request frame sent, a period '.'
is printed, while for every Echo response received a backspace is printed.
This provides a rapid display of how many packets are being dropped.
.I "Flooding can be extremely stressful on a network and should be used with caution."
.TP
.BI \-i " interval"
Wait
.I interval
seconds between sending each frame. 
The default is to wait for one second between each packet.
This option is incompatible with the 
.B \-f 
option.
.TP
.BI \-l " preload"
Send
.I preload
frames as fast as possible before
falling into the normal mode of behavior.
.TP
.B \-n
Numeric output only.  Does not try to translate the MAC address into its
symbolic name in the 
.I ethers
database.
.TP
.BI \-p " pattern"
Specify up to 16 ``pad'' bytes to fill out the
frames sent.  This option is useful for diagnosing data-dependent 
problems in a network.  For example, ``\-p ff'' 
will cause the sent frames to be filled with all 1s.
.TP
.BI \-I " interface"
Use
.I interface
to send each ECHO frame and receive responses. 
The
.I interface
is a string of the form ``name unit'', for example, ``ipg0''.
The default is set to the station's primary interface.
.TP
.B \-q
Quiet output.  Nothing is displayed except the summary line on termination.
.TP
.BI \-s " size"
Send frames containing
.I size
bytes of data.
The default is 12, which translates into 64-byte SMT frame.
The maximum allowed value is 65468 bytes(even though
.I smtping
accepts up to 65468 bytes of packet size, any
.I size
larger than 4500 will result in failure because the maximum
FDDI packet size is 4500).
.TP
.B \-v
Verbose output.  SMT frames other than Echo responses that are received
are listed.
.PP
.I smtping
should be used primarily for manual fault isolation.
Because of the load it can impose on the network,
it is unwise to use
.I smtping
during normal operations or from automated scripts.
.PP
.I smtping
continually sends one frame per second and
prints one line of output for every Echo response returned.
If the 
.BI \-c " count"
option is given, only that number of requests is sent.
No output is produced if the station does not respond.
Roundtrip times and frame loss statistics are computed.
If duplicate frames are received, they are not included in the frame
loss calculation, although the round trip time of these frames is used
in calculating the minimum/average/maximum round-trip time numbers.
When the specified number of frames have been sent (and received) or
if the program is terminated with an interrupt (SIGINT), 
a brief summary is displayed.
When not using the 
.B \-f
(flood) option, the first interrupt, usually generated by control-C or DEL, 
causes
.I smtping
to wait for its outstanding requests to return.  It will wait no longer
than the longest round trip time encountered by previous, successful
pings.  The second interrupt stops
.I smtping
immediately.
.SH DUPLICATE AND DAMAGED PACKETS
.I smtping
will report duplicate and damaged packets.
Duplicate packets are expected if the target
address is a multicast or broadcast address; otherwise
duplicates are not expected.
.PP
Damaged packets are obviously serious cause for alarm and often
indicate broken hardware somewhere in the
.I smtping
packet's path (in the network or in the hosts).
.SH TRYING DIFFERENT DATA PATTERNS
The link-level layer should never treat packets differently depending
on the data contained in the data portion.
Unfortunately, data-dependent problems have been known to sneak into
networks and remain undetected for long periods of time.
In many cases the particular pattern that will have problems is something
that doesn't have sufficient ``transitions'', such as all 1s or all
0s, or a pattern right at the edge, such as almost all 0s.
It isn't necessarily enough to specify a data pattern of all 0s (for
example) on the command line because the pattern that is of interest is
at the data link level, and the relationship between what you type and
what the controllers transmit can be complicated.
.PP
If you have a data-dependent problem you will probably
have to do a lot of testing to find it.
If you are lucky, you may manage to find a file that either can't be sent
across your network or takes much longer to transfer than other
similar length files.
You can then examine this file for repeated patterns that you can test
using the \f3\-p\f1 option of \f2smtping\f1.
.SH "FILES"
/etc/ethers	MAC address database
.SH SEE ALSO
smtstat(1), smtconfig(1M), ethers(4)
