calmsacibis995/irix-6517-src/eoe/man/man1m/smtring.1m
.\" Copyright (c) 1990 Silicon Graphics Computer Systems Inc.
.\" All rights reserved.
.\"
.TH smtring 1M
.SH NAME
smtring \- examines the state of FDDI ring
.SH SYNOPSIS
.nf
\f3/usr/etc/smtring\f1 [\f3\-pdn\f1] [\f3\-i\f1 \f2interval\f1] [\f3\-t\f1 \c
\f2timeout\f1] [\f3\-I\f1 \f2interface\f1] [\f2host\f1]
.fi
.SH DESCRIPTION
.I smtring
is a tool to examine the state of an FDDI ring.
The default is to report once either when
.I smtring
is interrupted or when it terminates after a 60-second timeout.
.PP
The options are:
.TP
.B \-d
Increase the debug level.
Multiple ``d''s increase the level up to a maximum
of five.
.TP
.B \-p
Passive NIF collection.
With this option,
.I smtring
``passively'' collects the NIF frames on the FDDI ring.
Without this option, by default,
.I smtring
collects NIF frames ``actively'' by issuing broadcast NIF_REQUEST frames
to elicit an NIF_RESPONSE frame from FDDI stations and concentrators.
.TP
.B \-n
Numeric output only.
Does not try to translate the MAC address into its
symbolic name in the
.I ethers
database.
.TP
.BI \-i " interval"
Continually report FDDI neighbor information every
.I interval
seconds.
.TP
.BI \-I " interface"
Examine the state of an FDDI ring in which
.I interface
is inserted.
The
.I interface
is a string of the form ``name unit'', for example, ``ipg0''.
The default is set to the station's primary interface.
.TP
.BI \-t " timeout"
Change the default timeout from 60 seconds to
.I timeout
seconds.
.TP
.I host
The
.I host
can be a FDDI station's MAC address or the symbolic name
of a FDDI station's  MAC address which can be found in
.I /etc/ethers
or the NIS
.I ethers.byname
map.
The ring status data will be collected by
.I host .
The default is set to ``localhost''.
.SH "FILES"
/etc/ethers	MAC address database
.SH SEE ALSO
smtconfig(1M),
smtstat(1),
ethers(4).
