calmsacibis995/irix-6517-src/eoe/man/man1m/snetd.1m
.\" SpiderX.25 Manual Pages - Acknowlegements to Berkeley SCCS @(#) netd.1m 5 5/12/92
.\"
.\"  Mark Valentine @ Spider Systems	(spider!mark)
.\"  [1.1]	19 Jan 1988 (MV)	New File
.\"		 5 Apr 1989 (TR)	X.25 additions
.\"		10 Jan 1990 (TR)	X.25 Rel.2 corrections.
.\"		 1 Feb 1990 (TR)	Added "SHELL" calls & IXE ex.
.\"		29 Jun 1990 (TR)	wantune additions.
.\"		17 Oct 1990 (TR)	Added LAPDTE, LAPDCE, changed
.\"					LC_LAPB etc to LC_LAPBDTE etc.
.\"					
.\"
.nr De 0					\" Development version
.cs CW 18
.TH SNETD 1M
.SH NAME
snetd \- DLPI network daemon
.\".if \\n(De (development version)
.SH SYNOPSIS
.PP
.B "snetd"
.RB [ \-nt ]
.\".if \\n(De .RB [ " \-d \fIinet_address\fP " ]
.RB [ " \fIconfig_file\fP | \(em " ]
.SH DESCRIPTION
.PP
.I snetd
configures a
.IR \s-1STREAMS\s0
network from a specification given in a configuration file
whose format is described in the \f2Configuration\fP section.
.PP
By default the configuration is taken from the file
.I /etc/config/snetd.options.
An alternative file may be specified as a command line argument
(\fIconfig_file\fP).
The special filename '\fB-\fP' is taken to mean the standard input.
.\".if \\n(De \{\
.\".PP
.\"The
.\".B "-d"
.\"option may be used to specify a default configuration for TCP/IP
.\"over Ethernet as shown in the example below, but with the
.\"Internet address replaced with the one supplied as an argument.
.\"In this case any configuration file specified on the command line is ignored. \}
.PP
Upon system startup, if the state of the
.IR snetd
daemon is \f2on\fP, the daemon is started by /etc/init.d/network. You may
use \f2chkconfig\fP(1M) to check the state of the daemon or
to change its state.
.PP
The
.B "-t"
option may be used to debug a configuration file.
It produces trace information indicating the sequence of
opens, links, etc. performed by
.I snetd
to create the
.SM \fISTREAMS\fP
architecture defined by the configuration.
.PP
The
.B "-n"
option, which also implies
.B "-t",
inhibits the actual building of the
.SM \fISTREAMS\fP
network.
.SH CONFIGURATION
.PP
This section describes the configuration of the
.I \s-1STREAMS\s0
network constructed by
.IR snetd.
.PP
The file is in two sections,
.B module
and
.B streams
, separated by a line consisting of the
character sequence '%%'.
Blank lines may be used freely throughout the file, and a
.I token
(see below)
beginning with an unquoted \&'\fB#\fP' (hash)
denotes a comment which lasts till the end of the line.
In addition, a backslash (\fB\\\fP) immediately preceding the end of a line
results in the newline being treated as whitespace
(except at the end of comment lines).
.PP
.I Tokens
consist either of
.IP "a)"
a single occurrence of the special characters
{ \&'=', \&'{', \&',', \&'}' }
.PP
.RB ( Note:
\&'=' is
.I not
a special character within the brace-enclosed argument list
of a control message;
\&',' is
.I only
a special character in this position.)
.IP "b)"
strings of arbitrary characters enclosed in single or double quotes
(''' or '\&"'),
but not containing a newline -
each quoting character quotes the other,
for example, "foo 'bar'" or \&'"foo" bar'
.PP
(Newlines occuring within quoted strings will silently terminate the string.)
.IP "c)"
sequences of non-whitespace characters
not including any of the special characters or quotes
.PP
All strings are case-sensitive, and are silently truncated to 200 characters.
.PP
The
.B modules
section describes the individual modules and drivers
from which the
.I \s-1STREAMS\s0
network configuration will be built.
.PP
.nf
.ps 8
.ft CW
tcp    dc    /dev/tcp
arp    m     arp
x25    dc    /dev/x25
lapb0  dc    /dev/lapb0
.ft R
.ps
.fi
.PP
Each line (such as the examples above)
consists of three tokens (separated by whitespace or tabs)
as follows.
.PP
The
.B "module identifier"
is the name by which the module or driver will be known
in the streams section
(see below).
.PP
The
.B "module type"
is a sequence of character flags describing the
module or driver.
The flag '\fBd\fP' describes a
.I \s-1STREAMS\s0
.I driver ,
whereas '\fBm\fP' describes a
.I module.
The '\fBc\fP' flag specifies a driver to be
.I cloneable.
(See the
.I "\s-1STREAMS\s0 Programmer's Guide"
for a detailed description of modules and drivers.)
.PP
The
.B "module name"
is the
.I "character device name"
for a driver, or the
.I "pushable module name"
for a module.
.PP
The
.B streams
section describes the architecture of the network in terms of
how the previously defined modules and drivers are to be combined
(by means of the appropriate PUSHes and LINKs)
into streams.
Multiplexing and cloning are handled automatically by the
.IR "snetd"(1M)
utility.
.PP
.nf
.ps 8
.ft CW
ip    arp      IP_NET=89.0.0.3
x25   lapb0    SHELL="x25tune -P -s A def.dte.x25" \\
               X25_SET_SNID={A, LC_LAPBDTE, , }
.ft R
.ps
.fi
.PP
Lines in this section (such as the above examples)
are of the following form.
.PP
The first two tokens on a line are
.B names
(\fImodule identifiers\fP as defined in the previous section)
of drivers or modules
which are to form the
.B upstream
and
.B downstream
components respectively of a
.I \s-1STREAMS\s0
link.
.PP
Each link performed between token 1 and token 2 generates a 
.IR mux_id 
(multiplexing identifier) which is associated
with that link.  It is possible
to override the generated link by replacing
token 2 with an explicit mux_id,
for example:
.PP
.nf
.ps 8
.ft CW
lapb0    1     LL_SET_SNID=A \\
               SHELL="lltune -P -p lapb -s B -d /dev/lapb0 def.lapb"
.ft R
.ps
.fi
.PP
This sets the
.I "mux_id"
associated with the link to 
.B "1".
.PP
These names may be
.I qualified
by a suffix consisting of a colon (\fB:\fP) and a number
(for example
.IR "arp:1")
to signify a particular
.I instantiation
of a module.
(An uninstantiated \fIname\fP is an abbreviation for
\fIname\fP:0.)
Each instantiation of a module can be thought of as a separate
.I block
in a
.I \s-1STREAMS\s0
Architecture diagram.
Separate instantiations would be appropriate
for, say, a module pushed above more than one
driver, but not for a cloneable multiplexed driver.
.PP
Instantiations are used in the 'streams' section only,
to instantiate modules defined in the 'modules' section.
The following networking example would
run IP over two distinct networks:
.PP
.nf
.ps 8
.ft CW
ip       dc     /dev/ip
arp      m      arp
ethr0    dc     /dev/ethr0
ethr1    dc     /dev/ethr1

%%

ip      arp:0   IP_NET=89.0.0.1
arp:0   ethr0   ARP_TYPE

ip      arp:1   IP_NET=89.0.0.2
arp:1   ethr1   ARP_TYPE
.ft R
.ps
.fi
.PP
The remainder of each line consists of a (possibly null)
sequence of
.I "control actions"
to be performed on completion of the link
in the order specified.
.PP
Each control action is of the form \fIfunction\fP = \fIargument-list\fP,
where the \fIargument-list\fP is either a single string argument or
a comma-separated list enclosed in braces (\fB{\fP and \fB}\fP).
Control actions requiring no arguments may consist simply of the \fIfunction\fP
component.
Arguments containing whitespace or any of the special characters listed above
must be quoted.
.PP
The following 
.B "control actions"
are currently defined:
.PP
.IP "\fBIP_NET\fP={\fIinternet-address\fP, \fIsubnet-mask\fP, \fBforwb\fP=\fIboolean\fP}" 20
.RS 20
.PP
This specifies the
.B "network"
address
and
.B "subnet"
mask
for a stream below IP,
and whether
.B broadcasts
are to be
.IR forwarded
from other networks to that network.
.PP
This is typically used when a network is multiplexed below an
.B IP
(Internet Protocol)
driver.
The Internet address and Subnet mask are given in standard Internet
.B dot
format,
and may be omitted (supplied as a null string)
when not relevant,
in which case they will be passed as zero.
The
.IR "broadcast"
flag is specified as a boolean value:
.B y
or
.B n
(for 'yes'/'true' \(em 'do forward' \(em
or 'no'/'false' \(em 'don't forward'),
or may be omitted
in the default case
(don't forward).
.PP
\fBNote:\fP
A broadcast packet for transmission to a network either
originates from the host or has previously been received
from another network. The first type is always transmitted.
The second type is only transmitted if the forward broadcast
flag \fBforwb\fP is set to 'y'. This flag is only relevant when
using gateways.
.PP
In cases where only the network address is supplied,
the following syntax may be used
.PP
.RS
\fBIP_NET\fP=\fIinternet-address\fP
.RE
.PP
.RE
.IP "\fBARP_TYPE\fP=\fItrailers\fP" 20
.RS 20
This specifies that
this stream is to be
.B registered
with the network driver below as the stream on which incoming
.B IP
packets are to be received.
.P
In addition,
.IR trailers
may take the value
.B trailers
or
.B notrailers
(the default),
to specify whether trailer encapsulated packets
should be sent on the network interface.
.RE
.PP
.IP "\fBLL_SET_SNID\fP=\fIsubnet-id\fP" 20
.RS 20
.PP
This registers the
.IR subnetwork 
.IR identifier
(subnet-id) 
to be associated with this link.
The
.IR subnetwork 
.IR identifier 
provides a unique name for an outlet to 
a board and its associated higher level streams.
It is a single alphanumeric character
and is a mandatory parameter.
.RE
.IP "\fBX25_SET_SNID\fP={\fIsubnet-id\fP, \fIclass\fP, \fIlocal-SAP\fP, \fIloop-SAP\fP}" 20
.RS 20
.PP
This registers the
.IR subnetwork 
.IR identifier 
to be associated with this link,
the 
.IR "class" 
of the network below the link, and
the 
.IR "local-" 
and 
.IR "loop-SAP"s 
to be associated
with this subnetwork.
.PP
The class can be one of the following:
.PP
.nf
.ps 8
.ft CW
LC_LLC1        LLC-1,
LC_LLC2        LLC-2,
LC_LAPBDTE     LAPB - DTE,
LC_LAPBXDTE    LAPB - DTE and extended addressing,
LC_LAPBDCE     LAPB - DCE,
LC_LAPBXCDE    LAPB - DCE and extended addressing.
LC_LAPDTE      LAP - DTE,
LC_LAPDCE      LAP - DCE,
.ft
.ps
.fi
.PP
The
.IR "SAP"s 
are only required for 
.I "classes" '\fILC_LLC2\fP' and '\fILC_LLC1\fP'.
They are two digit hexadecimal numbers.
The 
.IR "SAP"s 
must be even, non-zero and different.
If the 
.IR "class"
is 'LC_LLC2', and the 
.IR "SAP"s 
are not present, 
the defaults for local and loop 
.IR "SAP"s 
are 0x7E and 0x70 respectively.
If the 
.IR "class"
is 'LC_LLC1', and the 
.IR "SAP" 
is not present, 
the default for local
.IR "SAP" 
is 0x7E.
For any other 
.IR "class", 
the 
.IR "SAP"s 
are not used.
.PP
The 
.IR "subnet-id" 
and 
.IR "class" 
parameters are mandatory,
but the 
.IR "local-SAP" 
and 
.IR "loop-SAP" 
parameters are optional.
.RE
.TP 20
\fBSHELL\fP="\fIcommand-string\fP"
.RS 20
.PP
This allows calls to the shell.
Utilities may then be called at an
intermediate stage in the building of the
.SM \fISTREAMS\fP
network.
For example:
.PP
.nf
.ps 8 
.ft CW

ip      -      SHELL=" ixemap -Z; ixemap -P "

.ft
.ps
.fi
.PP
This particular shell call to the 
.IR "ixemap"(1M)  
utility deals with the 
IXE module internal table
of X.25 and Internet address associations
(as described in
.IR "ixemapconf"(4)).
.PP
A special dummy link exists, where no link is formed,
but the control action is executed.
This occurs when token 2 is a hyphen
.B "( '-' )".
.PP
For example:
.PP
.nf
.ps 8
.ft CW
x25     -       SHELL="pvcmap -P"

.ft
.ps
.fi
which is simply a shell call to execute
.B "pvcmap".
.SH EXAMPLES
.PP
When the DLPI subsystem is installed, a sample configuration file is 
installed at /etc/config/snetd.options, if the file does not already
exist.
The file contains sample configuration lines for three interfaces: one
token ring interface, one ethernet interface and one fddi interface. 
As 'sample' confiugration lines, the configuration lines are commented out
with an '#' sign at column one. To activate a particular interface, 
the '#' signs must be removed.
The sample configuration file installed by the product might contain
the following network description depending on your system configuration.
Please note that the line numbers will not
be in the shipped file but they are put in here for reference purposes.
.PP
.nf
.ps 8 
.ft CW
/*line1*/ #fv0    d       /dev/fv0
/*line2*/ #ec0    d       /dev/ec0
/*line3*/ #ipg0   d       /dev/ipg0
/*line4*/ llc2    dc      /dev/llc2
/*line5*/ 
/*line6*/ %%
/*line7*/ 
/*line8*/ #llc2   fv0     LL_SET_SNID=A   \\
/*line9*/ #      SHELL="lltune -P -p llc2 -s A -d /dev/llc2 def.tokenring"
/*line10*/#llc2   ec0     LL_SET_SNID=B   \\
/*line11*/#      SHELL="lltune -P -p llc2 -s B -d /dev/llc2 def.ether"
/*line12*/#llc2   ipg0    LL_SET_SNID=C   \\
/*line13*/#      SHELL="lltune -P -p llc2 -s C -d /dev/llc2 def.fddi"

.ft
.ps
.fi
.PP
To activeate the token ring interface fv0, you need only take out the '#'
signs at the beginning of the line #1, #8, and #9. Line 9 is to execute
\f2lltune\fP(1M) command to set default LLC2 tuning parameters for this 
token ring interface.
.PP
A typical configuration file for X.25 only, 
might contain the following network description.
.PP
.PP
.nf
.ps 8
.ft CW
echo    m       echo
ec0     dc      /dev/ec0  
lapb    dc      /dev/lapb
llc2    dc      /dev/llc2
wan0    dc      /dev/wan0
x25     dc      /dev/x25

%%

llc2    ec0     LL_SET_SNID=C \\
                SHELL="lltune -P -p llc2 -s C -d /dev/llc2 def.llc2"
x25     llc2    SHELL="x25tune -P -s C -d /dev/x25 -a 0000000000007E \\
                def.lan.x25"   X25_SET_SNID={C, LC_LLC2, 7E, 70} 

lapb    wan0    LL_SET_SNID=A \\
                SHELL="wantune -P -d /dev/wan0 -s A def.wan" \\
                SHELL="lltune -P -p lapb -s A -d /dev/lapb def.lapb"
x25     lapb    SHELL="x25tune -P -s A -d /dev/x25 def.dte80.x25" \\
                X25_SET_SNID={A, LC_LAPBDTE, , }

lapb    wan0    LL_SET_SNID=B \\
                SHELL="wantune -P -d /dev/wan0 -s B def.wan" \\
                SHELL="lltune -P -p lapb -s B -d /dev/lapb def.lapb"
x25     lapb    SHELL="x25tune -P -s B -d /dev/x25 def.dte80.x25" \\
                X25_SET_SNID={B, LC_LAPBDTE, , }

x25     -       SHELL="pvcmap -P"

echo    ec0     ECHO_TYPE

.ft
.ps
.fi
.PP
Here, 
.IR wan0
and 
.IR ec0
are WAN and Ethernet drivers respectively, and your real Ethernet
driver may be 
.B ec0
, 
.B et0
,
or 
.B enp0
, depending on your system configuration.
Note that the above is an example 
where lapb, llc2, wan0 and ec0 are in-kernel.
.IR "Instantiations"
are used.
Each instantiation can be 
thought of as 
a separate block in a STREAMS 
Architecture diagram.
.PP
When TCP is to be run over X.25
a typical configuration file might contain the following
extra entries to cater for the IP to X.25 Encapsulation driver, 
IXE (see 
.IR "ixe"(7)).
.PP
.nf
.ps 8 
.ft CW

ixe     dc      /dev/ixe

%%

ip      ixe     IP_NET={15.0.0.2, 255.0.0.0, forwb=n}
ip      ixe     IP_NET={16.0.0.2, 255.0.0.0, forwb=n}
ixe     x25
ixe     x25
ixe     x25

ip      -       SHELL="ixemap -Z" SHELL="ixemap -P" SHELL="ixetune"
.ft
.ps
.fi
.SH FILES
.PP
.IR "/etc/config/snetd"
.br
.IR "/etc/config/snetd.options"
.SH SEE ALSO
.PP
dlpi(7),
lltune(1M),
ixemap(1M),
pvcmap(1M),
ixemapconf(4),
ixe(7).
