calmsacibis995/irix-6517-src/eoe/man/man1m/stacker.1m
.TH stacker 1M
.SH NAME
stacker \- robotics control program
.SH SYNOPSIS
.nf
\f3stacker\f1 [\f3\-D\f1...] \f3\-c\f1 [\f2device\f1]
\f3stacker\f1 [\f3\-D\f1...] \f3\-l\f1 \f2binnumber\f1 \c
[\f3\-d\f1\f2drivenumber\f1] [\f2device\f1]
\f3stacker\f1 [\f3\-D\f1...] \f3\-u\f1 \f2binnumber\f1 \c
[\f3\-d\f1\f2drivenumber\f1] [\f2device\f1]
\f3stacker\f1 [\f3\-D\f1...] \f3\-f\f1 \f2frombinnumber\f1 \c
\f3\-t\f1 \f2tobinnumber\f1 [\f2device\f1]
.fi
.SH DESCRIPTION
.I stacker
is an administrative utility used to move tapes between a robotic
tape library's slots and drive(s).
.I stacker
currently supports the Exabyte 10i and 10e, the DLT2500, DLT2500xt,
DLT2700, DLT2700xt, DLT4500, DLT4700, the
IBM Magstar (3590) and IBM Magstar MP (3570),
the SGI DLT-7000 autoloader (Minivault),
the Fujitsu Computer Products 
of America (FCPA) M1016/M1017, M2483 and M2488 3480/3490 drives, and all
tape robots that conform to the SCSI-2 Medium Changer command set.
.P
The
.I device
argument is used to specify the special device that will be used to control
the stacker.
This argument can be ignored if the environment variable
.B STACKER_DEV
is set.
The command line specification of a device overrides the environment variable.
.P
The special device nodes used to control tape robots can be found
in the directory
.IR /dev/scsi .
(See
.IR ds(7M)
for more information.)
The entry that corresponds to the SCSI bus and target ID of the
robotic control interface should be used.
For example, the SGI DLT-7000 autoloader and Exabyte 10i have  a SCSI target ID separate from its
internal tape drive.
The the DLT2500 and DLT2700 uses the same SCSI target ID (wih different LUN)
as their associated tape drive. The IBM 3590 can also be configured in
a similar fashion.
.P
The
.IR hinv(1M)
utility will list any robotic device that uses a separate LUN in the following
form (with X, Y and Z set to the appropriate values):
.nf

	Jukebox: unit X, lun Y on SCSI controller Z
.fi
.P
This program requires root privilege to access the
.I /dev/scsi
devices.
If non-privileged access is required to the robot, simply
change the permissions on the
.I /dev/scsi
device controlling the stacker.
(See
.IR chmod(1) .)
.SH FUJITSU DRIVE AND ROBOT INFORMATION
The Fujitsu devices use half-inch tape cartridges.
The M1016/M1017 are 18-track IBM 3480-compatible drives,
and do not use the SCSI-2 Medium Changer command set.
The M2483 is a 36-track IBM 3490-compatible drive.
The M2488 is like the M2483, but includes SCSI-2 Fast and Wide support.
.P
The Fujitsu devices all use the same SCSI target ID for tape and robotic
control.
However, while the M1016/M1017 use SCSI LUN 0 for both tape and
robotic control, the M2483 and M2488 devices use LUN 0 for the tape
and a separate LUN for the robot.
The robot LUN is changeable, but is set to 4 at the factory.
.P
The Fujitsu robotic control is actually performed with what is called
an autoloader.
An autoloader is dedicated to a single drive, as opposed to being
able to potentially handle multiple drives like the other robotic devices.
.P
Fujitsu autoloaders use a tape magazine.
The Automatic Cartridge Loader (ACL) style of autoloader accepts a
5- or 10-tape magazine, and is available with all the drive models.
The Flush-mounted ACL (FACL) style accepts a 7-tape magazine,
and is available on only the M2483 and M2488.
.P
Unlike the other robotic devices described herein, the Fujitsu model
numbers do not indicate if the tape drive is equipped with a tape robot.
Invoking
.I stacker
for a Fujitsu M1016/M1017 that is not equipped with an autoloader causes
the following message to be displayed:
"ERROR: Fujitsu M1016/M1017 drive lacks autoloader."
This is done because this is the only device discussed here for which
it is not possible to determine the existence of a robotic device
from either the device's model number or the output of
.IR hinv(1M) .
.SH OPTIONS
All bins are numbered starting from 1 to the number supported
by the device.
The internal tape drives (if there are more than one) are numbered
starting at 1 as well.
For example, the Odetics 2640 library's bins are numbered from 1 to 264,
and its tape drives are numbered from 1 to 3.
.TP 8
\f3\-D\f1...
Print debugging output in increasing levels of detail.
.TP
\f3\-c\f1
Print the configuration of the device.
This includes the number of bins, the number of tape drives,
the number of import/export ports, and the number of robotic arms.
.TP
\f3\-l\f1 \f2binnumber\f1 [\f3\-d\f1 \f2drivenumber\f1]
Load a tape from the specified bin into the specified tape drive.
If the drive number is not specified, drive number 1 is used.
.TP
\f3\-u\f1 \f2binnumber\f1 [\f3\-d\f1 \f2drivenumber\f1]
Unload a tape from the specified tape drive into the specified bin.
If the drive number is not specified, drive number 1 is used.
The Fujitsu M2483 autoloader can only unload a tape cartridge to the slot
from which the medium was originally loaded.  The operator is informed of
this limitation upon any such unload request with the following message:
"NOTE: Fujitsu M2483 request handled as unload to original medium slot."
.TP
\f3\-f\f1 \f2frombinnumber\f1 \f3\-t\f1 \f2tobinnumber\f1
Move a tape from (\f3\-f\f1) one bin to (\f3\-t\f1) another bin.
The autoloaders on the Fujitsu M1016/M1017 and M2483 drives do
not support this option.  If attempted, the error message
"autoloader cannot perform bin-to-bin movement" will be displayed.
.SH "NOTES"
The DLT2700 must have the mode select key set to automatic in order
for the software to be able to control the stacker's robotics.
Automatic mode is represented by a square made of arrows.
.P
The IBM Magstar MP stacker must be in the "Random" or "Random (2-LUN)"
mode to be 
controllable by the software. This mode is configured via the control
panel on the 3590 drive. When set to 2-LUN mode, the drive will be
LUN 0, and the stacker is LUN 1. In "Random" mode, only LUN 0 exists
and stacker operations must be directed there. 
.P
As a Fujitsu autoloader is dedicated to a single drive, and since
the drive number parameter defaults to 1, the \f3\-l\f1 and \f3\-u\f1
options never need to include a Fujitsu drive number.
.P
The SGI DLT-7000 autoloader (Minivault) is also dedicated to a 
single drive and hence the drive number need not be specified.
The SGI DLT-7000 autoloader is shipped from the factory with the loader
set for target ID 1, and the drive set for target ID 2. These
may have been changed at your individual site.
.P
The Fujitsu M1016/M1017 device's SCSI command to move media into
or out of a bin contains no load or unload field.  Its operation
is dependant on the state of the referenced bin and the device's
single drive.
Issuance of this command results in a drive load operation
if the bin contains a tape,
an unload operation if the drive contains a tape from that bin,
or an error if the bin was empty when the magazine was inserted
into the ACL or FACL.
If a tape loaded from another bin is in the drive when this command
is issued, this tape is automatically unloaded to its originating bin
before the tape in the referenced bin is loaded.
.P
Hence, the \f3\-l\f1 and \f3\-u\f1 options can be used
interchangably with the Fujitsu M1016/M1017.
The result of issuing either command will be a load or unload operation,
as appropriate for the current state of the bin referenced.
.SH "BUGS"
The DLT2700 does not respond to some error conditions with the expected
SCSI error messages.
For example, moving a tape to a bin that is
already occupied will result in an "invalid field in CDB" message
(that is the error returned by the 2700) rather than a "destination
element full" message.
.SH "FILES"
/dev/scsi/sc*
.SH SEE ALSO
chmod(1), ds(7M), hinv(1M).
