calmsacibis995/irix-6517-src/eoe/man/man1m/strace.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} strace 1M "Networking Support Utilities" "\&"
.TH \*(x}
.SH NAME
\f4strace\f1 \- print STREAMS trace messages
.SH SYNOPSIS
.nf
\f4strace\f1 [ \f2mid sid level\f1 ] ...
.fi
.SH DESCRIPTION
\f4strace\fP without arguments writes all STREAMS event trace messages
from all drivers and modules to its standard output.
These messages are obtained from the STREAMS log driver (\f4log\fP(7)).
If arguments are provided they must be in triplets of the form
\f2mid\f1, \f2sid\f1, \f2level\f1,
where \f2mid\f1 is a STREAMS module
ID
number, \f2sid\f1 is a sub-ID number,
and \f2level\f1 is a tracing priority level.
Each triplet indicates that tracing messages are to be received from the given
module/driver,
sub-ID (usually indicating minor device), and
priority level equal to or less than the given level.
The token \f4all\f1 can be used for any member to indicate no restriction for that attribute.
.P
The format of each trace message output is:
.Ex
<\f2seq\fP> <\f2time\fP> <\f2ticks\fP> <\f2level\fP> <\f2flags\fP> <\f2mid\fP> <\f2sid\fP> <\f2text\fP>
.Ee
.TP 10
<\f2seq\fP>
trace sequence number
.TP
<\f2time\fP>
time of message in \f2hh:mm:ss\fP
.TP
<\f2ticks\fP>
time of message in machine ticks since boot
.TP
<\f2level\fP>
tracing priority level
.TP
<\f2flags\fP>
\f4E\f1 : message is also in the error log
.br
\f4F\f1 : indicates a fatal error
.br
\f4N\f1 : mail was sent to the system administrator
.TP
<\f2mid\fP>
module
ID
number of source
.TP
<\f2sid\fP>
sub-ID number of source
.TP
<\f2text\fP>
formatted text of the trace message
.P
Once initiated, \f4strace\fP continues to execute until terminated by the user.
.SH EXAMPLES
Output all trace messages from the module or driver whose module
ID
is 41:
.Ex
\f4strace  41 all all\f1
.Ee
Output those trace messages from driver/module
ID
41 with
sub-IDs 0, 1, or 2:
.Ex
\f4strace  41 0 1  41 1 1  41 2 0\f1
.Ee
Messages from sub-IDs 0 and 1 must have
a tracing level less than or equal to 1.
Those from sub-ID 2 must have a tracing level of 0.
.SH SEE ALSO
log(7).
.SH NOTES
Due to performance considerations, only one \f4strace\fP process is permitted
to open the STREAMS log driver at a time.
The log driver has a list
of the triplets specified in the command invocation, and compares
each potential trace message against this list to decide if it should
be formatted and sent up to the \f4strace\fP process.
Hence, long lists
of triplets have a greater impact on overall STREAMS performance.
Running \f4strace\fP has the most impact on the timing of the modules and
drivers generating the trace messages that are sent to the \f4strace\fP process.
If trace messages are generated faster than the \f4strace\fP process can
handle them, some of the messages will be lost.
This last case can be determined by examining the sequence numbers on the trace messages output.
