calmsacibis995/irix-6517-src/eoe/man/man1m/strerr.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} strerr 1M "Networking Support Utilities" "\&"
.TH \*(x}
.SH NAME
\f4strerr\f1 \- \&STREAMS error logger daemon
.SH SYNOPSIS
.nf
\f4strerr\f1
.fi
.SH DESCRIPTION
\f4strerr\fP receives error log messages from the STREAMS log driver
(\f4log\fP(7)) and appends them to a log file.
The error log files produced
reside in the directory \f4/var/adm/streams\f1, and are named
\f4error.\f2mm\f4-\f2dd\f1, where \f2mm\f1 is the month
and \f2dd\fP is the day of the messages contained in each log file.
.P
The format of an error log message is:
.Ex
\f1<\f2seq\fP> <\f2time\fP> <\f2ticks\fP> <\f2flags\fP> <\f2mid\fP> <\f2sid\fP> <\f2text\fP>
.Ee
.TP 10
<\f2seq\fP>
error sequence number
.TP
<\f2time\fP>
time of message in hh:mm:ss
.TP
<\f2ticks\fP>
time of message in machine ticks since boot
priority level
.TP
<\f2flags\fP>
\f4\&T\f1 : the message was also sent to a tracing process
.br
\f4\&F\f1 : indicates a fatal error
.br
\f4\&N\f1 : send mail to the system administrator
.TP
<\f2mid\fP>
module
ID
number of source
.TP
<\f2sid\fP>
sub-ID number of source
.TP
<\f2text\f1>
formatted text of the error message
.P
Messages that appear in the error log are intended to report exceptional
conditions that require the attention of the system administrator.
Those messages which indicate the total failure of a STREAMS driver
or module should have the \f4F\f1 flag set.
Those messages requiring the immediate attention of the administrator have the
\f4N\f1 flag set,
which causes the error logger to send the message to the system administrator
via \f4mail\fP.
The priority level usually has no meaning in the error
log, but has meaning if the message is also sent to a tracer process.
.PP
Once initiated, \f4strerr\fP continues to execute until
terminated by the user.
It is commonly executed asynchronously.
.SH FILES
\f4/var/adm/streams/error.\f2mm\f4-\f2dd\f1
.SH SEE ALSO
log(7).
.SH NOTES
Only one \f4strerr\fP process at a time is permitted to open the
STREAMS log driver.
.PP
If a module or driver is generating a large number of error messages,
running the error logger causes a degradation in STREAMS performance.
If a large burst of messages are generated in a short time, the log driver
may not be able to deliver some of the messages.
This situation is indicated
by gaps in the sequence numbering of the messages in the log files.
