calmsacibis995/irix-6517-src/eoe/man/man1m/su.1m
.nr X
.if \nX=0 .ds x} su 1M "Essential Utilities" "\&"
.TH \*(x}
.SH NAME
su \- become superuser or another user
.SH SYNOPSIS
.nf
\f3su\f1 [ \f3\-\f1 ] [ name ] [ \f3\-M\f1 label ] [ \f3\-C\f1 capability set ] [ arg ... ]
.fi
.SH DESCRIPTION
.I su
allows you to become another user without logging off.
The default user
.I name
is
.B root
(that is, superuser).
.PP
To use
.IR su ,
you must supply the appropriate password
(except as described below).
If the password is correct,
.I su
executes a new shell with the real and effective user ID set to
that of the specified user.
The new shell is the program optionally
named in the shell field of the specified user's password
file entry (see
.IR passwd (4)),
or
.I /bin/sh
if none is specified (see
.IR sh (1)).
To restore normal user ID privileges, type an EOF (<(Ctrl-d>)
to the new shell.
.PP
.I su
prompts for a password if the specified user's account has one.
However,
.I su
does not prompt you if your user name is \f3root\fP or your name
is listed in the specified user's
.I .rhosts
file as:
.Ex
localhost \f2your_name\fP
.Ee
(The hostname of \f3localhost\f1 is shorthand for the machine's name.)
.SH OPTIONS
.TP
.BI \-C\ <capability\ set>
Execute the requested command with the specified
.I "capability set" .
The requested user must be cleared to operate with the requested capability
set. If capabilities are not configured on your system, this option is
silently ignored.
.TP
.BI \-M\ <MAC\ label>
Execute the requested command at the specifed
.I label .
The invoker of
.I su
must be cleared to operate at the requested label. If that label is different
than the user's current label, stdin, stdout, and stderr will be closed.
If MAC is not configured on your system, this option is silently ignored.
.PP
Any additional arguments given on the command line are
passed to the program invoked as the shell.
When using programs like
.IR sh (1),
an
.I arg
of the form
.B \-c
.I string
executes
.I string
via the shell and an arg of
.B \-r
gives the user a restricted shell.
.PP
.I su
reads
.I /etc/default/su
to determine default behavior.
To change the defaults, the system
administrator should edit this file.
Recognized values are:
.Ex
\f1SULOG=\f2file\f1	# Use \f2file\f1 as the su log file.
CONSOLE=\f2device\f1	# Log successful attempts to su root to \f2device\f1.
SUPATH=\f2path\f1	# Use \f2path\f1 as the PATH for root.
PATH=\f2path\f1		# Use \f2path\f1 as the PATH for normal users.
SYSLOG=FAIL	# Log to syslog all failures (SYSLOG=FAIL)
			# or all successes and failures (SYSLOG=ALL).
.Ee
The following statements are true only if the optional program named
in the shell field of the specified user's password file entry is
like \f2sh\fP(1).
If the first argument to
.I su
is a
.BR \- ,
the environment is changed
to what would be expected if the user
actually logged in as the specified user.
This is done by invoking the program used as the shell with an
.I arg0
value whose first character is
.BR \- ,
thus causing the system's profile (\f2/etc/profile\fP)
and then the specified user's profile
(\f2.profile\fP in the new HOME directory)
to be executed.
.PP
Otherwise, the environment is passed along with the possible exception of
.BR $PATH ,
which is set to
.Ex
/usr/sbin:/usr/bsd:/sbin:/usr/bin:/bin:/etc:/usr/etc:/usr/bin/X11
.Ee
for
.BR root .
Additionally, environment variables of the form of those that are
special to
.IR rld (1)
are not passed to the user's program; that is, variable names beginning with either
.B _RLD
or
.BR LD_LIBRARY .
Note that if the optional program used as the shell is
.IR /bin/sh ,
the user's \f2.profile\fP can check
.I arg0
for
.B \-sh
or
.B \-su
to determine if it was invoked by \f2login\fP(1) or \f2su\fP,
respectively.
If the user's program is other than \f2/bin/sh\fP, then \f2.profile\fP
is invoked with an
.I arg0
of
.BI \- program
by both \f2login\fP and \f2su\fP.
.PP
All attempts to become
another user
using \f2su\fP are logged in the log file
.I /var/adm/sulog
by default.
.SH SHARE II ACTIONS
If \f2su\f1 is invoked with the \f3\-\f1 option,
and the Share II system is installed and enabled, then
the new shell executed by
\f2su\f1
is attached to the lnode of the specified user.
.PP
If the specified user is not \f3root\f1,
the lnode attachment may fail due to a non-existent lnode
or reaching a memory or process limit,
in which case an error message is printed and
\f2su\f1 fails.
.SH EXAMPLES
To become user \f3bin\fP while retaining your previously
exported environment, execute:
.Ex
\f4su bin\f1
.Ee
To become user \f3bin\fP but change the environment
to what would be expected if \f3bin\fP had originally logged in,
execute:
.Ex
\f4su \- bin\f1
.Ee
To execute \f2command\fP with the temporary environment and permissions of
user \f3bin\fP, type:
.Ex
\f4su \- bin \-c "\f1\f2command\fP \f2args\fP\f4"\f1
.Ee
.SH FILES
.nf
.ta 1.6i
/etc/passwd	system's password file
/etc/profile	system's initialization script for \f2/bin/sh\f1 users
/etc/cshrc	system's initialization script for \f2/bin/csh\f1 users
$HOME/.profile	\f2/bin/sh\f1 user's initialization script
$HOME/.cshrc	\f2/bin/csh\f1 user's initialization script
$HOME/.rhosts	user's list of trusted users
/var/adm/sulog	log file
/etc/default/su	defaults file
/etc/limconf	compiled Share II configuration file (machine readable)
.fi
.SH SEE ALSO
capability(4),
env(1),
login(1),
rld(1),
sh(1),
cshrc(4),
passwd(4),
profile(4),
rhosts(4),
environ(5),
share(5).
.SH DIAGNOSTICS
.TP
\f7su: uid \f2N\f1\f7: cannot attach to lnode \- \f1\f2reason\f1.
The lnode attachment failed, so the shell was not executed.
