calmsacibis995/irix-6517-src/eoe/man/man1m/suattr.1m
.nr X
.if \nX=0 .ds x} suattr 1M "TrIRIX Administrative Commands" "\&"
.TH \*(x}
.SH NAME
suattr \- Execute shell command with specified capabilities at
specified MAC label
.SH SYNOPSIS
.nf
\f3suattr\f1  [ \f3\-M\f1 label ] [ \f3\-C\f1 capability set ] [ \f3\-m\f1 ][ arg ... ]
.fi
.SH DESCRIPTION
.I suattr
allows 
.I root 
to execute a command using the given capabilities set and
at the given MAC label.
.PP
.IR suattr
is designed primarily for system initialization, to grant commands
executed by startup scripts the privileges they need.  To use 
.I suattr, 
the real user id must be 0.  

.SH OPTIONS
.TP
.BI \-C\ <capability\ set>
Execute the requested command with the specified
.I "capability set" .
If capabilities are not configured on your system, this option is
silently ignored.
.TP
.BI \-M\ <MAC\ label>
Execute the requested command at the specified
.I label .
The invoker of
.I su
must be cleared to operate at the requested label. If that label is different
than the user's current label, stdin, stdout, and stderr will be closed.
If MAC is not configured on your system, this option is silently
ignored.
.TP
.BI \-m\ 
Execute the command with a moldy process label.

.PP
The remaining arguments given on the command line are
passed to 
.IR /bin/sh.
An
.I arg
of the form
.B \-c
.I string
executes
.I string
via the shell and an arg of
.B \-r
gives the user a restricted shell.

.SH EXAMPLES

.Ex
\f4/sbin/suattr -M dbadmin -c "killall syslogd"\f1

.Ee 
The command \f3killall syslogd\fP is executed at
the \f3dbadmin\fP label.

.Ex
\f4/sbin/suattr -C CAP_SWAP_MGT+ip -c "/sbin/swap -m"\f1

.Ee 
Set the inherited and permitted capability set to  \f3CAP_SWAP_MGP\fP
and execute \f3swap\fP.  This has the effect of granting \f3swap\fP
the  capability to execute the \f3swap(2)\fP system call.

.Ex
\f4/sbin/suattr -m -c "mv /tmp /.oldtmp"\f1

.Ee
Has the effect of preserving the moldy bit when \f3/tmp\fP is moved.

.SH FILES
.nf
.ta 1.6i
/etc/passwd	system's password file
/etc/capability system's capability file
/etc/clearance  user clearance label information file
.fi
.SH SEE ALSO
capability(4),
clearance(4),
newlabel(1m),
chcap(1).
.SH DIAGNOSTICS

Unexpected results, including a system which hangs during startup, may
occur if the user \f3root\fP is removed from \f3/etc/passwd\fP or if
\f3root's\fP capability set or clearance range is altered.
