calmsacibis995/irix-6517-src/eoe/man/man1m/systune.1m
.nr X
.if \nX=0 .ds x} systune 1M ""  "\&"
.TH \*(x}
.SH NAME
systune \- display and set tunable parameters
.SH SYNOPSIS
.nf
\f3systune\f1 [ \f3\-bfir\f1 ] [ \f3\-n\f1 name ] [ \f3\-p\f1 rootpath ]
      [ variable [ value ] ]
.fi
.SH DESCRIPTION
\f2systune\f1 is a tool that enables you to examine and configure your tunable
kernel parameters.
\f2systune\f1 can adjust some parameters in real time and
informs you if you need to reboot your system after reconfiguration.
It saves the reconfigured kernel in \f2/unix.install\f1, unless the
\f3\-f\f1 option is used.
.PP
\f2systune\f1 has two modes: interactive and noninteractive.
Interactive
mode allows you to query information about various portions of
tunable parameters or to set new values for tunable parameters.
Some parameters can be changed while
the system is running, and some require a new copy of the
kernel to be booted.
To enter interactive mode, use the \f3\-i\f1 option.
In noninteractive mode, \f2systune\f1 displays the values
of one tunable parameter or group of tunable parameters, or allows
the value of one tunable parameter to be changed.
Noninteractive mode is the default.
.PP
The options are:
.TP 8
.B \-b
Both target kernel and the running system are updated with the
new values that you specified,
if the new values are
within the legal range for the parameter specified in \f2/var/sysgen/mtune\f1.
The new values with the corresponding
tunable variables are also added into \f2/var/sysgen/stune\f1 file.
This is the default behavior.
.TP
.B \-f
This option forces \f2systune\f1 to not save the reconfigured kernel
in \f2/unix.install\f1.
By default, \f2systune\f1 tests to see if \f2/unix.install\f1
exists and whether it is identical to the running system.
If it is identical, \f2systune\f1 makes any changes in \f2/unix.install\f1;
otherwise, \f2systune\f1 copies the current \f2/unix\f1 kernel
or the kernel specified by the \f3\-n\f1 option to
\f2/unix.install\f1 and makes all changes to the copied kernel.
If the copy fails for any reason, such as lack of disk space or the
presence of the \f3\-f\f1 option, the currently running kernel is changed.
.TP
.B \-i
Run \f2systune\f1 in interactive mode.
When \f2systune\f1 is invoked in interactive mode, no parameter values
are immediately displayed.
Instead, you see the \f2systune\f1 prompt:
.sp .8v
.RS
	\f7systune->\f1
.RE
.IP
The commands available in interactive mode are described below.
.TP
.BI \-n " name"
This option specifies an alternate kernel \f2name\f1 to tune in place of
\f3/unix\f1.
.TP
.BI \-p " rootpath"
If you specify this option, \f2rootpath\f1 becomes the starting pathname
for \f2systune\f1 to check for \f2/var/sysgen/stune\f1 and
\f2/var/sysgen/mtune\f1.
The default \f2rootpath\f1 directory is \f3/\f1.
.TP
.B \-r
The new values change on the running system only.
If the tunable parameter can not be changed on the running
system, nothing is affected.
The default is \f3\-b\f1.
.PP
If the name of a variable is specified on the command line,
its current value is displayed.
If the name of a group is specified on the command line,
the names and values of all variables in that group are displayed.
If the name of a variable
and a value are specified on the command line, the variable's value
is changed after verification and confirmation.
.PP
The \f2systune\f1 commands available in interactive mode are:
.TP 8
\f3quit\f1
Quit \f2systune\f1 immediately.
Any changes you have made up to
that point are saved and cannot be discarded.
You must go through
and change back any parameters that you do not wish to be changed.
.TP
\f3all\f1
Print information on all tunable parameters.
This command displays the same
information as \f2systune\f1 invoked in noninteractive mode.
.TP
\f3help\f1
Show all the built-in commands and group names.
\f2systune\f1 lists two commands (\f3help\f1 and \f3all\f1) and
the groups of kernel tunable parameters.
Each group of tunable
parameters is organized so that related parameters are kept together.
For example, the \f3numproc\f1 parameter group
contains parameters related to the number of processes allowed to run
on the system at any given time.
Its parameters are:
.sp .8v
.nf
.RS
	ncsize = 808 (0x328)
	ncallout = 40 (0x28)
	callout_himark = 332 (0x14c)
	ndquot = 808 (0x328)
	nproc = 300 (0x12c)
.RE
.fi
.TP
\f2parameter_groupname\f1
Display information for all the tunable parameters in this group
along with their
values in decimal numerals and in hexadecimal notation.
.TP
\f2parameter_name\f1
Display information for this tunable parameter only.
.TP
\f2parameter_name newvalue\f1
Set the specified tunable parameter to the new value.
For example, to raise the \f3nproc\f1 parameter in the
\f3numproc\f1 parameter group from 300 to 400, follow this example:
.sp .8v
.nf
.RS
	systune-> \f4nproc 400\f1
	\f7nproc = 300 (0x12c)\f1
.sp .8v
	\f7Do you really want to change nproc to 400 (0x190)? (y/n)\f1 \f4y\f1
.sp .8v
	\f7In order for the change in parameter nproc to become
	effective, /unix.install must be moved to /unix and the
	system rebooted.\f1
.RE
.fi
.IP
This message tells you that the change does not take effect until a
new kernel with the new value is running on your system.
\f2systune\f1
always prints a message to inform you if you need to reboot your
system for a kernel change to take effect.
.IP
\f2systune\f1 makes all requested changes to the kernel in three places,
if possible.
(Nondynamically adjustable parameters can be changed in only
two out of three places.) The parameters are changed in:
.sp .8v
.RS
.PD 0
.IP \(bu 3
the running kernel image on the workstation
.IP \(bu 3
the \f2/unix\f1 or \f2/unix.install\f1 file
.IP \(bu 3
the \f2/var/sysgen/stune\f1 file
.PD
.RE
.IP
Some sanity checking is performed on the modified kernel parameters
to help prevent the creation of kernels that will not function correctly.
This checking is performed both by \f2systune\f1 and by the \f2lboot\f1(1M)
command.
For example, some variables have preset minimum and maximum
values.
Any attempt to change the variable beyond these threshold values
results in an error message, and the variable is not changed.
.RE
.SH FILES
.PD 0
.TP 22
/var/sysgen/mtune/*
system tunable parameters
.TP
/var/sysgen/stune
local settings for system tunable parameters
.PD
.SH SEE ALSO
autoconfig(1M),
lboot(1M),
mtune(4),
stune(4).
