calmsacibis995/irix-6517-src/eoe/man/man1m/telnetd.1m
.\" Copyright (c) 1983 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)telnetd.8	6.5 (Berkeley) 3/18/89
.\"
.TH telnetd 1M
.SH NAME
telnetd \- internet TELNET protocol server
.SH SYNOPSIS
.nf
\f3/usr/etc/telnetd\f1 [ \f3\-h\f1 ] [ \f3\-n\f1 ]
.fi
.SH DESCRIPTION
.I telnetd
is a server which supports the Internet standard
.B TELNET
virtual terminal protocol.
.I telnetd
is invoked by the Internet super-server (see
.IR inetd (1M)),
normally for requests to connect to the
.B TELNET
port as indicated by the
.I /etc/services
file (see
.IR services (4)).
The
.B \-h
option suppresses the host information banner before the login prompt.
The
.B \-n
option suppresses transport-level keep-alive messages.
The use of keep-alive messages allows sessions to be timed out
if the client crashes or becomes unreachable.
.PP
.I telnetd
operates by allocating a pseudo-terminal device (see
.IR pty (7))
for a client, then creating a login process which has
the slave side of the pseudo-terminal as
.BR stdin ,
.BR stdout ,
and
.BR stderr .
.I telnetd
manipulates the master side of the pseudo-terminal,
implementing the
.B TELNET
protocol and passing characters
between the remote client and the login process.
.PP
When a
.B TELNET
session is started up,
.I telnetd
sends
.B TELNET
options to the client side indicating
a willingness to do
.I remote echo
of characters, to
.I suppress go
.IR ahead ,
to do
.I remote flow
.IR control ,
and to receive
.I terminal type
information,
.I terminal speed
information,
and
.I window size
information
from the remote client.
If the remote client is willing, the remote terminal type is
propagated in the environment of the created login process.
.\"The pseudo-terminal allocated to the client is configured
.\"to operate in ``cooked'' mode, and with TAB3, ICRNL and ONLCR
.\"enabled (see
.\".IR termio (7)).
.PP
.I telnetd
is willing to
.IR do :
.IR echo ,
.IR binary ,
.I suppress go
.IR ahead ,
and
.I timing
.IR mark .
.I telnetd
is willing to have the remote client
.IR do :
.IR binary ,
.I terminal
.IR type ,
.I terminal
.IR speed ,
.I window
.IR size ,
.I toggle flow
.IR control ,
.IR environment ,
.I X display
.IR location ,
and
.I suppress go
.IR ahead .
Attempts to set environment variables understood by
rld(1) are ignored and logged.
Currently, these are
.B LD_LIBRARY_PATH
and any variable name starting with
.BR _RLD .
.SH SEE ALSO
telnet(1C).
.SH BUGS
Some
.B TELNET
commands are only partially implemented.
.PP
Because of bugs in the original 4.2 BSD
.IR telnet (1C),
.I telnetd
performs some dubious protocol exchanges to try to discover if the remote
client is, in fact, a 4.2 BSD
.IR telnet (1C).
.PP
.I Binary mode
has no common interpretation except between similar operating systems
(UNIX in this case).
.PP
The terminal type name received from the remote client is converted to
lower case.
.PP
.I telnetd
never sends
.B TELNET
.I go ahead
commands.
