calmsacibis995/irix-6517-src/eoe/man/man1m/tftpd.1m
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)tftpd.8c	6.2 (Berkeley) 5/26/86
.\"
.TH tftpd 1M
.SH NAME
tftpd \- internet Trivial File Transfer Protocol server
.SH SYNOPSIS
.nf
\f3/usr/etc/tftpd\f1 [\f3\-h\f1 \f2homedir\f1] [\f3\-l\f1] [\f3\-n\f1] \c
[\f3\-s\f1] [\f2directory\f1... ]
.fi
.SH DESCRIPTION
.I tftpd
is a server that supports the Internet Trivial File Transfer
Protocol (TFTP).
The TFTP server operates
at the port indicated in the \f3tftp\f1 service description;
see
.IR services (4).
The server is normally started by
.IR inetd (1M).
.PP
The use of
.IR tftp (1C)
does not require an account or password on the remote system.
Due to the lack of authentication information,
.I tftpd
allows only publicly readable files to be
accessed.
Files containing the string \f3..\fP/ are not allowed.
Files can be written only if they already exist and are publicly writable.
Note that this extends the concept of \f2public\f1 to include
all users on all hosts that can be reached through the network;
this may not be appropriate on all systems, and its implications
should be considered before enabling TFTP service.
The server should be configured in
.I /etc/inetd.conf
to run as the user ID with the lowest possible privilege.
.PP
Relative filenames are looked up in a home directory,
.I /var/boot
by default.
.PP
The
.I tftpd
options are:
.TP
.BI \-h " homedir"
Changes the home directory to
.IR homedir ,
provided it is an absolute pathname.
.TP
.B \-l
Logs all requests using
.IR syslog (3C).
.TP
.B \-n
Suppresses negative acknowledgement of requests for nonexistent
or inaccessible relative filenames.
Use
.B \-n
when operating on a network with Sun diskless clients that broadcast TFTP
requests for bootfiles named by relative pathnames, to avoid storms of
negative acknowledgements.
.TP
.B \-s
Rejects requests to read or write an absolute pathname
that does not begin with the home directory prefix and to
write a relative pathname.
(See below.)
.PP
Normally,
.I tftpd
allows unrestricted access to publicly-readable files in all directories.
There are two ways to enhance file security by restricting access to a smaller
set of directories.
With the
.B \-s
option,
.I tftpd
rejects requests to read or write an absolute pathname
that does not begin with the home directory prefix.
It also rejects requests to write a relative pathname.
Another method is
to restrict access to files in a limited number of \f2approved\f1 directories
by specifying the directory names,
.IR directory ,
as arguments to
.I tftpd
after the other options.
For an absolute pathname request,
.I tftpd
allows the request if its name begins with one of these directories or the
home directory.
For a relative pathname request, the home directory and the directory list
are searched in order.
Up to ten directories can be listed if no other command-line options
are specified.
.RI ( inetd
limits the total number of command-line arguments
to ten.)
.SH "SEE ALSO"
inetd(1M),
tftp(1C).
