calmsacibis995/irix-6517-src/eoe/man/man1m/tic.1m
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} tic 1M "Terminal Information Utilities" "\&"
.TH \*(x}
'\" ident	"@(#)svid_ti:ti_cmd/tic	1.9"
.\" Copyright 1991 UNIX System Laboratories, Inc.
.SH NAME
\f4tic\f1 \- terminfo compiler
.SH SYNOPSIS
.nf
\f4tic\f1 [ \f4-v\f1[\f2n\f1] ] [ \f4-c\f1 ] \f2file\f1
.fi
.SH DESCRIPTION
The command \f4tic\f1
translates a \f4terminfo\f1 file from the source format
into the compiled format.
The results are placed in the directory \f4/usr/share/lib/terminfo\f1.
The compiled format is necessary for use with the library routines
in \f4curses\fP(3X).
.TP 8
\f4\-v\f2n\f1
Specifies that (verbose) output be written to standard
error trace information showing \f4tic\f1's progress.
The optional integer \f2n\f1 is a number from 1 to 10,
inclusive, indicating the desired level of detail of information.
If \f2n\f1 is omitted, the default level is 1.
If \f2n\f1 is specified and greater
than 1, the level of detail is increased.
.TP
\f4\-c\f1
Specifies to check only \f2file\f1 for errors.
Errors in \f4use=\f1 links are not detected.
.TP
\f2file\f1
Contains one or more \f4terminfo\f1 terminal
descriptions in source format (see \f4terminfo\fP(4)).
Each description in the file describes the
capabilities of a particular terminal.
When a \f4use\f2=entry-name\f1 field is discovered
in a terminal entry currently being compiled,
\f4tic\f1 reads in the binary from
\f4/usr/share/lib/terminfo\f1 to complete the entry.
(Entries created from \f2file\f1 will be used first.
If the environment variable
\f4TERMINFO\f1
is set,
that directory is searched instead of \f4/usr/share/lib/terminfo\f1.)
\f4tic\f1 duplicates the capabilities in \f2entry-name\f1
for the current entry, with the exception of those
capabilities that explicitly are defined in the
current entry.
.P
If the environment variable \f4TERMINFO\f1 is set,
the compiled results are placed
there instead of \f4/usr/share/lib/terminfo\f1.
.P
Total compiled entries cannot exceed 4096 bytes.
The name field cannot exceed 128 bytes.
Terminal names exceeding 14 characters are
truncated to 14 characters and a warning message
will be printed.
.SS International Functions
\f4tic\fP can translate a \f4terminfo\fP(4) file including
variables for international functionality from the source format
to the compiled format.
.P
\f4tic\fP also recognizes the environment variable
\f4TERMINFO\fP with a value that includes characters from
the supplementary code sets as the pathname for the compiled result.
.PP
Entry names in \f4terminfo\fP(4) files must be in single-byte characters,
since the compiled result will be placed in a directory named
using the first byte of the entry name.
.SH FILES
\f4/usr/share/lib/terminfo/?/*\f1     compiled terminal description database
.SH SEE ALSO
captoinfo(1M),
infocmp(1M),
curses(3X),
terminfo(4).
.SH NOTES
.\"If the Enhanced Security Utilities are installed and running,
.\"privileged use of this command is restricted to maintenance mode.
.\"See the \f2System Administrator's Guide\fP for a description of
.\"maintenance mode.
.\".PP
When an entry, for example, \f4entry_name_1\f1, contains a
\f4use=\f2entry_name_2\f1
field,
any canceled capabilities in \f2entry_name_2\f1 must also
appear in \f4entry_name_1\f1 before \f4use=\f1
for these capabilities to be canceled in \f4entry_name_1\f1.
