calmsacibis995/irix-6517-src/eoe/man/man1m/timedc.1m
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)timedc.8	6.1 (Berkeley) 5/28/86
.\"
.TH timedc 1M "May 28, 1986"
.SH NAME
timedc \- timed control program
.SH SYNOPSIS
.nf
\f3/usr/etc/timedc\f1 [ command [ argument ... ] ]
.fi
.SH DESCRIPTION
.I timedc
is used to control the operation of the \f2timed\f1(1M) program.
It may be used to:
.IP \(bu 3
measure the differences between machines' clocks
.IP \(bu
find the location where the master time server is running
.IP \(bu
enable or disable tracing of messages received by \f2timed\fP
.IP \(bu
perform various debugging actions
.PP
Without any arguments,
.I timedc
prompts for commands from the standard input.
If arguments are supplied,
.I timedc
interprets the first argument as a command and the remaining
arguments as parameters to the command.
The standard input
may be redirected causing
.I timedc
to read commands from a file.
Commands can be abbreviated;
recognized commands are:
.PP
.PD 0
.TP 23
\f3?\f1 [ \f2command\f1 ...\& ]
.TP
\f3help\f1 [ \f2command\f1 ...\& ]
.PD
Print a short description of each command specified in the argument list,
or, if no arguments are given, a list of the recognized commands.
.TP
\f3clockdiff\f1 \f2host\f1 ...
Compute the differences between the clock of the host machine
and the clocks of the machines given as arguments.
.TP
\f3msite\f1 [ \f2host\f1 ...\& ]
Show the master time server for specified host(s).
.TP
\f3trace\f1 { \f3on\f1 | \f3off\f1 }
Enable or disable the tracing of incoming messages to \f2timed\fP
in the file \f2/var/adm/timed.log\f1.
.TP
\f3election\f1 \f2host\f1
Asks the
.I timed
on the target host to reset its "election" timers and to ensure that
a time master has been elected.
.TP
\f3quit\f1
Exit from
.IR timedc .
.SH FILES
.nf
.ta \w'/var/adm/timed.masterlog     'u
/var/adm/timed.log		tracing file for timed
/var/adm/timed.masterlog	log file for master timed
.fi
.SH SEE ALSO
.\".br
.\"\f2TSP: The Time Synchronization Protocol for UNIX 4.3BSD\fP,
.\"R. Gusella and S. Zatti
date(1),
timed(1M),
timeslave(1M),
adjtime(2),
icmp(7P).
.SH DIAGNOSTICS
.TP
\f4?Ambiguous command\f1
Abbreviation matches more than one command.
.TP
\f4?Invalid command\f1
No match found.
.TP
\f4?Privileged command\f1
Command can be executed by root only.
