calmsacibis995/irix-6517-src/eoe/man/man1m/trconfig.1m
.TH trconfig 1M
.SH NAME
trconfig \- configure Token Ring interface parameters
.SH SYNOPSIS
.B /usr/etc/trconfig
.I interface
[-fuv]
.br
.B /usr/etc/trconfig
.I interface
-[v]s
.I speed
.br
.B /usr/etc/trconfig
.I interface
-[v]M 
.I LAA_address
.SH DESCRIPTION
.I trconfig
is used to upgrade firmware, change ring speed, and/or assign a
locally administered address (LAA) to a token ring interface.
The first form without
.B \-u
and
.B \-f
displays firmware revision, software revision, IEEE assigned unique
MAC address, current operational MAC address, and the speed of the ring.
The first form with
.B \-u
or
.B \-f
is used to upgrade firmware or the board.
The second form is used to change the operational speed of the board.
The third form is used to change operational MAC address of the board.
.P
.I trconfig
is invoked at boot time from
.I /etc/init.d/network
to ensure the board is running the up-to-date firmware.
You may also
use it, once the system is up, to redefine an interface's operational
MAC address or operational speed.
.P
The
.I interface
parameter is a string of the form ``name unit'', for example,
\f3fv0\f1 or \f3gtr0\f1.
.P
Only the superuser can update the firmware, modify speed, or
modify the LAA of a token ring interface.
.P
The options have the following meaning:
.TP 11
.B \-u
Download firmware if and only if the firmware stored in the board's
flash RAM is older than the firmware to be downloaded.
.TP
.B \-f
Download new firmware regardless of the revision of the firmware in
the board's flash RAM.
.TP
.B \-v
Display the current revisions and operational steps.
.TP
.B \-s \f2speed\f1
Change speed.
The
.I speed
parameter takes only 4 or 16 as a valid value.
Changing the speed of the
board takes extra care: The operational speed of the ring is determined
by the operational speed of each tokenring interface, which means
all the token ring interfaces must run at same speed.
.TP
.B \-M \f2LAA_address\f1
Set LAA.
The LAA_address is a 12 hexadecimal digit number grouped into six
2-digit members with  period '.' as separators.
The leading '0' of
each member may be omitted.
At boot time, the
.I /etc/init.d/network
executes
.IR /usr/etc/tr/trconfig.sh .
.I /usr/etc/tr/trconfig.sh
changes LAA if LAA change is specified in the
.I /etc/config/trconfig.options
file.
For example, the line below in the
.I /etc/config/trconfig.options
file specifies LAA change for the Token Ring interface fv0 to 40.0.70.0.0.3:
.sp .8v
.RS
.in +5
fv0 -M 40.0.70.0.0.3
.Ee
.SH "FILES"
/usr/etc/tr/trconfig.sh         token ring LAA shell script
/etc/config/trconfig.options    token ring LAA database
.SH "NOTE"
Since the
.B fv
interface is PROM based while the
.B gtr
interface is EEPROM based, the \f3\-f\f1, \f3\-u\f1, and \f3\-s\f1 options for
.B fv
interfaces are quietly ignored unless the \f3\-v\f1 option is also given.
.SH SEE ALSO
netstat(1),
network(1M),
tokenring(7).
