calmsacibis995/irix-6517-src/eoe/man/man1m/uncompvm.1m
.TH uncompvm 1M "March 13, 1993"
.SH NAME
uncompvm \- expand a compressed IRIX vmcore dump of the operating system
.SH SYNOPSIS
.nf
\f3/etc/uncompvm\f1 [ \f3\-hvfd\f1 ] [ \f3\-s\f1 \f2max_mbytes\f1 ] 
[ \f3\-b \f1 \f2block_number \f1| \f2list\f1 | \f2check\f1 ] \f2corename\f1 [ \f2outfile\f1 ]
.fi
.SH DESCRIPTION
.I uncompvm
expands IRIX vmcore.n.comp files into standard vmcore.n files.
.PP
Under some circumstances, an IRIX operating system core dump may be made
in a special compressed format.
Running
.IR file (1)
on a vmcore.n.comp file yields something like the following:
.Ex
vmcore.0.comp:  IRIX vmcore dump of  'IRIX abu stever-j 03080214 IP19'
.Ee
.I uncompvm
without any command-line options uncompresses these into files of up to the
size of the physical memory on the
system that created the dump.
For this reason, it may not be advisable
to expand such dumps.
If
.I outfile
is not specified,
.I uncompvm
expands the dump into vmcore.n without the .comp extension.
.PP
The options are:
.TP 16
.B \-h
Header mode.
In header mode,
.I uncompvm
does not uncompress the entire dump file, but rather decodes
the dump header which contains information
about the system and the reason it created a vmcore file.
.TP
.B \-d
Debug mode. Useful only for debugging
.I uncompvm.
.TP
.B \-v
Verbose mode. Prints additional information for each block of
the
.I corename.
.TP
.BI \-s " max_mbytes"
Specifies the maximum size of the expanded vmcore.n file
in megabytes.
.TP
.BI \-b " block_number"
Print detailed information about a particular
.I block_number.
The
.I block_number
of interest can be possibly obtained by first running the
\'uncompvm -b list corename\'. (Output goes to stdout).
.TP
.BI \-b " list"
Print specific header information for each block of the
.I corename.
(Output goes to stdout, generates lots of output!).
.TP
.BI \-b " check"
.I uncompvm
will read all
.I corename
and verify the completeness and correctness of the
.I corename
dump. No output will be generated unless errors were detected.
.PP
When \-b is specified,
.I uncompvm
will not generate the uncompressed
.I outfile
even if the
.I outfile
has been specified on the
.I uncompvm
call. The \-b option is useful to see more in details the
internals of the
.I corename
and it is thus most used by developers.
.SH EXAMPLE
.TP 16
.Ex
\f4uncompvm -s 16 vmcore.0.comp\f1
.Ee
This uncompresses vmcore.0.comp into vmcore.0, truncating the
size of vmcore.0 to 16 megabytes if necessary.
.TP 16
.Ex
\f4uncompvm -b check vmcore.0.comp\f1
.Ee
This will read through the coredump and verify its correctness and
completeness. No output will be generated unless errors were detected.
.SH DIAGNOSTICS
\f4uncompvm: filename is not an IRIX compressed dump file!\f1 is printed if
.I uncompvm
doesn't recognize the file as a compressed dump file.
.SH SEE ALSO
savecore(1M).
