calmsacibis995/irix-6517-src/eoe/man/man1m/uucico.1m
.nr X
.if \nX=0 .ds x} uucico 1M "Basic Networking Utilities" "\&"
.TH \*(x}
.SH NAME
uucico \- file transport program for the uucp system
.SH SYNOPSIS
.nf
\f3/usr/lib/uucp/uucico\fP [\f3\-r\fP role] [\f3\-x\fP level] \c
[\f3\-i\fP iface] [\f3\-d\fP spool_dir]
	\f3\-s\fP system_name
.fi
.SH DESCRIPTION
.I uucico
is the file transport program for \f2uucp\f1 work file transfers.
Role numbers for the
.B \-r
are the digit 1 for master
mode or 0 for slave mode (default).
The
.B \-r
option should be specified as the digit 1 for master mode when
.I uucico
is started by a program or \f2cron\fP.
.I uux
and
.I uucp
both queue jobs that will be transferred by
.I uucico.
It is normally started by the scheduler, \f2uusched\fP,
but can be started manually;
this is done for debugging.
For example,
the shell
.I uutry
starts
.I uucico
with debugging turned on.
A single digit must be used for the
.B \-x
option with higher numbers for more debugging.
.P
The
.B \-i
option defines the interface used with \f2uucico\f1.
This interface only affects slave mode.
The known interface is UNIX.
.P
The device names, dialers, and so forth in \f2/usr/lib/uucp/Devices\f1
must be correct.
The device names used by uucp, such as \f2/dev/ttym3\f1,
must be readable and writable by the "user" uucp.
.P
Before starting to transfer a file, \f2uucico\f1 checks to see if
the file \f2/etc/nologin\f1 exists.
If it does, the connection is
broken.
.P
Any user name under which \f2uucico\f1 runs
(any "user" with
\f2/usr/lib/uucp/uucico\f1 as its shell in \f2/etc/passwd\f1)
must be no more than 8 characters long.
This restriction
is a result of the nature of the \f2/var/adm/utmp\f1 file.
System-names longer than 8 characters generally do not work because
of UUCP protocol restrictions.
In both cases, one tends to suffer strange "permission problems."
.SH FILES
.nf
/etc/nologin
/usr/lib/uucp/Systems
/usr/lib/uucp/Permissions
/usr/lib/uucp/Devices
/usr/lib/uucp/Devconfig
/usr/lib/uucp/Sysfiles
/usr/lib/uucp/Maxuuxqts
/usr/lib/uucp/Maxuuscheds
/var/spool/uucp/*
/var/spool/locks/LCK*
/var/spool/uucppublic/*
.fi
.SH SEE ALSO
cron(1M),
uucheck(1M),
uucp(1C),
uusched(1M),
uustat(1C),
uutry(1M),
uux(1C).
