calmsacibis995/irix-6517-src/eoe/man/man1m/uucleanup.1m
.nr X
.if \nX=0 .ds x} uucleanup 1M "Basic Networking Utilities" "\&"
.TH \*(x}
.SH NAME
uucleanup \- uucp spool directory clean-up
.SH SYNOPSIS
.nf
\f3/usr/lib/uucp/uucleanup\f1 [ \f3\-C\f1\f2time\f1 ] \c
[ \f3\-W\f1\f2time\f1 ] \c
[ \f3\-X\f1\f2time\f1 ] [ \f3\-m\f1\f2string\f1 ]
	[ \f3\-o\f1\f2time\f1 ] [ \f3\-s\f1\f2system\f1 ]
.fi
.SH DESCRIPTION
.I uucleanup
scans the spool directories for old files
and takes appropriate action to remove them in a
useful way:
.IP
Inform the requester of send/receive requests for
systems that can not be reached.
.IP
Return mail that cannot be delivered to
the sender.
.IP
Delete or execute rnews for rnews type files
(depending on where the news originated\-\-locally or
remotely).
.IP
Remove all other files.
.PP
In addition, there is provision to warn users of requests that
have been waiting for a given number of days (default 1).
Note that
.I uucleanup
processes as if all option
.IR time s
were specified to the default values unless \f2time\f1 is specifically set.
.PP
The following options are available:
.TP 10
.BI \-C time
Any \f3C.\f1 files greater or equal to \f2time\f1 days old are
removed with appropriate information to the requester (default 7 days).
.TP
.BI \-D time
Any \f3D.\f1 files greater or equal to \f2time\f1 days old are
removed.
An attempt is made to deliver mail messages and
execute rnews when appropriate (default 7 days).
.TP
.BI \-W time
Any \f3C.\f1 files equal to \f2time\f1 days old
causes a mail message to be sent to the requester warning about
the delay in contacting the remote.
The message includes the \f2JOBID\f1, and in the case of mail,
the mail message.
The administrator can include a message line telling whom to
call to check the problem (\f3\-m\f1 option) (default 1 day).
.TP
.BI \-X time
Any \f3X.\f1 files greater or equal to \f2time\f1 days old are
removed.
The \f3D.\f1 files are probably not present (if they were, the \f3X.\f1 could get
executed).
But if there are \f3D.\f1 files, they are taken care of by \f3D.\f1 processing
(default 2 days).
.TP
.BI \-m string
This line is included in the warning message generated by the
.B \-W
option.
.TP
.BI \-o time
Other files whose age is more than
.I time
days are deleted (default 2 days).
The default line is "See your local administrator to locate the problem".
.TP
.BI \-s system
Execute for \f2system\f1 spool directory only.
.TP
.BI \-x debug_level
The
.B \-x
debug level is a single digit between 0 and 9;
higher numbers give more detailed debugging information.
(If \f2uucleanup\f1 was compiled with -DSMALL, no debugging
output is available.)
.ig
.\" Commenting out stuff that applies only to source licensees:
.\"Note, however,
.\"that if
.\".I uucp
.\"is compiled with the
.\".B \-DSMALL
.\"option,
.\"there will be very little debugging output.
..
.PP
This program is typically started by the shell \f2uudemon.cleanup\f1,
which should be started by
.IR cron (1M).
.SH FILES
.PD 0
.TP 20
/usr/lib/uucp
directory with commands used by
.I uucleanup
internally
.TP
/var/spool/uucp
spool directory
.PD
.SH SEE ALSO
cron(1M),
uucp(1C),
uux(1C).
