calmsacibis995/irix-6517-src/eoe/man/man1m/uucpd.1m
.TH uucpd 1M
.SH NAME
uucpd \- \&UUCP over TCP/IP daemon
.SH SYNOPSIS
.nf
\f3/usr/lib/uucp/uucpd\f1 [\f3\-na\f1] [\f3\-x\f1 \f2num\f1] \c
[\f3\-L\f1 \f2logfile\f1] [\f3\-u \f2cmd\f1]
.fi
.SH DESCRIPTION
.I uucpd
allows the use of incoming UUCP connections over TCP/IP.
The UUCP/TCP server operates
at the port indicated in the \f2uucp\f1 service description;
see
.IR services (4).
The server is normally started by
.IR inetd (1M).
.PP
Any of the UUCP protocols supported by \f2uucico\f1 can be used,
but 'e' and 't' are most common.
.PP
\f2uucpd\f1 relies primarily on the authentication mechanisms of \f2uucico\f1.
However, it first obtains a username and password from the remote system,
and checks them in much the same way as
.I getty
and
.IR login .
The shell, username, UID, and so forth for the account should the same
as for a UUCP connection using modems.
An additional restriction is that the shell of the account
must be the
.I uucico
program.
.PP
The
.I /etc/nologin
file is honored by
.IR uucico .
.PP
The
.I uucpd
options are:
.TP 13
.B \-n
(or \f3nostrip\f1) Turns off the stripping to 7-bits of the user name and
password that is normal done before they are checked.
.TP
.B \-a
Verifies that the remote hostname and address match on all
incoming connections.
.TP
.BI \-x " num"
Causes
.I uucico
to be invoked with \f3\-x\f1 \f2num\f1.
\f2num\f1 must be a single digit.
.TP
.BI \-L " logfile"
Records the chatting for username and password in
.IR logfile .
.TP
.BI \-u " cmd"
Specifies that
.I cmd
instead of
.I /usr/lib/uucp/uucico
must be the shell of the account.
.SH SEE ALSO
inetd(1M),
uucico(1M),
services(4).
