calmsacibis995/irix-6517-src/eoe/man/man1m/uugetty.1m
'\"macro stdmacro
.if n .pH g1a.uugetty @(#)uugetty	30.4 of 4/1/86
.nr X
.if \nX=0 .ds x} UUGETTY 1M "Basic Networking Utilities" "\&"
.if \nX=1 .ds x} UUGETTY 1M "Basic Networking Utilities"
.if \nX=2 .ds x} UUGETTY 1M "" "\&"
.if \nX=3 .ds x} UUGETTY "" "" "\&"
.TH \*(x}
.SH NAME
uugetty \- set terminal type, modes, speed, and line discipline
.SH SYNOPSIS
\f3/usr/lib/uucp/uugetty\fP [\f3\-hNDr\fP] [\f3\-t\fP timeout] [\f3\-d\fP delay]
.br
		[\f3\-i\fP chat1,[chat2]] line [speed [type [linedisc]]]
.br
\f3/usr/lib/uucp/uugetty \-c\fP file
.SH DESCRIPTION
.I uugetty
is similar to \f2getty\f1(1M), but changes have been made to support
using the line for \f2uucico\f1, \f2cu\f1, and \f2ct\f1;
that is, the line can be used in both directions.
The \f2uugetty\f1 will allow users to login, but if the line is free,
\f2uucico\f1, \f2cu\f1, or \f2ct\f1 can use it for dialing out.
The implementation depends on the fact that \f2uucico\f1, \f2cu\f1, and \f2ct\f1
create lock files when devices are used.
When the "open()" returns
(or the first character is read when
.B \-r
option is used),
the status of the lock file indicates whether the line is being
used by \f2uucico\f1, \f2cu\f1, \f2ct\f1, or someone trying to login.
.PP
The
.B \-d
option specifies a number of seconds to wait after the first character
is available from the line, and then to discard all input.  This option
can be useful with modems which provide 'call progress' information
when answering.  For example, the
.B \-d
option can be used to ignore 'RING' and 'CONNECT' which would otherwise
fool \f2uugetty\f1 into invoking \f2login\f1 before the correct speed
has been determined.
When possible, two chat-scripts should be used with \f3-i\fP option instead.
.PP
The
.B \-i
option specifies one or two "chat-script" entries in
\f3/etc/uucp/Dialers\f1.
\f2Uugetty\f1 uses the first chat-script before
going to sleep to wait for the first input.
This should be used to tell a modem to answer the telephone the next
time it rings.  The modem can be configured to not answer until
\f2uugetty\fP is ready to answer.
.PP
The second chat-script used with \f3\-i\fP can be used to wait for the
modem to say the connection is completely established.
This allows stray 'RING' messages or long modem protocol negotiations
to be ignored gracefully.
.PP
.B \-N
option honors the \f3/etc/nologin\f1 file.  When present, \f2uugetty\f1
does not answer the line, but instead waits for the file to go away.
.PP
Unless
.I uugetty
is invoked with the
.B \-h
flag,
.I uugetty
will force a hangup on the line by setting the speed to zero
before setting the speed to the default or specified speed.
The
.B \-t
flag plus \f2timeout\fP (in seconds), specifies that \f2uugetty\f1
should exit if the open on the line succeeds and no
one types anything in the specified number of seconds.
.PP
The
.B \-D
option turns on \f2uucico\f1 debugging, with the output sent to
the system log, \f2/var/adm/SYSLOG\fP.  
It can be useful for testing a script specified with the
.B \-i
option.
.PP
Note that when the
.B \-r
option is used, several <carriage-return> characters may be required before
the login message is output.
The human users will be able to handle this slight inconvenience.
\f2Uucico\f1 trying to login will have to be told by using the following
login script:
.PP
	""  \\r\\d\\r\\d\\r\\d\\r in:--in: ...
.PP
where the ... is whatever would normally be used for the login sequence.
.PP
An entry for direct line that has a \f2uugetty\f1 on each end must use the
.B \-r
option.
This causes \f2uugetty\f1 to wait to read a character before it puts out the
login message, thus preventing two uugettys from looping.
If there is a
.I uugetty
on one end of a direct line,
there must be a
.I uugetty
on the other end as well.
.PP
Here is an \f3/etc/inittab\f1 entry using \f2uugetty\f1 on an intelligent modem:
.sp
.nf
t5:23:respawn:/usr/lib/uucp/uugetty -Nt 60 -itelebitin,conn ttyf5 dx_19200
.fi
.PP
Note that a \f3/etc/gettydefs\f1 entry which cycles among the
speed(s) appropriate for the modem should be chosen.
Modems which "lock" to a single speed, such as most high speed modems,
should be used with a \f3gettydefs\f1 entry which sticks to a single
speed, such as dx_19200.
.PP
When
.I uugetty
is invoked with the
.B \-c
option and \f2file\fP, it scans the file as if it were scanning
.B /etc/gettydefs
during normal operation,
and prints out the results to the standard output.  If there
are any unrecognized modes or improperly constructed entries, it
reports these.  If the entries are correct, it prints out the
values of the various flags.  See
.IR ioctl (2)
to interpret the
values.  Note that some values are added to the flags automatically.
.SH FILES
.nf
/etc/nologin
/etc/gettydefs
/var/adm/SYSLOG
/etc/uucp/Dialers
.br
/etc/issue
.SH "SEE ALSO"
login(1),
cu(1C), 
getty(1M), 
init(1M), 
uucico(1M),
ioctl(2), gettydefs(4), inittab(4),
duart(7), 
tty(7) 
.SH DIAGNOSTICS
Most error messages are sent to the system log, \f2/var/adm/SYSLOG\fP.
