calmsacibis995/irix-6517-src/eoe/man/man1m/uusched.1m
.nr X
.if \nX=0 .ds x} uusched 1M "Basic Networking Utilities" "\&"
.TH \*(x}
.SH NAME
uusched, pollhost, uudemon.hour, uudemon.poll \- the scheduler for the uucp file transport program
.SH SYNOPSIS
.nf
\f3/etc/uucp/uusched\fP [\f3\-x\f1 sched_level] [\f3\-u\f1 cico_level]
\f3/etc/uucp/pollhost\fP [\f3-p\fP] sys_name1 [sys_name2 ...]
\f3/etc/uucp/uudemon.hour\fP
\f3/etc/uucp/uudemon.poll\fP
.fi
.SH DESCRIPTION
.I uusched
is the \f2uucp\f1 file transport scheduler.
It is usually started by the
.I uudemon.hour
script that is started by \f2cron\f1(1M)
from an entry in \f2/var/spool/cron/crontabs/uucp\f1 such as:
.Ex
39 * * * * /etc/uucp/uudemon.hour
.Ee
The two options are for debugging purposes only:
.TP 17
.BI \-x " sched_level"
Output debugging messages from
.IR uusched .
.TP
\f3\-u\f1 \f2cico_level\f1
Passed as
\f3\-x\f1\ \f2cico_level\f1 to
.IR uucico .
.PP
The \f2sched_level\f1 or \f2cico_level\f1 is a number between 0 and 9.
Larger numbers give more detailed information.
.P
Before starting to contact each remote machine, \f2uusched\f1 checks to see if
the file \f2/etc/nologin\f1 exists.
If it does, the entire process is
stopped.
.P
\f2uudemon.poll\fP schedules calls to remote systems listed in the
file \f2/etc/uucp/Poll\fP.
Only those systems with listed
hours equal to the current time are scheduled.
.P
\f2pollhost\fP schedules calls to the remote systems listed as
its arguments.
The optional \f3\-p\fP causes \f2uusched\fP to be
started immediately, instead of waiting for it to be started by
\f2cron\fP.
These two scripts are commonly used to poll
remote machines, because the remote machines do not call this
one, to minimize the delays caused by busy telephones,
or simply to test the connection.
One of them is often executed by \f2cron\f1(1M)
from an entry in \f2/var/spool/cron/crontabs/uucp\f1.
For example,
the following entry polls all known neighbors twice a month:
.Ex
0 0 1,5 * * /etc/uucp/pollhost `uuname`
.Ee
.SH FILES
.nf
/etc/nologin
/etc/uucp/Systems
/etc/uucp/Permissions
/etc/uucp/Devices
/etc/uucp/Poll
/var/spool/uucp/*
/var/spool/locks/LCK*
/var/spool/uucppublic/*
/var/spool/cron/crontabs/uucp
.fi
.SH SEE ALSO
cron(1M),
uucico(1M),
uucp(1C),
uuname(1C),
uustat(1C),
uux(1C).
