calmsacibis995/irix-6517-src/eoe/man/man1m/xactl.1m
.TH xactl 1m
.SH NAME
xactl \- extended accounting control
.SH SYNOPSIS
.nf
\f3xactl \f2[options...] subcommand\f1
.SH DESCRIPTION
The \f2xactl\f1 command is used to query or modify
extended accounting behavior on a running system.
The particular operation to be performed is specified by
\f2subcommand\f1, which may be in upper, lower or mixed case.
.PP
The valid subcommands are:
.PP
.TP 0.5i
\f3allownew\f1
Permits any member of an array session to start a new array session
using the \f2newarraysess\f1(2) system call.
The handle of the array session is specified with the \f3-ash\f1
option.
The user must be privileged to invoke this subcommand.
Notice that it is normally the case that a member of an array session
can invoke \f2newarraysess\f1 successfully; \f3allownew\f1 would be
used to undo a previous \f3restrictnew\f1 subcommand.
.TP
\f3flushallsessions\f1
Similar to the \f3flushsession\f1 subcommand, except that accounting
information for \f2all\f1 array sessions that are currently active will
be flushed.
The user must be privileged to invoke this subcommand.
.TP
\f3flushsession\f1
Flushes any accounting information that has been accumulated for a
particular array session.
The handle of the array session is specified with the \f3-ash\f1
option.
If array session accounting is active (see \f2extacct\f1(5)), then
a record reporting the resource usage information that has been
accumulated by the array session will be written.
Array session accounting records that are written using this operation
will be marked as "flushed" to indicate that subsequent records for
the same array session may be forthcoming.
Under normal circumstances, the resource usage for an array session
only includes the resources used by processes that have already
terminated;
the flushed accounting data will not include the resources used by
any members of the array session that are still running.
The user must be privileged to invoke this subcommand.
.TP
\f3getdfltspi\f1
Prints the current default Service Provider Information, which will
be used to identify all array sessions that do not override the
system default.
.TP
\f3getdfltspilen\f1
Prints the number of bytes of storage that is allocated to each new
array session for Service Provider Information.
.TP
\f3getsaf\f1
Prints the current session accounting format (typically "1" or "2").
.TP
\f3getspi\f1
Prints the Service Provider Information associated with
a particular array session.
The handle of the array session is specified with the \f3-ash\f1
option.
.TP
\f3getspilen\f1
Prints the number of bytes of storage that have been allocated
for Service Provider Information in a particular array session.
The handle of the array session is specified with the \f3-ash\f1
option.
.TP
\f3restrictnew\f1
Restricts any member of an array session from starting a new array session
using the \f2newarraysess\f1(2) system call;
any attempt to do so will result in an EPERM error.
The handle of the array session is specified with the \f3-ash\f1
option.
This restriction can be removed later using the \f3allownew\f1 subcommand.
.TP
\f3sessioninfo\f1
Prints any accounting information that has been accumulated for
a particular array session.
The handle of the array session is specified with the \f3-ash\f1
option.
If the array session's accounting information has been flushed,
then the accumulated charged accounting data from the time of the
last flush will also be printed.
Note that if session accounting has not been enabled in the system,
then most data will appear as "0".
.TP
\f3setdfltspi\f1
Set the default Service Provider Information that is to be assigned
to any array session which has not set its own Service Provider Information.
This will take effect immediately, even for running array sessions.
For details on \f2SPI-info\f1, see "Specifying Service Provider Information"
below.
The user must be privileged to invoke this subcommand.
.TP
\f3setdfltspilen\f1
Sets the number of bytes of storage that will be allocated to each new
array session for Service Provider Information to the value specified
by the \f3-length\f1 option.
The new length must be in the range of 0 to 1024.
Note that once an array session has been created, it can change the amount
of storage it has allocated for Service Provider Information with
the \f3setspilen\f1 subcommand or the \f2arsop\f1 system call.
The user must be privileged to invoke this subcommand.
.TP
\f3setsaf\f1
Sets the current session accounting format to the value specified by
the \f3-format\f1 option.
The new format must be either "1" or "2".
All subsequent session accounting records that are generated by the
kernel will be in the specified format.
Note that the session accounting format is different than the
service provider information format.
The user must be privileged to invoke this subcommand.
.TP
\f3setspi\f1
Set the Service Provider Information associated with a particular
array session.
The handle of the array session is specified with the \f3-ash\f1
option.
For details on specifying the new service provider information,
see "Specifying Service Provider Information" below.
The user must be privileged to invoke this subcommand.
.TP
\f3setspilen\f1
Changes the number of bytes of storage that is allocated for Service
Provider Information in a particular array session.
The handle of the array session is specified with the \f3-ash\f1
option and the new length is specified with the \f3-length\f1 option.
The new length must be in the range of 0 to 1024.
The user must be privileged to invoke this subcommand.
.SH GENERAL OPTIONS
.PP
The behavior of \f2xactl\f1 can be modified by the following options.
They must be specified before the subcommand name.
Options that are irrelevant to a particular subcommand will be
silently ignored.
.TP 0.5i
\f3-ash \f2handle\f1 or \f3-h \f2handle\f1
For subcommands that act on a single array session, this specifies
the handle of the specific array session.
The default is to use the array session containing the process
running \f2xactl\f1.
.TP
\f3-brief\f1 or \f3-b\f1
Specifies that output should be briefer than normal, generally
by omitting headers and other explanatory information.
This would useful when \f2xactl\f1 is called from a script.
.TP
\f3-format \f2fmt\f1 or \f3-f \f2fmt\f1
Specifies a format value.
For the \f3setsaf\f1 subcommand, this would be the session accounting
format, which must be either "1" or "2".
For subcommands that involve service provider information, this
specifies an explicit format to be used when parsing command line
options and/or printing the service provider information
(see below for more details).
In this case, valid values are "0", "1" or "2".
.TP
\f3-length \f2length\f1 or \f3-l \f2length\f1
For the \f3setdfltspilen\f1 and \f3setspilen\f1 subcommands, this
specifies the new length of the service provider information buffer.
For subcommands that involve the service provider information itself, this
specifies the number of bytes of service provider information that
should actually be read or written for the array session.
If this is less than the amount of storage allocated to the array
session for service provider information, then any remaining storage
will be padded with zeroes.
In this case the default is to use exactly as many bytes as have been
allocated to the array session for service provider information
(see \f3getdfltspilen\f1 and \f3getspilen\f1).
.SH SPECIFYING SERVICE PROVIDER INFORMATION
The \f3setspi\f1 and \f3setdfltspi\f1 subcommands allow the user
to specify the service provider information associated with a
particular array session or the default system settings, respectively.
Because service provider information is typically made up of several
free-format fields, it may take several command line options to fully
specify it.
For more information on service provider information, see
\f2array_services\f1(5).
.PP
Both format 1 and format 2 service provider information are
supported, as well as a "format 0", which indicates unformatted
data.
The format to be used can normally be inferred by \f2xactl\f1
from the current length of the array session's service provider
information: a length of 64 implies format 1, a length of 128
implies format 2, and any other length implies "format 0".
However, the \f3-format\f1 option can be used to explicitly
force a particular format to be used.
.SS Format 0 Options
These options are mutually exclusive with each other and
incompatible with the Format 1 and Format 2 options.
.TP 0.5i
\f3-clear\f1
Reset the service provider information to zeroes.
.TP
\f3-default\f1
Reset the service provider information to the system default
(same as \f3-clear\f1 for the \f3setdfltspi\f1 subcommand).
.TP
\f3-fill \f2byte\f1
Fill the entire service provider information area with the
value \f2byte\f1, an unsigned single-byte value.
.SS Format 1 Options
These options are incompatible with the Format 0 options.
They also cannot be specified if
the current length of the affected service provider information
area is less than 64 bytes.
These options \f2can\f1 by specified for Format 2 as well.
.TP 0.5i
\f3-company \f2string\f1
\f2string\f1 contains up to 8 bytes of (typically ASCII) data to be
stored in the \f3spi_company\f1 field of the service provider information.
.TP
\f3-initiator \f2string\f1
\f2string\f1 contains up to 8 bytes of data to be
stored in the \f3spi_initiator\f1 field of the service provider information.
.TP
\f3-origin \f2string\f1
\f2string\f1 contains up to 16 bytes of data to be
stored in the \f3spi_origin\f1 field of the service provider information.
.TP
\f3-spi \f2string\f1
\f2string\f1 contains up to 16 bytes of data to be
stored in the \f3spi_spi\f1 field of the service provider information.
.SS Format 2 Options
These options are incompatible with the Format 0 options.
They also cannot be specified if "-format 1" was specified,
or if the current length of the affected service provider
information area is less than 128 bytes.
.TP 0.5i
\f3-jobname \f2string\f1
\f2string\f1 contains up to 32 bytes of data to be stored in
the \f3spi_jobname\f1 field of the service provider information.
.TP
\f3-subtime \f2ticks\f1
\f2ticks\f1 is a signed 64-bit value to be stored in the
\f3spi_subtime\f1 field of the service provider information.
.TP
\f3-exectime \f2ticks\f1
\f2ticks\f1 is a signed 64-bit value to be stored in the
\f3spi_exectime\f1 field of the service provider information.
.TP
\f3-waittime \f2ticks\f1
\f2ticks\f1 is a signed 64-bit value to be stored in the
\f3spi_waittime\f1 field of the service provider information.
.SH NOTES
Extended accounting is not generally enabled in IRIX by default.
See \f2extacct\f1(5) for more details on using extended accounting.
.SH "SEE ALSO"
arsctl(2),
arsop(2),
array_sessions(5),
extacct(5).
