calmsacibis995/irix-6517-src/eoe/man/man1m/xfs_growfs.1m
.TH xfs_growfs 1M
.SH NAME
xfs_growfs \- expand an XFS filesystem
.SH SYNOPSIS
.nf
\f3xfs_growfs\f1 [ \f3\-D\f1 size ] [ \f3\-d\f1 ] \c
[ \f3\-e\f1 rtextsize ] [ \f3\-i\f1 ] [ \f3\-L\f1 size ]
	[ \f3\-l\f1 ] [ \f3\-m\f1 maxpct ] [ \f3\-n\f1 ] \c
[ \f3\-R\f1 size ] [ \f3\-r\f1 ] [ \f3\-x\f1 ] mount-point
.fi
.SH DESCRIPTION
.I xfs_growfs
expands an existing XFS filesystem (see
.IR xfs (4)).
The
.I mount-point
argument is the pathname of the directory where the filesystem
is mounted.
The filesystem must be mounted to be grown (see
.IR mount (1M)).
The existing contents of the filesystem are undisturbed, and the added space
becomes available for additional file storage.
.PP
The options to
.I xfs_growfs
are:
.TP
\f3\-d\f1, \f3\-D\f1 \f2size\f1
Specifies that the data section of the filesystem should be grown.
If the
.B \-D
.I size
option is given, the data section is grown to that size, otherwise
the data section is grown to the largest size possible.
The size
is expressed in
filesystem blocks.
.TP
.B \-e
Allows the real-time extent size to be specified.
In
.IR mkfs_xfs (1M)
this is specified with
.B \-r
.BI extsize= nnnn.
.TP
.B \-i
The new log is an internal log
(inside the data section).
.TP
\f3\-l\f1, \f3\-L\f1 \f2size\f1
Specifies that the log section of the filesystem should be grown,
shrunk, or moved.
If the
.B \-L
.I size
option is given, the log section is changed to be that size,
if possible.
The size is expressed in
filesystem blocks.
The size of an internal log must be smaller than the size
of an allocation group (this value is printed at \f2mkfs\f1(1M) time).
If neither
.B \-i
nor
.B \-x
is given with
.BR \-l ,
the log continues to be internal or external as it was before.
.TP
.B \-m
Specify a new value for the maximum percentage
of space in the filesystem that can be allocated as inodes.
In
.I mkfs_xfs
this is specified with
.B -i
.BI maxpct= nn.
.TP
.B \-n
Specifies that no change to the filesystem is to be made.
The filesystem geometry is printed, and argument checking is performed,
but no growth occurs.
.TP
\f3\-r\f1, \f3\-R\f1 \f2size\f1
Specifies that the real-time section of the filesystem should be grown.
If the
.B \-R
.I size
option is given, the real-time section is grown to that size, otherwise
the real-time section is grown to the largest size possible.
The size
is expressed in
filesystem blocks.
The filesystem does not need to have contained a real-time section before
the \f2xfs_growfs\f1 operation.
.TP
.B \-x
The new log is an external log
(in an XLV log subvolume).
.PP
.I xfs_growfs
is most often used in conjunction with
logical volumes
(see
.IR xlv (7M)
or
.IR lv (7M)).
However, it can also be used on a regular disk partition, for example if a
partition has been enlarged while retaining the same starting block.
.SH PRACTICAL USE
Filesystems normally occupy all of the space on the device where they
reside.
In order to grow a filesystem, it is necessary to provide added
space for it to occupy.
Therefore there must be at least one spare new
disk partition available.
Adding the space is done through the mechanism of
logical volumes.
If the filesystem already resides on a logical volume, the volume is simply
extended using
.IR mklv (1M)
or
.IR xlv_mgr (1M).
If the filesystem is currently on a regular partition, it is necessary to
create a new logical volume whose first member is the existing partition,
with subsequent members being the new partition(s) to be added.
Again,
.I mklv
or
.I xlv_mgr
is used for this.
In either case
.I xfs_growfs
is run on the mounted filesystem, and the expanded filesystem is
then available for use.
.SH SEE ALSO
mkfs_xfs(1M),
mklv(1M),
mount(1M),
xlv_make(1M),
lv(7M),
xlv(7M).
