calmsacibis995/irix-6517-src/eoe/man/man1m/xfs_ncheck.1m
.TH xfs_ncheck 1M
.SH NAME
xfs_ncheck, xfs_ncheck64 \- generate pathnames from i-numbers for XFS
.SH SYNOPSIS
.nf
\f3xfs_ncheck\f1 [ \f3\-i\f1 ino ] ... \c
[ \f3\-s\f1 ] xfs_special
.sp .8v
\f3xfs_ncheck\f1 \f3\-f\f1 [ \f3\-i\f1 ino ] ... \c
[ \f3\-s\f1 ] file
.sp .8v
\f3xfs_ncheck64\f1 [ \f3\-i\f1 ino ] ... \c
[ \f3\-s\f1 ] xfs_special
.sp .8v
\f3xfs_ncheck64\f1 \f3\-f\f1 [ \f3\-i\f1 ino ] ... \c
[ \f3\-s\f1 ] file
.fi
.SH DESCRIPTION
.I xfs_ncheck
with no
.B \-i
arguments generates an inode number and pathname list of all
files on the given filesystem.
Names of directory files are followed by 
.BR /. .
The output is not sorted in any particular order.
The filesystem to be examined is specified by the
.I xfs_special
argument, which should be the disk or volume device for the filesystem.
Filesystems stored in files can also be checked, using the \f3\-f\f1 flag.
.PP
.I xfs_ncheck64
is a 64-bit version of
.I xfs_check
which is not as susceptible to running out of memory.
It is available only on 64-bit capable systems.
.PP
The options to \f2xfs_ncheck\f1 are:
.TP 9
.B \-f
Specifies that the special device is actually a file (see the
\f2mkfs_xfs\f1 \f3\-d\f1 \f2file\f1 option).
This might happen if an image copy
of a filesystem has been made into an ordinary file.
.TP
.B \-s
Limits the report to special files and files with setuserid mode.
This option may be used to detect violations of security policy.
.TP
.BI \-i " ino"
Limits the report to only those files whose inode numbers follow.
May be given multiple times to select multiple inode numbers.
.PP
If the filesystem is seriously corrupted, or very busy and looks
like it is corrupt, a message of the form that would be generated by
.IR xfs_check (1M)
may appear.
.PP
.I xfs_ncheck
is only useful with XFS filesystems.
For EFS filesystems, see
.IR ncheck (1M).
.SH SEE ALSO
mkfs_xfs(1M),
ncheck(1M),
xfs_check(1M),
xfs(4).
