calmsacibis995/irix-6517-src/eoe/man/man1m/xfsinvutil.1m
.TH xfsinvutil 1M "August 04, 1997"
.SH NAME
xfsinvutil \- \&xfsdump inventory database checking and pruning utility
.SH SYNOPSIS
.nf
\f3xfsinvutil\f1 \c
[ \f3\-M\f1 mountpoint mm/dd/yyyy (prune all entries older than 
                specified date for the specified mount point) ] 
        [ \f3\-C\f1 (check and fix xfsdump inventory database \c
inconsistencies)] 
.fi
.SH DESCRIPTION
.I xfsdump 
maintains an online dump inventory in \f2/var/xfsdump/inventory\f1.
The
.B \-I
option of xfsdump displays the inventory contents hierarchically.
The levels of the hierarchy are:
filesystem,
dump session,
stream, and
media file.
.P
Over time, this database may grow too large as xfsdump and xfsrestore do
not remove entries from the inventory. The database may also develop
inconsistencies due to various reasons such as operator errors etc., 
causing xfsdump or xfsrestore to print error or warning messages.
.P
.I xfsinvutil 
is an utility to check this inventory database for consistency and
to remove entries of dump sessions which may no longer be of relevance.
.P
The following command line options are available:
.P
.TP 5
\f3\-M\f1 \f2mountpoint mm/dd/yyyy\f1
Specifies the mount point and cut-off date of inventory entries to
be selected for pruning.
xfsinvutil prompts the operator when a dump session in the inventory 
is identified by the mount point and was created prior to the specified
date.
The operator can then select specific dump sessions for removal from
the inventory database.
.I xfsinvutil 
also performs consistency checks on other inventory database entries when
invoked with this option. 
.TP 5
.B \-C
With this option, 
.I xfsinvutil 
performs consistency checks for all entries in the inventory database.
It fixes any problems found. If no consistent entries are found , the
corresponding inventory database file is removed.
.SH NOTES
.SS Inventory
Each dump session updates an inventory database in \f2/var/xfsdump/inventory\f1.
.I xfsdump
uses the inventory to determine the base of incremental
and resumed dumps.
.P
This database can be displayed by invoking
.I xfsdump
with the
.B \-I
option.
The display uses tabbed indentation to present the inventory
hierarchically.
The first level is filesystem.
The second level is session.
The third level is media stream (currently only one stream is supported).
The fourth level lists the media files sequentially composing the stream.
.SH FILES
.TP 25
/var/xfsdump/inventory
dump inventory database
.SH SEE ALSO
xfsdump(1M),
xfsrestore(1M).
