calmsacibis995/irix-6517-src/eoe/man/man1m/xlv_assemble.1m
.TH xlv_assemble 1M
.SH NAME
xlv_assemble \- initialize logical volume objects from disk labels
.SH SYNOPSIS
.nf
\f3xlv_assemble\f1 [ \f3\-h\f1 name ] [ \f3\-alfnq\f1 ] \c
[ \f3\-r\f1 root ] [ \f3\-s\f1 list ] [ \f3\-tvKP\f1 ]
.fi
.SH DESCRIPTION
.I xlv_assemble
scans all the disks attached to the local system for logical
volume labels.
It assembles all the available logical volumes
and generates a configuration data structure.
.I xlv_assemble
also creates the device nodes for all XLV volumes in
.I /dev/xlv
and
.IR /dev/rxlv .
The kernel is then activated with the newly created
configuration data structure.
If necessary,
.I xlv_assemble
also asks the
.IR xlv_plexd (1M)
daemon to perform any necessary plex revives.
.P
.I xlv_assemble
is automatically run on system startup from a script in the
.I /etc/init.d/xlv
directory.
By default, it is also automatically run after you
run
.IR xlv_make (1M).
.P
.I xlv_assemble
supports the following options:
.TP 10
.BI \-h " name"
Use
.I name
as the local nodename.
Every logical volume label contains a
system nodename.
See the
.B \-l
option below.
.IP
This option has no effect if 
.I name
is the local nodename.
.TP
.B \-a
Assemble all logical volumes.
See the
.B \-l
option below.
.TP
.B \-f
Do a full revive instead of an incremental revive.
A full revive means that all volumes that are not marked
.I clean
will be revived. The normal operation is an incremental revive.
In this case,
.I xlv_assemble
only revives those volumes that are not
.I clean
and that have not already been assembled.
.\"Normally after reading the xlv labels from the disks
.\"and creating the xlv configuration,
.\".I xlv_assemble
.\"queries the kernel for the volumes in the kernel.
.\"If a volume is already in the kernel,
.\".I xlv_assemble
.\"does not do state transition for that volume.
.\"So volume elements that are marked active stay active and a revive
.\"is not done for those volume elements. If the volume is not in the
.\"kernel and the volume element is mirrored, one of the volume element
.\"is chosen and marked 
.\".I active
.\"and the others are marked 
.\".I stale
.\"and revival is done on those stale volume elements.
.TP
.B \-l
Only assemble logical volumes that are owned by the
local system.
Local logical volumes have the local nodename
in their logical volume labels.
This is the default option.
.IP
When volumes are created via
.IR xlv_make (1M)
the local system nodename is recorded in the XLV disk label
in each disk's volume header (file named
.IR xlvlab ")."
When
.I xlv_assemble
runs and notices that the nodename in the XLV disk label does not
match the local nodename, the XLV device nodes that are created
have the nodename in the XLV disk label, followed by a dot, prepended
to the volume names.
.IP
Use the
.B \-h
option to change the local nodename for this instant of
.IR xlv_assemble .
.IP
Use
.IR xlv_mgr (1M)
command
.I "change nodename"
to change the nodename associated with the disk.
.TP
.B \-n
Scan all disks for logical volume labels, but don't save the logical
volume configuration and don't activate the kernel
with this configuration.
.TP
.B \-q
Proceed quietly and don't display status messages after putting together
the logical volume configuration.
.TP
.BI \-r " root"
Use
.I root
as the root directory.
This is used in the miniroot when / is mounted
as
.IR /root .
.TP
.BI \-s " list"
Selectively assemble the comma separated
.I list
of volume names.  This provides a means of incrementally assembling additional
configurations.  The logical volumes specifed in
.I list
are assembled regardless of whether or
not the labels contain a local system nodename.
.TP
.B \-t
Display terse status messages naming the logical volumes configured.
.TP
.B \-v
Display verbose status messages about the logical volumes configured.
.TP
.B \-K
Don't activate the kernel with this logical volume configuration.
.TP
.B \-P
Don't initiate plex revives on the logical volumes configured.
.PP
The default behavior of
.I xlv_assemble
can be changed with the environment variable
.BI XLV_ASSEMBLE_ARGS .
The environment variable is parsed before the command line options. 
.PP
.I xlv_assemble
changes volume element states. The volume element states are:
.TP 12
.B empty
The volume element has no user data. When a volume element
is initially created, it is in this state.
.TP
.B stale
The volume element had user data but the data is
now out-of-date. The volume element will be revived
from an active volume element. When
.I xlv_assemble
is initially invoked on a mirrored volume element,
one volume element is picked,
depending volume element state and timestamp,
to be the active volume element and the other
volume elements are marked
.IR stale .
A plex revival is initiated to make volume elements up-to-date.
.TP
.B active
The volume element is online and up-to-date.
.TP
.B clean
The volume element has been shutdown cleanly. All other volume
elements spanning this address space, if any, have identical data.
.TP
.B offline
The volume element was active but XLV encounter I/O errors
on this volume element so the volume element is changed to the
.I offline
state. No further I/O is performed on that volume element.
.TP
.B incomplete
The volume element is missing some disk parts.
.SH FILES
.nf
/dev/xlv/...
/dev/rxlv/...
/dev/dsk/xlv_root
/dev/rdsk/xlv_root
.fi
.SH SEE ALSO
xlv_labd(1M),
xlv_make(1M),
xlv_mgr(1M),
xlv_plexd(1M),
xlv_shutdown(1M),
xlvd(1M),
xlv(7M).
.SH NOTE
You must be root to run
.IR xlv_assemble .
