calmsacibis995/irix-6517-src/eoe/man/man1m/xlv_labd.1m
.TH xlv_labd 7M
.SH NAME
xlv_labd, xlv_plexd, xlvd \- logical volume daemons
.SH SYNOPSIS
.nf
\f3xlv_labd\f1
\f3xlv_plexd\f1 [ \f3\-m\f1 #_subprocs ] [ \f3\-b\f1 blocksize ] \c
[ \f3\-w\f1 sleep-interval ]
	[ \f3\-v\f1 verbosity ] [ \f3\-h\f1 ]
.fi
.SH DESCRIPTION
\f2xlv_labd\f1, \f2xlv_plexd\f1, and \f2xlvd\f1 are logical volume daemons.
\f2xlv_labd\f1 and \f2xlv_plexd\f1 reside in user process
space and \f2xlvd\f1 resides in kernel process space.
.P
The XLV label daemon,
\f2xlv_labd\f1,
is a user process that writes logical volume disk labels.
It is normally started during system restart.
Upon startup,
.I xlv_labd
immediately calls into the kernel to wait for an action
request from the kernel daemon,
.IR xlvd .
When an action request comes,
.I xlv_labd
processes it and updates the appropriate volume disk labels.
After completing the update,
.I xlv_labd
calls back into the kernel to wait for another request.
.P
The XLV plex copy daemon,
\f2xlv_plexd\f1,
is a user process responsible for making all plexes within a subvolume
consistent.
The master \f2xlv_plexd\f1 process
is started at system startup time with the \f3\-m\f1 option and subsequently
used when new plexes are added.
It receives requests to revive plexes via the named pipe
\f2/etc/.xlv_plexd_request_fifo\f1 and starts child processes to perform
the actual plex copy.
.TP 20
\f3\-m\f1 \f2#_subprocs\f1
\f2#_subprocs\f1 is the maximum number of subprocesses the master
\f2xlv_plexd\f1
process forks off at any given time.
.TP
\f3\-b\f1 \f2blocksize\f1
\f2blocksize\f1 is the granularity of a single plex copy operation in blocks.
The default is
128 blocks, which means XLV initiates a plex copy of 128 blocks, sleeps
as indicated by the \f3\-w\f1 option (see below),
then moves on to the next set of 128
blocks.
.TP
\f3\-w\f1 \f2sleep-interval\f1
\f2sleep-interval\f1 is an arbitrary delay enforced at regular intervals
while performing a plex copy
in order to share available disk bandwidth.
The default delay is 0.
.TP
\f3\-v\f1 \f2verbosity\f1
\f2verbosity\f1 is the level of verbosity.
The minimum is 0 and the maximum is 3.
\f2xlv_plexd\f1 writes its messages to syslog.
The default \f2verbosity\f1 is 2.
.TP
.B \-h
Print the help message.
.P
The XLV daemon,
\f2xlvd\f1,
is a kernel process that handles I/O to plexes and
performs plex error recovery.
When disk labels require updating,
.I xlvd
initiates an action request to
.I xlv_labd
to perform the disk label update.
If there aren't multiple plexes,
.I xlvd
does not do anything.
.SH NOTE
All three daemons are automatically started and do not need
to be explicitly invoked.
.SH FILES
.nf
/etc/.xlv_plexd_request_fifo
.fi
.SH SEE ALSO
xlv(7M).
