calmsacibis995/irix-6517-src/eoe/man/man1m/yp_bootparam.1m
.TH yp_bootparam 1M
.SH NAME
yp_bootparam \- update the NIS bootparams database
.SH SYNOPSIS
.nf
\f3yp_bootparam\f1 \f3\-h\f1 \f2host\f1 \f3\-a\f1 [ \f3\-b\f1 ] [ \f3\-k\f1 \c
\f2key_file\f1 ] \f3\-f\f1 \f2file\f1
\f3yp_bootparam\f1 \f3\-h\f1 \f2host\f1 \f3\-a\f1 [ \f3\-b\f1 ] [ \f3\-k\f1 \c
\f2key_file\f1 ] \f3params\f1
\f3yp_bootparam\f1 \f3\-h\f1 \f2host\f1 \f3\-d\f1 [ \f3\-b\f1 ] [ \f3\-k\f1 \c
\f2key_file\f1 ]
.fi
.SH DESCRIPTION
.I yp_bootparam
is the user interface tool to update the NIS
.IR bootparams (4)
database directly on
client workstation without
running on
ypmaster.
.I yp_bootparam
uses the
.IR ypupdated (1M)
service on ypmaster to update the bootparams database.
.P
User can either add an entry to database or delete an entry.
As long as the hostname is registered in the NIS
hosts database and the bootparam
entry does not exist, the user can always
add an entry to the bootparams database.
In this process, a security key can be requested on return.
When deleting an entry, the same key (if there is one) must be submitted in the
same command line.
Otherwise, the
request is rejected.
The update daemon on ypmaster stores the keys in
.IR /var/boot/keystore ,
while
.I yp_bootparam
saves the key in the file specified by the input parameter.
.SH OPTIONS
.IP "\f3\-h \f2host\f1" 1i
Use
.I host
as the key in bootparams database.
The
.I host
is checked against NIS hosts database unless
.B \-b
is specified.
If
.I host
is an alias, the real key found in hosts data
base is used instead.
.IP "\f3\-a\f1" 1i
Add an entry.
.IP "\f3\-d\f1" 1i
Remove an entry.
.IP "\f3\-b\f1" 1i
Use
.I host
as key without checking NIS hosts database.
.IP "\f3\-k \f2key_file\f1" 1i
When adding an entry, the
.I key_file
is used to save the returned key.
When deleting an entry,
it is used to pass the original key.
.IP "\f3\-f \f2file\f1" 1i
The
.I file
contains the data part in the bootparam entry.
It should have the following format:
.RS
.Ex
root=root_server:root_path
sbin=share_server:sbin_path
swap=root_server:swap_path
dump=root_server:dump_path
.Ee
The dump value is optional.
.RE
.IP "\f3params\f1" 1i
If
.B \-f
is not used, the boot parameters should be passed
at command level.
.SH EXAMPLE
.Ex
\f4yp_bootparam \-a \-h bonnie \-k /mykey
     root=clyde:/dl/client/bonnie sbin=clyde:/dl/share/sbin
     swap=clyde:/dl/swap/bonnie\f1
.Ee
Creates a bootparam entry in ypmaster.
The security key returned is
left in
.IR /mykey .
.SH NOTE
After using
.I yp_bootparam,
it takes a short time for the NIS bootparams database, as seen
by the client, to reflect the change.
.SH CAVEAT
.I yp_bootparam
does not communicate with non-SGI NIS masters.
.SH FILES
/var/yp/yp_bootparam
.br
/var/boot/keystore
.br
/usr/include/rpcsvc/ypclnt.h     error code listing
.SH SEE ALSO
updbootparam(1M),
ypupdated(1M),
bootparams(4).
