calmsacibis995/irix-6517-src/eoe/man/man1m/yp_host.1m
.TH yp_host 1M
.SH NAME
yp_host \- update NIS "hosts" database
.SH SYNOPSIS
.nf
\f3yp_host\f1 \f3\-r\f1 \f3\-h\f1 \f2host\f1 [ \f3\-n\f1 \f2net\f1 \c
[ \f3\-m\f1 \f2mask\f1 ] ] [ \f3\-a\f1 \f2aliases\f1 ]
\f3yp_host\f1 \f3\-c\f1 \f3\-h\f1 \f2host\f1 \f3\-w\f1 \f2newname\f1 [ \c
\f3\-a\f1 \f2aliases\f1 ]
\f3yp_host\f1 \f3\-d\f1 \f3\-h\f1 \f2host\f1
.fi
.SH DESCRIPTION
.I yp_host
is the user command to update the NIS \f2hosts\fP database directly from a
client workstation.
.I yp_host
uses the
.IR ypupdated (1M)
service on the NIS master to update the NIS \f2hosts\fP database.
The single-threaded nature of
.IR ypupdated (1M)
guarantees the database will remain consistent even when multiple updates
are attempted at the same time.
.P
Users can add, change, or delete an entry to the database.
As long as the hostname is not used in the current database,
there are no restrictions for creating an entry.
However, to modify or delete an entry, users are prompted for the
root password of the NIS master.
.SH OPTIONS
.IP "\f3\-c\f1" 13
Change an existing entry.
.IP "\f3\-d\f1"
Delete an entry.
.IP "\f3\-r\f1"
Register the hostname in the NIS \f2hosts\fP database.
.IP "\f3\-h \f2host\f1"
Use
.I host
as the key when updating the \f2hosts\fP database.
.IP "\f3\-n \f2net\f1"
Specifies the network that
.I host
will be on.
This parameter should follow the ``dot'' notation for Internet addresses
(see
.IR inet (3N)).
If
.B \-m
is used,
the
.I net
should be a four-byte Internet address.
If
.B \-m
is not used, the
.I net
should be an Internet network number.
.IP "\f3\-m \f2mask\f1"
Specifies the network mask, as described in
.IR ifconfig (1M).
This parameter, when logically-ANDed with
.IR net ,
represents the target Internet subnet number.
.IP "\f3\-a \f2aliases\f1"
Specifies the aliases of the new host.
Multiple aliases should be
surrounded with double-quote (") marks and separated with spaces.
.IP "\f3\-w \f2newname\f1"
Modifies the entry to use
.I newname
as the new key for the \f2hosts\fP database.
.SH EXAMPLE
.Ex
yp_host -a -h bonnie -n 192.26.88 -a "jake clyde"
.Ee
Creates an entry on the NIS master for bonnie.
The network that the new IP
address will be using is "192.26.88".
.Ex
yp_host -a -h bonnie -n 192.26.88.200 -m 0xffffffc0  -a "jake clyde"
.Ee
The subnet that the new IP address will be on is "192.26.88.192".
.SH FILES
/etc/hosts
.br
/var/yp/yp_host
.br
/usr/include/rpcsvc/ypclnt.h     error code listing
.SH SEE ALSO
registrar(1M),
ypupdated(1M).
