calmsacibis995/irix-6517-src/eoe/man/man1m/ypinit.1m
.TH ypinit 1M
.SH NAME
ypinit \- build and install NIS database
.SH SYNOPSIS
.nf
\f3/var/yp/ypinit\f1 \f3\-m [-y] [-d domainname] [-f source_dir] [-l slave[,slave]]\f1
\f3/var/yp/ypinit\f1 \f3\-s\f1 master_name \f3[-y] [-d domainname]\f1
\f3/var/yp/ypinit\f1 \f3\-c [-d domainname]\f1
.fi
.SH DESCRIPTION
.I ypinit
sets up network information service (NIS) on a system.
It can be used to set up a client or a master or slave server.
You must be the superuser to run it.
It asks a few self-explanatory questions,
and reports success or failure to the terminal.
.LP
It sets up a master server
using the simple model in which that server
is master to all maps in the data base.
This is the way to bootstrap the NIS system;
later if you want, you can change the association of maps to masters.
All databases are built from scratch,
either from information available to the program at runtime,
or from the ASCII data base files in
.IR /etc .
The location may be overridden using the \f3-f\f1 argument.
These files are listed below under
.BR FILES .
All such files should be in their "traditional" form,
rather than the abbreviated form used on client machines.
.LP
An NIS database on a slave server is set up by copying
an existing database from a running server.  The
.I master_name
argument should be the hostname of the NIS master server.
.LP
Refer to \f2ypfiles\f1(4) and \f2ypserv\f1(1M) for an overview of NIS.
.SH OPTIONS
.TP
.B \-c
Sets up a client.
.TP
.B \-m
Indicates that the local host is to be the NIS master.
.TP
.B \-s master
Set up a slave database, copying the database files from master.
.TP
.B \-d domain
Setup database for the given domain.  If not given it uses the currently
set domainname.
.TP
.B \-f source_dir
Allows the location of the source files to be overridden.  This is only for
ypinit, to permanently set this value edit the file
\f3/etc/options/ypmaster.options\f1.  See ypmake(1) for details.
.TP
.B \-l slave1,slave2,...
Allows the list of slave servers to be given on the command line as a comma
separated list of names.  If not given on the command line you will be prompted
for this list.
.TP
.B \-y
Remove any previously existing database.  If not given you will be prompted
if a database directory already exists.
.SH FILES
.nf
/etc/aliases
/etc/bootparams
/etc/capability
/etc/clearance
/etc/ethers
/etc/group
/etc/hosts
/etc/mac
/etc/netgroup
/etc/networks
/etc/passwd
/etc/protocols
/etc/rpc
/etc/services
.fi
.SH SEE ALSO
makemdbm(1M),
ypmake(1M),
yppush(1M),
ypserv(1M),
ypxfr(1M),
ypfiles(4).
