calmsacibis995/irix-6517-src/eoe/man/man1m/ypmake.1m
.TH ypmake 1M
.SH NAME
ypmake \- rebuild and distribute NIS databases
.SH SYNOPSIS
.nf
\f3/var/yp/ypmake\f1 [ [ \f2make-options\f1 ] \f2map\f1 ]
.fi
.SH DESCRIPTION
On NIS master machines,
.I ypmake
uses the file
.I /var/yp/mdbm_parse
and the optional file
.I /var/yp/local.make.script
to build the network information service (NIS) databases.
With no arguments,
.I ypmake
creates
.IR mdbm (3B)
databases for any NIS maps that are out-of-date
and then executes
.IR yppush (1M)
to notify slave servers that there has been a change.
.LP
If invoked with
.IR map ,
.I ypmake
updates that map only.
Typing
.B "ypmake passwd"
creates and
.IR yppush es
the password database (assuming it is out-of-date).
Likewise,
.B "ypmake hosts"
and
.B "ypmake networks"
create
databases from the host and network files,
.I /etc/hosts
and
.IR /etc/networks ,
and
.I yppush
the databases to the slave servers.
With the
.B \-u
option,
.I ypmake
always creates the map.
.LP
.IR cron (1M)
executes
.I ypmake
at regular intervals in order to maintain consistency between
NIS servers' databases.
Once a day,
.I ypmake
moves the log file
.I /var/yp/ypmake.log
to
.I /var/yp/ypmake.log.old
to keep it from growing too large.
.LP
.I ypmake
reads the file
.I /etc/config/ypmaster.options
so that users can specify arguments to mdbm_parse.
.TP
.B DIR
The directory of the source files.
(Default is
.IR /etc .)
.TP
.B DOM
Used to construct a domain other than
the master's default domain.
.TP
.B NOPUSH
When non-null, inhibits doing a
.I yppush
of the new database files.
(Default is the null string.)
.TP
.B PWFILE
full pathname of the password file used to build the
passwd database.
(Default is
.IR /etc/passwd .)
.LP
For instance, to change the location of the password
file used by
.I ypmake
to
.IR /etc/passwd.yp ,
include:
.Ex
PWFILE=/etc/passwd.yp
.Ee
in
.IR /etc/config/ypmaster.options .
The variables can also be specified as arguments on the
.I ypmake
command line.
.LP
To have local NIS maps updated by
.IR ypmake ,
create the file
.I /var/yp/local.make.script
and add rules similar to the ones in
.IR mdbm_parse .
.LP
Refer to \f2ypfiles\f1(4) and \f2ypserv\f1(1M)
for an overview of NIS.
.SH EXAMPLES
To create and push the
.I hosts
map only it's out-of-date:
.Ex
\f4ypmake hosts\f1
.Ee
To always create and push the
.I hosts
and
.I passwd
map:
.Ex
\f4ypmake -u hosts passwd\f1
.Ee
To always create but not push the
.I aliases
map:
.Ex
\f4ypmake -u NOPUSH=1 aliases\f1
.Ee
.SH "FILES"
/var/yp/make.script
.br
/var/yp/local.make.script
.br
/var/yp/mdbm_parse
.br
/var/yp/ypmake.log
.br
/var/yp/ypmake.log.old
.SH SEE ALSO
cron(1M),
make(1),
makemdbm(1M),
ypserv(1M).
.SH NOTE
The mdbm_parse script supports building a database for the shadow
passwords, but this database is not built by default.  Ypmake must
be explicitely called with a shadow map name argument.

If support for new databases are added a line must be added to the
file \fB/var/ns/domains/DOMAIN/nsswitch.conf\fP for the NIS domain
in question for the server to allow queries to the map.
