calmsacibis995/irix-6517-src/eoe/man/man1m/yppush.1m
.TH yppush 1M
.SH NAME
yppush \- force propagation of a changed NIS map
.SH SYNOPSIS
.nf
\f3yppush\f1 [ \f3\-d\f1 \f2domain\f1 ] [ \f3\-v\f1 ] \f2mapname\f1
.fi
.SH DESCRIPTION
.I yppush
copies a new version of the specified NIS
map from the master NIS server to the
slave NIS servers.
It is normally run only on the master server by
.IR ypmake (1M)
after the master databases are changed.
It first constructs a list of NIS server hosts by reading the
\f2ypservers\f1 map within the
.IR domain .
Keys within the
.I ypservers
map
are the hostnames of the domain's NIS servers.
.LP
A ``transfer map'' request is sent to the NIS server at each host,
along with the information needed by the transfer agent (the program
which actually moves the map) to call back the
.IR yppush .
When the
attempt has completed (successfully or not), and the transfer agent has sent
.I yppush
a status message, the results may be printed to stdout.
Messages
are also printed when a transfer is not possible; for
instance when the request message is undeliverable, or when the timeout period
on responses has expired.
.LP
Refer to \f2ypfiles\f1(4) and \f2ypserv\f1(1M) for an overview of NIS.
.SH OPTIONS
.TP 12
.B \-d \f2domain\f1
Specify a
.IR domain .
.TP
.B \-v
Verbose.
This causes messages to be printed when each server is called, and for
each response.
If this flag is omitted, only error messages are printed.
.SH FILES
/var/ns/domain/\f2domain\f1/ypservers.m
.SH SEE ALSO
ypserv(1M),
ypxfr(1M),
ypfiles(4).
.SH BUGS
In the current implementation (version 2 NIS protocol), the transfer agent is
\f2ypxfr\f1,
which is started by the
.I ypserv
program.
If
.I yppush
detects that it is speaking to a version 1 NIS protocol
server, it uses the older protocol, sending a version 1 YPPROC_GET
request and issues a message to that effect.
Unfortunately, there is no way of knowing
if or when the map transfer is performed for version 1 servers.
.I yppush
prints a message saying that an "old-style" message has been sent.
The system administrator should later check to see that the
transfer has actually taken place.
