calmsacibis995/irix-6517-src/eoe/man/man1m/ypset.1m
.TH ypset 1M
.SH NAME
ypset \- point ypbind at a particular NIS server
.SH SYNOPSIS
.nf
\f3ypset\f1 [ \f3\-V1\f1|\f3\-V2\f1 ] [ \f3\-h\f1 \f2host\f1 ] \c
[ \f3\-d\f1 \f2domain\f1 ] \f2server\f1
.fi
.SH DESCRIPTION
.I ypset
tells
.IR ypbind (1M)
to get the network information service (NIS) for the specified
.I domain
from the
.I ypserv
process running on
.IR server .
If
.I server
is down, or isn't running
.IR ypserv ,
this is not discovered until an NIS client process tries to
get a binding for the domain.
At this point, the binding set by
.I ypset
will be tested by
.IR ypbind .
If
the binding is invalid,
.I ypbind
attempts to rebind for the same domain.
.LP
By default,
.I ypbind
does not allow
.I ypset
operations from local or remote hosts.
.I ypset
returns the error message
.Ex
ypset: Sorry, I couldn't send my RPC message to ypbind on host \f2nisserver\fP
.Ee
when
.I ypbind
rejects the attempt.
.LP
.I ypset
is useful for binding a client node that is not on a broadcast net
or is on a broadcast net that isn't running an NIS server host.
It also is useful for debugging NIS client applications, for instance
where an NIS map only exists at a single NIS server host.
.LP
In cases where several hosts on the local net are supplying NIS services, it
is possible for
.I ypbind
to rebind to another host even while you attempt to
find out if the
.I ypset
operation succeeded.
That is, you can type
\f4ypset host1; ypwhich\f1 and get the response \f2host2\f1, which
can be confusing.
This is a function of the NIS subsystem's attempt to
load-balance among the available NIS servers
It occurs when
.I host1
does not respond to
.I ypbind
because it is not running
.I ypserv
(or is overloaded) and
.IR host2 ,
running
.IR ypserv ,
gets the binding.
.LP
.I server
indicates the NIS server to bind to and
can be specified
as a name or an IP address.
If specified as a name,
.I ypset
attempt to use NIS services to resolve the name to an IP address.
This works only if
the node has a current valid binding for the domain in question.
In most cases,
.I server
should be specified as an IP address.
.LP
Refer to \f2ypfiles\f1(4) and \f2ypserv\f1(1M) for an overview of NIS.
.SH OPTIONS
.IP "\f3\-V1\f1" 12
Bind
.I server
for the (old) v.1 NIS protocol.
.IP "\f3\-V2\f1"
Bind
.I server
for the (current) v.2 NIS protocol.
.IP
If no version is supplied,
.IR ypset ,
first attempts to set the domain for the (current) v.2 protocol.
If this attempt fails,
.IR ypset ,
attempts to set the domain for the (old) v.1 protocol.
.IP "\f3\-h \f2host\f1"
Set
.IR ypbind 's
binding on
.IR host ,
instead of locally.
.I host
can be specified as a name or as an Internet address.
.IP "\f3\-d \f2domain\f1"
Use
.I domain
instead of the default domain.
.SH SEE ALSO
ypserv(1M),
ypwhich(1),
ypfiles(4).
