calmsacibis995/irix-6517-src/eoe/man/man1m/ypxfr.1m
.\" @(#)ypxfr.8 1.1 85/12/28 SMI;
.TH ypxfr 1M
.SH NAME
ypxfr \- transfer an NIS map from some NIS server to here
.SH SYNOPSIS
.nf
\f3ypxfr\f1 [ \f3\-f\f1 ] [ \f3\-h \f2host\f1 ] [ \f3\-d \f2domain\f1 ] \c
[ \f3\-c\f1 ] [ \f3\-C\f1 \f2tid prog ipadd port\f1 ]
	\f2mapname\f1
.fi
.SH DESCRIPTION
.I ypxfr
moves a network information service (NIS)
map to the local host by making use of normal NIS services.
It creates a temporary map in the directory
/var/ns/domain/\f2domain\f1 (which must already exist),
fills it by enumerating the map's entries, fetches the
map parameters (master and order number) and loads them.
It then deletes any old versions of the map and moves the
temporary map to the real mapname.
.LP
If
.I ypxfr
is run interactively, it writes its output to the terminal.
However, if it is invoked without a controlling terminal, and if the
log file
.I /var/yp/ypxfr.log
exists, it appends all its output to that file.
Since
.I ypxfr
is run from
.IR /usr/spool/cron/crontabs/root ,
or by
.IR ypserv ,
you can use the log file to retain a record of what was attempted
and what the results were.
.LP
For consistency between servers,
.I ypxfr
should be run periodically for every map in the NIS data base.
Different maps change at different
rates:  the
.I services.byname
map may not change for months at a time, for instance, and may
therefore be checked only once a day in the wee hours.
You may know
that
.I mail.aliases
or
.I hosts.byname
changes several times per day.
In such a case, you may want to
check hourly for updates.
A
.I crontab
entry can be used to perform periodic updates automatically (see
.IR cron (1M)).
Rather than having a separate
.I crontab
entry for each map, you can group commands to update several maps
in a shell script.
Examples are in
.IR /var/yp :
.I ypxfr_1pd.sh
(transfer once per day),
.I ypxfr_2pd.sh
(transfer twice per day),
and
.I ypxfr_1phr.sh
(transfer once per hour).
They can serve as reasonable first cuts.
.LP
Refer to \f2ypfiles\f1(4) and \f2ypserv\f1(1M) for an overview of NIS.
.SH OPTIONS
.IP "\f3\-f\f1" 10
Force the transfer to occur even if the version at the master is not
more recent than the local version.
.IP "\f3\-c\f1"
Don't send a "Clear current map" request to the local
.I ypserv
process.
Use this flag if
.I ypserv
is not running locally at the time you are running
.IR ypxfr .
Otherwise,
.I ypxfr
complains that it can't talk to the local
.IR ypserv ,
and the transfer fails.
.IP "\f3\-h \f2host\f1"
Get the map from \f2host\f1, regardless of what the map says the master is.
If \f2host\f1 is not specified, \f2ypxfr\f1 asks the
NIS service for the name of the master, and tries to get the
map from there.
.I host
may be a name or an Internet address in the form
.I "a.b.c.d"
(see
.IR inet (3N)).
.IP "\f3\-d \f2domain\f1"
Specify a domain other than the default domain.
.IP "\f3\-C \f2tid prog ipadd port\f1"
This option is
.B only
for use by
.IR ypserv .
When
.I ypserv
invokes
.IR ypxfr ,
it specifies that
.I ypxfr
should call back a
.I yppush
process at the host with Internet address
.IR ipaddr ,
registered as program number
.IR prog ,
listening on port
.IR port ,
and waiting for a response to transaction
.IR tid .
.SH FILES
/var/yp/ypxfr.log
.br
/var/yp/ypxfr_1pd.sh
.br
/var/yp/ypxfr_2pd.sh
.br
/var/yp/ypxfr_1ph.sh
.br
/usr/spool/cron/crontabs/root
.SH SEE ALSO
yppush(1M),
ypserv(1M),
ypfiles(4).
