calmsacibis995/irix-6517-src/eoe/man/man4/aliases.4
'\"macro stdmacro
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)aliases.5	6.1 (Berkeley) 5/15/85
.\"
.if n .pH man4.aliases @(#)aliases	30.3 of 2/1/86
.TH ALIASES 4
.UC 4
.SH NAME
aliases \- aliases file for sendmail
.SH SYNOPSIS
.B /etc/aliases
.SH DESCRIPTION
This file describes user id aliases used by
.I /usr/lib/sendmail.
It is formatted as a series of lines of the form
.LP
.in +0.5i
name: name_1, name2, name_3, . . .
.in
.LP
The
.I name
is the name to alias, and the
.I name_n
are the aliases for that name.
Lines beginning with white space are continuation lines.
Lines beginning with `\|#\|' are comments.
.PP
Aliasing occurs only on local names.
Loops can not occur, since no message will be sent to any person more than once.
.LP
After aliasing has been done, local and valid recipients who have a
``.forward'' file in their home directory have messages forwarded to the
list of users defined in that file.
.PP
This is only the raw data file; the actual aliasing information is
placed into a binary format in the files
.I /etc/aliases.dir
and
.I /etc/aliases.pag
using the program
.IR newaliases (1).
A
.I newaliases
command should be executed each time the aliases file is changed for the
change to take effect.
.SH "INCLUSION"
.LP
Inclusion is specified in RFC733 syntax:
.LP
.in +0.5i
:include: \fIpathname\fP
.in
.LP
An address of this form reads the file specified by
.I pathname
and sends to all users listed in that file.
.LP
For example, an alias of the form:
.LP
.in +0.5i
project: :include:/usr/project/userlist
.in
.LP
is a method of letting a project maintain a mailing list
without interaction with the system administration,
even if the alias file is protected.
.LP
It is not necessary to rebuild the binary alias database (via the
.IR newaliases (1)
program described above)
when the contents of an :include: list is changed.  (You will, however,
have to rebuild the binary alias database if the
.I pathname
changes.)
.SH SEE ALSO
newaliases(1), sendmail(1M)
.SH BUGS
Because of restrictions in
.IR dbm (3B)
a single alias cannot contain more than about 1000 bytes of information.
The best solution is to use a include file as described above. 
You can also get longer aliases by ``chaining''; that is, make the last
name in the alias be a dummy name which is a continuation alias.
'\".so /pubs/tools/origin.bsd
