calmsacibis995/irix-6517-src/eoe/man/man4/autologin.4
'\"macro stdmacro
.TH AUTOLOGIN 4
.SH NAME
autologin \- set autologin user identity 
.SH SYNOPSIS
.B /etc/autologin
.P
.B /etc/autologin.TTYLINE
.SH DESCRIPTION
.B /etc/autologin
is an ASCII file 
containing the login user name to be used when autologin is enabled.
The file is used by
.B xdm(1)
and
.B clogin(1)
when automatically initiating a terminal session on the graphics console.
.P
.B /etc/autologin.TTYLINE
is like
.B /etc/autologin
except it is used by
.B getty(1m)
when initiating a terminal session for the device named by TTYLINE.
For example
.B /etc/autologin.ttyd1
will control the login processes on /dev/ttyd1.
.SH NOTES
Autologin is controlled by the existence of the /etc/autologin.on
file.  The file is normally created at boot time to automate the login
process and then removed by xdm or clogin to disable the autologin
process for succeeding terminal sessions.
.SH FILES
/etc/autologin,
/etc/autologin.on,
/etc/autologin.TTYLINE.
.SH "SEE ALSO"
clogin(1),
xdm(1),
getty(1m).
'\".so /pubs/tools/origin.sgi
