calmsacibis995/irix-6517-src/eoe/man/man4/cachefs.4
'\"macro stdmacro
'\" t
.TH cachefs 4
.SH NAME
cachefs \- Cache File System Description
.SH DESCRIPTION
.B Cachefs
is a file system layered above other standard IRIX file systems.  It
performs automatic local caching of data from one file system (typically
remote) on a local file system.
Any of the following file systems may be used for the cached data:
.I xfs
and
.IR efs .
Any of the following file systems may be used as the source of data
to be cached:
.IR nfs ,
.IR nfs3 ,
.IR iso9660 ,
.IR cdfs ,
.IR hfs ,
.IR kfs ,
and
.IR dos .
.P
Data is cached when it is first accessed.  Subsequent accesses will retrieve
the data from the cache.  Consistency will be maintained
in a manner similar to that used for NFS.
.SH TERMINOLOGY
.RS 0i
.IP "\f3front file system\f1"
This is the local file system on which cached data is stored.
.IP "\f3back file system\f1"
This is the file system which contains the definitive copy of the data.
Data is retrieved from this file system and cached on the front file
system.
.IP \f3cnode\f1
This is the internal data structure used by
.B cachefs
to manage its files.  There is one
.I cnode
for each open file.  Each
.I cnode
occupies 128 bytes on a 32 bit system and 256 bytes on a 64 bit system.
In addition, each
.I cnode
points to a dynamically allocated area of 512 bytes containing metadata
and attributes.
.RE
.SH TUNING
.B Cachefs
has a number of different tuning parameters, some of which are supplied
on the
.IR mount (1M)
command (see
.IR fstab (4)),
some of which are supplied via
.IR cfsadmin (1M),
and some of which are kernel tuanbles adjustable with
.IR systune (1M).
.P
The kernel tunables are adjustable on a running kernel and control
readahead, asynchronous operations, and
.I cnode
caching.  The kernel tunables are described below.
.RS .25i
.IP \f3cachefs_readahead\f1
This controls the number of blocks to read ahead of the
current block being read.  These will be read asynchronously.
The size of a block is whatever the preferred I/O size is for the
front file system.
.IP \f3cachefs_max_threads\f1
This is the maximum number of asynchronous I/O daemons allowed to be
running per
.B cachefs
mounted file system.
.IP \f3fileheader_cache_size\f1
This is the size in 512-byte units of the in-memory cache of file header
information (cached attributes and other metadata).  This number
indicates the number of such headers retained after other system
internal data (e.g., the vnode) for a file has been released.
.IP \f3replacement_timeout\f1
This controls the time between reconstructions of the replacement list
by the replacement daemon (cachefs_replacement).  If no replacement
requests are made by the kernel within this time limit, the daemon
will time out and reconstruct the list.
.SH CONFIGURATION FILES
Mounts of cachefs file systems performed at system startup use options
supplied in
.I /etc/config/cachefs.options.
This file may contain any options for
.IR mount (1M)
desired.  Of particular interest is the "-m" option.  This option
allows the administrator to limit the number of parallel mount
processes mounting cachefs file systems.  This will be required on
systems where some cachefs file systems fail to mount due to a lack
of swap space.
.RE
.SH LIMITATIONS
Mandatory file locking is not supported on
.BR cachefs .
.SH SEE ALSO
.IR cfsadmin (1M),
.IR fstab (4),
.IR systune (1M),
.IR mount (1M)
