calmsacibis995/irix-6517-src/eoe/man/man4/exports.4
.TH exports 4
.SH NAME
exports \- list of NFS filesystems being exported
.SH SYNOPSIS
.nf
\f3/etc/exports\f1
.fi
.SH DESCRIPTION
The file
.I /etc/exports
describes the filesystems that are being exported to NFS
clients.
It is created by the system administrator
using a text editor
It is processed by
.IR exportfs (1M)
at system startup and by the
mount
request daemon,
.IR mountd (1M),
each time a mount request is received.
.I exportfs
should be re-executed after making changes to the file.
.PP
The file consists of a list of filesystems, the
.IR netgroup (4)
or machine names allowed to remote mount each filesystem and possibly
a list of options.
The filesystem names are left justified and followed by
a list of names separated by white space.
The names are looked up in
.I /etc/netgroup
and then in
.IR /etc/hosts .
A hyphen indicates the start of the options list.
Multiple options are separated by commas.
The default options are
.BR rw,anon=nobody .
.TP 10
.B ro
Export the directory read-only.
If not specified, the directory
is exported read-write.
.TP
\f3rw=\fP\f2hostname\f1[\f3:\f2hostname\f1]...
Export the directory read-mostly.
Read-mostly means exported read-only to most
machines, but read-write to those specified.
If no hosts are
specified, the directory is exported read-write to all.
.TP
.BI anon=\fP uid
If a request comes from a host for uid 0 (typically ``root'') or from a
host using null authentication, use
.I uid
as the
effective user
ID.
.I uid
can be either a name or an integer user ID from
.IR /etc/passwd .
The default value for this option is ``nobody'' (uid \-2).
Because uid 0 permits access to files regardless of permission and ownership,
NFS
servers change uid 0 to the anonymous uid by default.
Use the \f3root\fP option to permit accesses from hosts using uid 0.
Setting the value of \f2uid\fP to \-1 disables accesses from
unknown users or from root on hosts not included in the \f3root\fP option.
.TP
\f3root=\fP\f2hostname\f1[\f3:\f2hostname\f1]...
Give root access only to the root (uid 0) users from a specified
.IR hostname .
The default is for no hosts to be granted root access.
.TP
\f3access=\fP\f2client\f1[\f3:\f2client\f1]...
Give mount access to each
.I client
listed.
A
.I client
can either be a hostname, or a netgroup (see
.IR netgroup (4)).
Each
.I client
in the list is first checked for in the
.I /etc/netgroup
database and then in the
.I /etc/hosts
database.
The default value allows any
machine to mount the given directory.
.TP
.B nohide
Allows a client who mounts this entry's parent filesystem
to access files in this filesystem.
This is ``off'' by default,
preventing a client who mounts this entry's parent filesystem
from accessing files in this filesystem.
Clients who mount a
filesystem containing a hidden filesystem access the directory
on which the hidden child is mounted, not the child filesystem's
root directory.  Be aware that using this option introduces a
violation of RFC 1094, RFC 1813, and the XNFS specification.
Using this option may cause the server not to interoperate
properly with non-IRIX clients, particularly Linux clients.
.TP
.B wsync
Causes all writes to this filesystem to be performed synchronously.
With this option, the server waits until written data is safely stored on
a magnetic disk or other non-volatile medium before sending a positive
response to the client.
Without this option, the server performs delayed writes (it
responds positively to the client, then writes the data at its convenience
or when a
.IR sync (2)
is executed).
Delaying writes provides a great performance boost,
but also introduces the risk of losing data if the server crashes
after the response but before the data is stored.
Use the
.B wsync
option if this risk is unacceptable.
.TP
.B 32bitclients
Causes the server to mask off the high order 32 bits of directory cookies in
NFS version 3 directory operations.
This option may be required when clients run 32-bit operating systems that
assume the entire cookie is contained in 32 bits and reject responses
containing version 3 cookies with high bits on.
IRIX 5.3 and Solaris 2.5 are examples of 32-bit operating systems with
this behavior, which produces error messages like "Cannot decode response" on
directory operations.
XFS filesystems on the server can generate cookies with high bits on.
Exporting filesystems with the \f332bitclients\f1 option causes these
bits to be masked and prevents error messages.
.LP
A filesystem name that is not followed by a name list is exported to everyone.
A ``#'' anywhere in the file indicates a comment extending to the end
of the line on which it appears.
A backslash ``\\'' at the end of a line permits splitting long lines
into shorter ones.  When splitting the options across multiple lines,
the character immediately preceeding the backslash must be one of
``-'', ``='', ``:'', or ``,''.  Also, no whitespace may follow the
backslash nor proceed the first character of the next line.
.SH EXAMPLES
.Ex
/usr/local			# export to the world
/usr		clients		# export to my clients
/usr2	bonnie clyde	# export to only these machines
/usr3	\-anon=guest	# map client root & anonymous to guest
/		\-ro			# export the root filesystem
/usr		\-ro,nohide	# export all local filesystems read-only
/d/local/src	\e
		\-rw,anon=guest,root=bonnie	# multi-line example
.Ee
Exporting all your machine's local filesystems requires enumerating
all local mount points and using \f3nohide\fP for filesystem other
than root:
.Ex
/		\-ro
/usr		\-ro,nohide
/d		\-ro,nohide
.Ee
.SH NOTE
The \f3nohide\f1 and \f3wsync\f1 options are specific to IRIX.
.SH FILES
/etc/exports
.SH SEE ALSO
exportfs(1M),
mountd(1M),
showmount(1M),
netgroup(4),
passwd(4).
.SH WARNINGS
You cannot export a directory that is either
a parent- or a sub-directory
of one that is currently exported and
within the same filesystem.
It would be illegal, for example, to export
both
\f2/usr\fP and
.I /usr/local
if both directories resided in the
same disk partition.
.PP
While there is no hard-coded maximum length, extremely long export
lists (hundreds of hosts or netgroups for a single exported directory)
may cause mount requests for that exported directory to time out.

