calmsacibis995/irix-6517-src/eoe/man/man4/filesystems.4
.TH filesystems 4
.SH NAME
.upperok
filesystems: cdfs, dos, fat, EFS, hfs, mac, iso9660, cd-rom,
kfs, nfs, XFS, rockridge \- \&IRIX filesystem types
.SH DESCRIPTION
IRIX supports a number of different filesystems.
Some of these
types are names that can be used with the
.IR mount (1)
command's
.B \-t
option.
Others are just common names and cannot be used
with the
.I mount
command.
An example of this is the
.B RockRidge
type, which is a superset of the
.B iso9660
filesystem type.
Therefore
.B RockRidge
filesystems are mounted with a command similar to this:
.Ex
mount -t iso9660 -o ro /dev/rdsk/dks0d3vol /CDROM
.Ee
The following filesystem types are supported:
.TP 12
.B bds
Not a file system type, an 
extension to NFS for bulk data transfers.
The BDSpro server is an optional product and must be
purchased separately.
.TP
.BR cdfs " (CD-ROM)"
Same as type iso9660 (see below); this is the ABI compliant name.
.TP 12
.BR dos " (fat)"
The filesystem used by many personal computers.  Types 1, 4, and 6
are supported, included long names where supported.  Type 5 (extended
partitions) are supported only if mounted with the \f3partition #\fP
options.
IRIX
support for
.B dos
filesystems is restricted to removable disk devices
such as floppy and floptical disks.
Filenames on
.B dos
filesystems
are restricted to up to an eight character name followed by
an optional period and three character filename extension, for
most types.  Longer names are supported to a limited degree,
on the types where the native OS supports them.
.TP 12
.B EFS
The older extent-based disk filesystem used by IRIX
for disks and also for IRIX software distribution CD-ROMs.
See
.IR efs (4)
for more details.
.TP 12
.B fd
A filesystem used to access process file descriptors.
.TP 12
.BR hfs " (mac)"
The filesystem used by Macintosh computers.
IRIX support for
.B hfs
filesystems is restricted to removable disk devices such as floppy and
floptical disks and to CD-ROMs.
A
.B hfs
file is composed of three portions:
a data fork, a resource fork, and
a desktop information entry.
The data fork appears in a
normal directory.
The resource fork in a special directory
.RI ( .HSResource )
in the file's directory.
The desktop information
for all files in a directory is contained in the special file
.IR .HSancillary .
.TP 12
.BR iso9660 " (CD-ROM)"
A CD-ROM filesystem type conforming to ISO standard 9660.
.B iso9660
CD-ROMs are used when the contents of the CD-ROM is intended to be readable
by a variety of operating systems.
You must install the optional subsystem
.I eoe.sw.cdrom
to be able to mount and read an iso9660 CD-ROM.
Also see
.B RockRidge
below.
Note that IRIX software distribution CD-ROMs are not
.B iso9660
filesystems, they are
.B efs
filesystems.
Music CDs are not file structured and are not used as filesystems.
Music CDs can be played using the CD-ROM drive using
.IR cdman (1)
or
.IR cdplayer (1).
.TP 12
.B kfs
A network filesystem used to access disks on located on remote
computers using AppleShare networking.
Generally,
AppleShare networking is used to access Macintosh computers.
Except for the disk location,
.B kfs
filesystems are identical to
.B hfs
filesystems.
.TP 12
.B nfs
A network filesystem used to access disks located on
remote computers.
Both NFS Version 2, and NFS Version 3 are
supported.
NFS is an optional product and must be purchased
separately.
The subsystem
.I nfs.sw.nfs
must be installed to use NFS.
.TP 12
.B proc
A filesystem that provides access to the image of each active process
in the system.
.TP 12
.B hwgfs
A filesystem that provides access to the system hardware configuration.
.TP 12
.B RockRidge
A filesystem layered on type of the
.B iso9660
filesystem type (see above) that provides semantics closer to those
of standard UNIX filesystems.
In particular, it supplies file
permissions and allows for directory hierarchies more than 8 levels
deep.
.TP 12
.B XFS
The next-generation 64-bit high performance journaling
filesystem used by IRIX for disks.
See
.IR xfs (4)
for more details.
.TP 12
.B cachefs
A caching filesystem for use with
.BR efs ,
.BR xfs ,
.BR nfs ,
.BR nfs3 ,
.BR iso9660 ,
.BR hfs ,
.BR dos ,
.BR kfs ,
and
.BR cdfs .
See
.IR cachefs (4)
for details.
.SH NOTE
The
.B nfs
and
.B kfs
filesystems are optional products.
Support for
.B iso9660
filesystems is in the optional subsystem
.IR eoe.sw.cdrom .
.P
IRIX implements
.BR dos ,
.BR hfs ,
.BR iso9660 ,
and
.B kfs
filesystems as user mode NFS daemons.
In some cases errors detected by these
daemons are reported as NFS errors.
Although NFS
is a product option, support for these filesystem types is not dependent on
the installation of NFS.
.SH SEE ALSO
exportfs(1M),
fpck(1M),
fsck(1M),
mediad(1M),
mkfp(1M),
mkfs(1M),
mount(1M),
mount_kfs(1M),
efs(4),
fd(4),
fstab(4),
hwgfs(4),
proc(4),
xfs(4).
