calmsacibis995/irix-6517-src/eoe/man/man4/fstab.4
.TH fstab 4
.SH NAME
fstab \- static information about filesystems
.SH DESCRIPTION
The file
.I /etc/fstab
describes the filesystems
and swapping partitions
used by the local machine.
The system administrator can modify it with a text editor.
It is read by commands that mount, unmount,
and check the consistency of filesystems.
The file consists of a number of lines of the form:
.Ex
\f2filesystem\ \ directory\ \ type\ \ options\ \ frequency\ \ pass\f1
.Ee
For example:
.Ex
/dev/root\ \ \ /\ \ \ xfs\ \ \ rw\ \ 0 0
.Ee
Fields are separated by white space;
a `#' as the first non-white space character indicates a comment.
.PP
The entries from this file are accessed using the routines in
.IR getmntent (3),
which return a structure of the following form:
.Ex
struct mntent {
	char    *mnt_fsname;    /* filesystem name */
	char    *mnt_dir;       /* filesystem path prefix */
	char    *mnt_type;      /* e.g. xfs, nfs, proc, or ignore */
	char    *mnt_opts;      /* rw, ro, hard, soft, etc. */
	int     mnt_freq;       /* dump frequency, in days */
	int     mnt_passno;     /* parallel fsck pass number */
};
.Ee
This structure is defined in the
.I <mntent.h>
include file.
To compile and link a program that calls
.IR getmntent (3),
follow the procedures for section (3Y) routines as
described in
.IR intro (3).
.PP
The
.I mnt_dir
field is the full pathname of the directory to be mounted on.
The
.I mnt_type
field determines how the
.I mnt_fsname
and
.I mnt_opts
fields are interpreted.
Here is a list of the filesystem types currently supported,
and the way each of them interprets these fields:
.TP 10
.B xfs
\f2mnt_fsname\f1 must be a block special device (for example,
.IR /dev/root )
or a logical volume.
.TP 10
.B efs
\f2mnt_fsname\f1 must be a block special device (for example,
.IR /dev/root )
or a logical volume.
.TP 10
.B proc
\f2mnt_fsname\f1 should be the
.I /proc
directory.
See
.IR proc (4).
.TP 10
.B fd
\f2mnt_fsname\f1 should be the
.I /dev/fd
directory.
See
.IR fd (4).
.TP 10
.B hwgfs
\f2mnt_fsname\f1 should be the
.I /hw
directory.
See
.IR hwgfs (4).
.TP 10
.B nfs
\f2mnt_fsname\f1 is the path on the server of the directory to be served.
(NFS option only).
.TP 10
.B cdfs
A synonym for type
.B iso9660
(see below).
This type is required for MIPS ABI compliance.
.TP 10
.B iso9660
\f2mnt_fsname\f1 formerly was a generic SCSI device.  With 6.2
plus patches, or later releases, it is the volume partition of
the raw disk
(for example,
.IR /dev/rdsk/dks0d7vol ).
See
.IR ds (7M).
This filesystem type is used to mount CD-ROM discs in
ISO 9660 (with or without Rock Ridge
extensions) and High Sierra formats.
\f2eoe.sw.cdrom\f1 must be installed in order to use
the \f3iso9660\f1 filesystem type.
.TP 10
.B dos
\f2mnt_fsname\f1 is normally a floppy device, or other
removable media using the disk driver.
These are located in the directory
.I /dev/rdsk
(for example,
.IR /dev/rdsk/fds0d2.3.5 ).
See
.IR dksc (7M)
and
.IR smfd (7M).
.TP 10
.B hfs
\f2mnt_fsname\f1 must be either a floppy device or a raw disk 
device.
Floppy devices are located in the directory
.I /dev/rdsk
(for example,
.IR /dev/rdsk/fds0d2.3.5hi ).
See
.IR smfd (7M).
Raw disk devices are located in the directory
.I /dev/rdsk
(for example,
.IR /dev/rdsk/dks0d4vol ).
See
.IR ds (7M).
.TP
.B swap
\f2mnt_fsname\f1 should be the full pathname to the file or block device
to be used as a swap resource.
.TP
.B cachefs
\f2mnt_fsname\f1 should be the filesystem name for the backing filesystem
to be mounted as a cache filesystem.
This will either be the special filename (for example,
.IR /dev/dsk/dks0d4s7 )
or
.IR host : path .
.TP 10
.B rawdata
\f2mnt_fsname\f1 may be the block/char special device of the partition
or logical volume to reserve (\f2mnt_dir\f1 is ignored).
This entry
enables the system utilities (for example,
.IR mkfs ,
.IR mount ,
and so on) to treat the raw
partition or logical volume
as 'mounted', preventing the partition from inadvertently being overwritten.
Any packages that require dedicated raw partitions (databases and so on) should
consider placing a
.B rawdata
entry in
.IR fstab (4).
.PP
If the \f2mnt_type\f1 is specified as
.BR ignore ,
then the entry is ignored.
This is useful to show disk partitions not currently used.
.I mnt_freq
is not used in current IRIX systems.
.PP
.I mnt_passno
can be used to control the behavior of parallel filesystem checking on
bootup, see
.IR fsck (1M).
.PP
The
.I mnt_opts
field contains a list of comma-separated option words.
Some
.I mnt_opts
are valid for all filesystem types, while others apply to a
specific type only.
.PP
Options valid on
all
filesystems (the default is
.BR rw )
are:
.IP \f3rw\f1 10
Read/write.
.IP \f3ro\f1
Read-only.
.IP \f3noauto\f1
Ignore this entry during a \f2mount\f1 \f3\-a\f1 command,
to allow the definition of
\f2fstab\f1 entries for commonly-used filesystems that should not be
automatically mounted.
.IP \f3grpid\f1
Causes a file created within the filesystem to have the group ID of its
parent directory, not the creating process's group ID.
.IP \f3nosuid\f1
Setuid execution not allowed for non-superusers.
This option has no effect
for the superuser.
.IP \f3nodev\f1
Access to character and block special files is disallowed.
.PP
Mandatory Access Control options can be specified using a list of
colon-separated options:
.ce

\f3eag\f1:\f2option\f1{:\f2option\f1 ...}

.br
where \f2option\f1 is one of the following:
.IP \f3mac-default\f1=\f2label\f1
Use the specified label for all files on the specified file system 
that do not have a MAC label.
.IP \f3mac-ip\f1=\f2label\f1
Use the specified label for communications to other systems regarding this file system.
.PP
A number of filesystem types also support the \f3debug\fP option, but the
meaning varies with the filesystem type.
.PP
Options specific only to
.B xfs, efs
and
.B nfs
filesystems are:
.IP \f3quota\f1 10
Disk quota accounting enabled, and limits enforced.
.PP
Options specific to
.B xfs
filesystems are:
.IP \f3biosize\f1 10
The biosize (buffered I/O size) option can be used to
set the default preferred buffered I/O size for filesystem.
The default preferred I/O size is 64K.
The biosize option can be used to decrease the preferred I/O
size.
The size must be expressed as the log (base2) of the desired
I/O size.
Valid values for this option are 14 through 16, inclusive
(e.g. 16K, 32K, and 64K bytes).
On machines with 4K size pages, 13 (8 Kbytes) is also a valid size.
The preferred buffered I/O size can also be altered
on a per-file basis using the \f2fcntl\fP system call.
See \f2fcntl\fP(2) for further details.
.IP \f3dmi\f1 10
Enable the Data Management Interface event callouts.
.IP \f3logbufs\f1 10
Set the number of in memory log buffers.
Valid numbers range from 2-8 inclusive.
The default value is 8 buffers for filesystems with a blocksize of 64K,
4 buffers for filesystems with a blocksize of 32K,
3 buffers for filesystems with a blocksize of 16K,
and 2 buffers for all other configurations.
Increasing the number of buffers may increase performance on
some workloads at the cost of the memory used for the extra
log buffers and their associated control structures.
.IP \f3noalign\f1
Data allocations will not be aligned at stripe unit boundaries.
.IP \f3noatime\f1
Access timestamps are not updated when a file is read.
.IP \f3norecovery\f1
The filesystem will be mounted without running log recovery.
If the filesystem was not cleanly unmounted, it is likely to
be inconsistent when mounted in norecovery mode.
Some files or directories may not be accessible because of this.
Filesystems mounted norecovery must be mounted read-only
or the mount will fail.
.IP \f3osyncisdsync\f1 10
Make writes to files opened with the O_SYNC flag set behave
as if the O_DSYNC flag had been used instead.
This can result in better performance without compromising
data safety.
However if this option in effect, timestamp updates from
O_SYNC writes can be lost if the system crashes.
.IP \f3qnoenforce\f1
Disk quota accounting enabled, but limits are not enforced.
.IP \f3sunit\f1=\f2value\f1 10
Used to specify the stripe unit for a RAID device or a xlv stripe volume.
\f2value\f1 has to be specified in 512-byte block units.
If this option is not
specified and the filesystem was made on a stripe volume or the stripe
unit was specified for the RAID device at mkfs time, then the mount system 
call will restore the value from the superblock. For filesystems that are 
made directly on RAID devices, this option can be used to override the 
information in the superblock if the underlying disk layout changes after
the filesystem has been mkfsed. If the filesystem is made on a xlv volume, 
then this will be done implicitly. 
.IP \f3swidth\f1=\f2value\f1 10
Used to specify the stripe width for a RAID device or a xlv stripe volume.
\f2value\f1 has to be specified in 512-byte block units.
If this option is not
specified, and the filesystem was made on a stripe volume or the stripe
width was specified for the RAID device at mkfs time, then the mount system 
call will restore the value from the superblock. For filesystems that are 
made directly on RAID devices, this option can be used to override the 
information in the superblock if the underlying disk layout changes after
the filesystem has been mkfsed. If the filesystem is made on a xlv volume, 
then this will be done implicitly. This option is required if the
.B -o sunit
option has been specified. Also it has to be a multiple of the sunit option.
.IP \f3wsync\f1
All operations that modify the filesystem are synchronous
except for writes to user files (e.g. create, unlink, mv, truncate, etc.).
This option can be used in conjunction with exporting a filesystem -wsync
to obtain NFS write-synchronous semantics, if so desired.
See \f3exports(4)\f1 for further information.
.PP
Options specific to
.B efs
filesystems (the default is
.BR fsck ,
.BR noquota )
are:
.IP \f3raw\f1=\f2path\f1 10
The filesystem's raw device pathname (for example,
.IR /dev/rroot ).
.IP \f3fsck\f1
.IR fsck (1M)
invoked with no filesystem arguments should check this filesystem.
.IP \f3nofsck\f1
.IR fsck (1M)
should not check this filesystem by default.
.IP \f3noquota\f1
Disk quota accounting and limit enforcement disabled.
.IP \f3lbsize\f1=\f2n\f1
The number of bytes transferred in each read or synchronous write operation.
.\" .IP \f3pbsize\f1=\f2n\f1 .75i
.\" the file preallocation size.
.\" Whenever a file is grown, \f2pbsize\fP contiguous bytes (if available) are
.\" preallocated for the file;
.\" when the file is closed (see \f3close(2)\fP), unused blocks are deallocated.
.\" This value has size restrictions similar to \f3lbsize\fP;
.\" in addition, it cannot be greater than the number of data blocks
.\" in a cylinder group (see \f3efs(4)\fP).
.\" By default, \f3pbsize\fP is the same as \f3lbsize\f1.
.\" Note that this value effectively limits \f3lbsize\fP during write operations
.\" that grow a file.
.IP
The value assigned to the
.B lbsize
option must be a power of two at least as large as
the system page size.
This value is returned by the
.IR getpagesize (2)
system call and is normally either 4096 or 16384 depending
on the system type.
The current default for
.B lbsize
is the value in the fs_sectors field of the superblock of the filesystem.
This was normally the number of "sectors per track" in the past, but
that often fictious value is no longer used.  If not set on the mkfs
command line, the maximum value of 128 sectors is used by IRIX 6.4
and later releases.
An invalid size will cause the mount to fail with the error EINVAL.
The maximum size is currently 65536.
Note that less than
.B lbsize
bytes will be transferred if there are not
.B lbsize
contiguous bytes of the addressed portion of the file on disk.
.PP
Options specific to
.B dos
filesystems.
.IP \f3partition\fP
With a following number, as \f3partition,#\fP, where \f3#\fP is most often
either 1 or 4, is used with type 5 (extended) filesystems
to specify which partition to use.  Otherwise type 5 filesystems
are not supported.
.PP
Options specific to
.B iso9660
filesystems (the default is
.BR rw ,
which has no effect since CD-ROM discs are always read-only) are:
.IP \f3setx\f1 10
Set execute permission on every file on the mounted
filesystem.
The default is to
make an intelligent guess based on the first few bytes of the file.
.IP \f3notranslate\f1
Don't translate ISO 9660 filenames to UNIX filenames.
The default is to convert upper case to lower case and to
truncate the part including and after the semicolon.
.IP \f3cache\f1=\f2blocks\f1
Set the number of 2048 byte blocks to be used for caching
directory contents.
The default is to cache 128 blocks.
.IP \f3noext\f1
Ignore Rock Ridge extensions.
The default when the \f3noext\f1 option
is not specified is to use Rock Ridge extensions
if present.
.IP \f3susp\f1
Enable processing of System Use Sharing Protocol extensions to the
ISO 9660 specification.
This is the default.
.IP \f3nosusp\f1
Disable processing of System Use Sharing Protocol extensions.
This
has the same effect as the \f3noext\f1 option.
.IP \f3rrip\f1
Enable processing of the Rock Ridge extensions.
This is the default.
.IP \f3norrip\f1
Disable processing of the Rock Ridge extensions.
This is equivalent
to the \f3noext\f1 option.
.IP \f3nmconv=[clm]\f1
This option is supplied for MIPS ABI compliance; some non-IRIX systems may
implement it only for type
.BR cdfs ,
IRIX allows it with type
.B iso9660
also.
Only one of the three letters
.BR c ,
.BR l ,
or
.B m
can be specified.
This option controls filename translation.
.B c
has the same meaning as \f3notranslate\f1 above.
.B l
requests translation to lower case (the IRIX default), and
.B m
suppresses the version number (also the IRIX default).
.PP
NFS clients can mount \f3iso9660\f1, \f3dos\f1, and \f3hfs\f1 filesystems
remotely by specifying \f2hostname\f1:\f2mountpoint\f1 for
\f2filesystem\f1 and \f3nfs\f1 for \f2type\f1, where an \f3iso9660\f1,
\f3dos\f1, or \f3hfs\f1 filesystem is mounted at \f2mountpoint\f1 on the
host \f2hostname\f1.
In this case, the same \f2options\f1 apply
as with \f3nfs\f1 (see below).
.PP
If the NFS option is installed, the following options
are valid for
.B nfs
filesystems:
.IP \f3vers=\f2n\f1 10
Use NFS protocol version
.IR n .
(The default is to try version 3, falling back to version 2 if the
version 3 mount
fails.)
.IP \f3bg\f1 10
If the first attempt fails, retry in the background.
.IP \f3fg\f1
Retry in foreground.
(Default)
.IP \f3retry=\f2n\f1
Set number of mount failure retries to
.IR n .
(Default = 10000)
.IP \f3rsize=\f2n\f1
Set read transfer size to
.I n
bytes.  This value will be rounded up to the nearest multiple
of 512 bytes.
The default is 8192 for NFS version 2, and 16384 or
32768 for NFS version 3. The 16KB transfer size is used
when the route to the server is known to go through a router,
or when the Maximum Transmission Unit (MTU) of the
interface used to get to the server is Ethernet-sized
(about 1500 bytes) or less.
The system tunable 
\f3nfs3_default_xfer\f1 
can be used to reduce the upper limit of the NFS version 3
transfer size if 16KB is still too much for routers.
For example, setting it to 8192 gives the same default for
version 3 as version 2.
For NFS version 3, the read transfer size specified by the server will
be used if it is smaller than either the default or what the user
has specified.
.IP \f3wsize=\f2n\f1
Set write transfer size to
.I n
bytes.  This value will be rounded up to the nearest multiple
of 512 bytes.  The default is the same as for the read size.
For NFS version 3, the write transfer size specified by the server will
be used if it is smaller than either the default or what the user
has specified.
.IP \f3timeo=\f2n\f1
Set NFS timeout to
.I n
tenths of a second.
(Default = 11)
.IP \f3retrans=\f2n\f1
Set number of NFS retransmissions to
.IR n .
(Default = 5)
.IP \f3port=\f2n\f1
Set server UDP port number to
.IR n .
(Default = 2049)
.IP \f3hard\f1
Retry request until server responds.
(Default)
.IP \f3soft\f1
Return error if server doesn't respond.
.IP \f3nointr\f1
Disallow requests to be interrupted by the following signals:
SIGHUP, SIGINT, SIGQUIT, SIGKILL, SIGTERM, and SIGTSTP.
(Requests are interruptible by these signals, by default.)
.IP \f3acregmin\f1=\f2t\f1
Set the regular file minimum attribute cache timeout to
.I t
seconds.
(Default = 3)
.IP \f3acregmax\f1=\f2t\f1
Set the regular file maximum attribute cache timeout to
.I t
seconds.
(Default = 60)
.IP \f3acdirmin\f1=\f2t\f1
Set the directory minimum attribute cache timeout to
.I t
seconds.
(Default = 30)
.IP \f3acdirmax\f1=\f2t\f1
Set the directory maximum attribute cache timeout to
.I t
seconds.
(Default = 60)
.IP \f3actimeo\f1=\f2t\f1
Set regular and directory minimum and maximum attribute cache timeouts to
.I t
seconds.
.IP \f3noac\f1
No attribute caching.
.IP \f3proto\f1=\f2xyz\f1
Use the IP protocol
.I xyz
, where
.I xyz
is either 
.I udp
or
.I tcp .
If the specified protocol is not supported by the server, then the 
mount will fail.  The default is 
.I udp .
.IP \f3private\f1
Do not flush delayed writes on last close of an open file, and use local
file and record locking instead of a remote lock manager.
.IP \f3shortuid\f1
Do not let users with userids or groupids larger than 65535 (see
.IR id (1M))
create or own files.
Some versions of UNIX do not support large userids;
trying to create a file with a large userid on such an NFS server can
produce undefined and surprising results.
.IP \f3symttl\f1=\f2t\f1
Set the time-to-live for symbolic links cached by NFS to
.I t
seconds.
\f3symttl=0\f1 turns off NFS symlink caching.
The maximum value for
.I t
is 3600.
(Default = 3600)
.IP \f3asyncnlm\f1
Use asynchronous NLM RPC calls.
The default is to use synchronous NLM.
Using this option requires that
.IR lockd (1M)
be running.
.IP \f3defxattr\f1
Use default values for system\-defined extended attributes, rather than asking
the NFS server for their values. This option does not work when \f3noac\f1
is also specified.
.IP \f3doxattr\f1
Tell the NFS server that this client can be trusted to properly handle extended
attributes. This is necessary only when the remote filesystem is exported with
the \f3noxattr\f1 option.
.PP
The
.B bg
option causes
.I mount
to run in the background if the server's
.IR mountd (1M)
does not respond.
.I mount
attempts each request
.BI retry= n
times before giving up.
.PP
Once the filesystem is mounted, each NFS
request waits
.BI timeo= n
tenths of a second for a response.
If no response arrives, the
time-out is multiplied by 2, up to a maximum of MAXTIMO (900),
and the request is retransmitted.
When
.BI retrans= n
retransmissions have been sent with no reply a
.B soft
mounted filesystem returns an error on the request and a
.B hard
mounted filesystem retries the request.
Filesystems that are mounted
.B rw
(read-write)
should use the
.B hard
option.
The number of bytes in a read or write request can be set with the
.B rsize
and
.B wsize
options.
.PP
In the absence of client activity that would invalidate recently acquired
file attributes, NFS holds attributes cached for an interval between
.B acregmin
and
.B acregmax
for regular files, and between
.B acdirmin
and
.B acdirmax
for directories.
The
.B actimeo
option sets all attribute timeout constraints to a given number of seconds.
The
.B noac
option disables attribute caching altogether.
.LP
The
.B private
option greatly improves write performance by caching data and delaying
writes on the assumption that only this client modifies files in the remote
filesystem.
It should be used only if the greater risk of lost delayed-write data in the
event of a crash is acceptable given better performance.
EFS uses caching strategies similar to private NFS
The
system reduces the risk of data loss for all filesystems by automatically
executing a partial
.IR sync (2)
at regular intervals.
.PP
If the BDS option is installed, the following options
are valid for
.B nfs
filesystems that have BDS service enabled:
.IP \f3bds\f1 10
Turn on bulk data service for this file system.
.IP \f3bdsauto\f1=\f2size\f1 10
For all read/write requests that are sized greater
or equal to \f2size\f1, do BDS I/O instead of NFS I/O.
.IP \f3bdswindow\f1=\f2size\f1 10
Set the TCP protocol send and receive windows to \f2size\f1 instead of the
default of 4Mbytes.
.IP \f3bdsbuffer\f1=\f2size\f1 10
Specify the size of data buffers within the server, instead of
allowing the server to determine the best size.
.PP
Options specific to
.B swap
resources are:
.IP \f3pri\f1=\f2t\f1 10
Set the priority of the swap device to \f2t\f1.
The legal values are from
0 to 7 inclusive.
.IP \f3swplo\f1=\f2t\f1
Set the first 512 byte block to use to \f2t\f1 (default is 0).
.IP \f3length\f1=\f2t\f1
Set the number of 512 byte blocks to use to \f2t\f1 (default is entire
file/partition).
.IP \f3maxlength\f1=\f2t\f1
Set the maximum number of 512 byte blocks to grow the swap area to \f2t\f1
(default is to use \f3length\f1).
.IP \f3vlength\f1=\f2t\f1
Set the number of virtual 512 byte blocks to
claim this swap file has to \f2t\f1 (default is to use
\f3length\f1).
.PP
All other options except for \f2noauto\f1 are ignored for \f4swap\f1
files.
.PP
If the CacheFS option is installed, the following options are valid for
.B cachefs
filesystems:
.IP \f3backfstype\f1=\f2file_system_type\f1 10
The filesystem type of the back filesystem (for example, \f3nfs\f1).
Any of the following filesystem types may be used as the back filesystem:
.IR nfs ,
.IR nfs3 ,
.IR iso9660 ,
.IR dos ,
.IR cdfs ,
.IR kfs ,
or
.IR hfs .
If this option is not specified, the back filesystem type is determined
from the filesystem name.
Filesystem names of the form \f2hostname\f1:\f2path\f1 will
be assumed to be type
.IR nfs .
.IP \f3backpath\f1=\f2path\f1
Specifies where the back filesystem
is already mounted.
If this argument is not supplied,
CacheFS determines a mount point for the back filesystem.
.IP \f3cachedir\f1=\f2directory\f1
The name of the cache directory.
.IP \f3cacheid\f1=\f2ID\f1
.I ID
is a string specifying a particular instance of a cache.
If you do not specify a cache ID, CacheFS will construct one.
.IP \f3write-around\f1\ |\ \f3non-shared\f1
Write modes for CacheFS.
In the
.B write-around
mode, writes are made to the back filesystem,
and the affected file is purged from the cache.
Also in this mode,
file and record locking is performed through the back filesystem.
You can use the
.B non-shared
mode (the default) when you are sure that no one else will be
writing to the cached filesystem.
In this mode,
all writes are made to both the front and the back filesystem,
and the file remains in the cache.
.IP \f3noconst\f1
By default, consistency checking is performed.
Disable consistency checking by specifying
.B noconst
only if you mount the filesystem read-only.
.IP \f3private\f1
Causes file and record locking to be performed locally.
In addition,
files remain cached when file and record locking is performed.
By default,
files are not cached when file and record locking is performed and all
file and record locking is handled by the back filesystem.
.IP \f3local-access\f1
Causes the front filesystem to interpret the mode bits
used for access checking instead or having the back filesystem
verify access permissions.
.IP \f3suid\f1\ |\ \f3nosuid\f1
Allow (default) or disallow set-uid execution.
.IP \f3acregmin\f1=\f2n\f1
Specifies that cached attributes are held
for at least
.I n
seconds
after file modification.
After
.I n
seconds,
CacheFS checks to see
if the file modification time on the back filesystem has changed.
If it has, all information about the file is purged from the cache
and new data is retrieved from the back filesystem.
The default value is 30 seconds.
.IP \f3acregmax\f1=\f2n\f1
Specifies that cached attributes are held for no more than
.I n
seconds after file modification.
After
.I n
seconds, all file information is purged from the cache.
The default value is 30 seconds.
.IP \f3acdirmin\f1=\f2n\f1
Specifies that cached attributes are held
for at least
.I n
seconds after directory update.
After
.I n
seconds, CacheFS checks to see
if the directory modification time on the back filesystem has changed.
If it has, all information about the directory is purged from the cache
and new data is retrieved from the back filesystem.
The default value is 30 seconds.
.IP \f3acdirmax\f1=\f2n\f1
Specifies that cached attributes are held for no more than
.I n
seconds after directory update.
After
.I n
seconds, all directory information is purged from the cache.
The default value is 30 seconds.
.IP \f3actimeo\f1=\f2n\f1
Sets
.BR acregmin ,
.BR acregmax ,
.BR acdirmin ,
and
.B acdirmax
to
.IR n .
.IP \f3bg\f1
This option causes
.I mount
to run in the background if the back filesystem mount times out.
.IP \f3disconnect\f1
Causes the cache filesystem to operate in disconnected mode when the
back filesystem fails to respond.
This causes read accesses to files
already cached to be fulfilled from the front filesystem even when
the back filesystem does not respond.
.SH NOTES
The filesystem types \f3nfs2\f1, \f3nfs3\f1, and \f3nfs3pref\f1
are accepted for compatibility
with earlier releases.
\f3nfs2\f1 is equivalent to \f3vers=2\f1. 
\f3nfs3\f1 is equivalent to \f3vers=3\f1.
\f3nfs3pref\f1 is equivalent to \f3nfs\f1 with no \f3vers=\f1 option.
.PP
Options used by the
.IR mount (1M)
command on normal filesystems are ignored when applied to the
root filesystem, since the \f2fstab\f1 file cannot be read before
mounting the root filesystem.  These options include
.B rw
and
.B ro
(the root filesystem cannot be mounted read-only), 
.BR grpid ,
.B quota
and
.B qnoenforce
(see
.IR quotaon (1M),
.BR dmi ,
.BR wsync ,
.BR noatime ,
.BR noalign ,
.BR sunit ,
.BR swidth ,
.BR noquota ,
and
.BR lbsize.
.SH FILES
/etc/fstab
.SH SEE ALSO
cfsadmin(1M),
fsck(1M),
mount(1M),
quotacheck(1M),
quotaon(1M),
swap(1M),
getmntent(3),
efs(4),
exports(4),
fd(4),
filesystems(4),
mtab(4),
proc(4),
xfs(4).
