calmsacibis995/irix-6517-src/eoe/man/man4/gettydefs.4
.nr X
.if \nX=0 .ds x} gettydefs 4 "" "\&"
.TH \*(x}
.SH NAME
gettydefs \- speed and terminal settings used by getty
.SH DESCRIPTION
The
.I /etc/gettydefs
file contains information used by
.IR getty (1M)
to set up the speed and terminal settings for a line.
It supplies information on what the
.IR login (1)
prompt should look like.
It also supplies
the speed to try next if
the user indicates the current speed is not correct by
typing a
.B <break>
character.
.PP
.B Note:
Customers who need to support terminals that pass
8 bits to the system
(as is typical outside the U.S.) must modify the entries in
.I /etc/gettydefs
as described in the
.B WARNINGS
section.
.PP
Each entry in
.I /etc/gettydefs
has the following format:
.PP
.RS
label# initial-flags # final-flags # login-prompt #next-label
.RE
.PP
Each entry is followed by a blank line.
The various fields can contain quoted characters of the form
.BR \eb ,
.BR \en ,
.BR \ec ,
and so on as well as
.BI \e nnn\f1,\fP
where
.I nnn
is the
octal value of the desired character.
The various fields are:
.TP \w'login-prompt\ \ \ 'u
.I label
This is the string against which
.I getty
tries to match its second argument.
It is often the speed, such as \f31200\fP, at which the terminal
is supposed to run, but it need not be
(see
below).
.TP
.I initial-flags
These flags are the initial
.IR ioctl (2)
settings to which the terminal is to be set if
a terminal type is not specified to
.IR getty .
The flags that
.I getty
understands are the same as the ones listed in
.I /usr/include/sys/termio.h
(see
.IR termio (7)).
Normally only the speed flag is required in the
.IR initial-flags .
.I getty
automatically sets the terminal to raw input mode and
takes care of most of the other flags.
The \f2initial-flag\fP settings remain in effect until
.I getty
executes
.IR login .
.TP
.I final-flags
These flags take the same values as the
.I initial-flags
and are set just before
.I getty
executes
.IR login .
The speed flag is again required.
The composite
flag
.B SANE
takes care of most of the other flags that need to be
set so that the processor and terminal are communicating
in a rational fashion.
The other two commonly specified
.I final-flags
are
.BR TAB3 ,
so that tabs are sent to the terminal as spaces, and
.BR HUPCL ,
so that the line is hung up on the final close.
.TP
.I login-prompt
This entire field is printed as the \f2login-prompt\fP.
Unlike the above
fields where white space is ignored
(a space, tab, or newline),
they are included in the
.I login-prompt
field.
As a special feature, this field can contain the string
.BR $HOSTNAME ,
which is replaced by the current hostname of the machine.
See
.IR hostname (1)
for more information.
.TP
.I next-label
If this entry does not specify the desired speed, indicated by
the user typing a
.B <break>
character, then
.I getty
searches for the entry with
.I next-label
as its
.I label
field and sets up the terminal for those settings.
Usually, a series of speeds are linked together in this fashion, into
a closed set; for instance, \f32400\fP linked to \f31200\fP, which is
linked to \f3300\fP, which finally is linked to \f32400\fP.
.PP
If
.I getty
is called without a second argument, then the first entry of
.I /etc/gettydefs
is used, thus making the first entry of
.I /etc/gettydefs
the default entry.
It is also used if
.I getty
can not find the specified
.IR label .
If
.I /etc/gettydefs
itself is missing, there is one entry built into
.I getty
that brings up a terminal at \f3300\fP baud.
.PP
It is strongly recommended that after making or modifying
.IR /etc/gettydefs ,
it be run through
.I getty
with the check option to be sure there are no errors.
.SH FILES
/etc/gettydefs
.SH "SEE ALSO"
getty(1M),
login(1),
stty(1),
ioctl(2),
termio(7).
.SH WARNINGS
To support terminals that pass 8 bits to the system
(see the
.B BUGS
section),
modify the entries in the
.I /etc/gettydefs
file for those terminals as follows:
add
.B CS8
to
.I initial-flags
and replace all occurrences of
.B SANE
with the values:
.B "BRKINT IGNPAR ICRNL IXON OPOST ONLCR"
.BR "CS8 ISIG ICANON ECHO ECHOK" .
.PP
An example of changing an entry in
.I /etc/gettydefs
is illustrated below.
All the information for an entry must be on one line in the file.
.PP
Original entry:
.Ex
CONSOLE # B9600 HUPCL OPOST ONLCR # B9600 SANE IXANY TAB3
HUPCL # $HOSTNAME console Login:  # console
.Ee
Modified entry:
.Ex
CONSOLE # B9600 CS8 HUPCL OPOST ONLCR # B9600 BRKINT IGNPAR
ICRNL IXON OPOST ONLCR CS8 ISIG ICANON ECHO ECHOK IXANY
TAB3 HUPCL # $HOSTNAME console Login:  # console
.Ee
This change permits terminals to pass 8 bits to the
system so long as the system is in
MULTI-USER
state.
When the system changes to
SINGLE-USER
state, the
.I getty
is killed and the terminal attributes are lost.
So to permit a terminal to pass 8 bits to the
system in
SINGLE-USER
state,
after you are in
SINGLE-USER
state, type (see
.IR stty (1)):
.Ex
\f4stty -istrip cs8\f1
.Ee
.SH BUGS
8-bit with parity mode is not supported.
