calmsacibis995/irix-6517-src/eoe/man/man4/grio_disks.4
.TH grio_disks 4
.SH NAME
grio_disks \- description of guaranteed I/O rates for disk devices
.SH DESCRIPTION
The \f2/etc/grio_disks\f1 file contains
information describing the I/O rates for individual types of
disk drives.
.PP
The entries are of the form:
.Ex
\f7\f3ADD\f1 "\f2xxxxxxxxxxxxxxxxxxxxxxxxxxxx\f1\f7"   \f1\f2iosize\f1\f7    \f1\f2numios\f1
.Ee
or
.Ex
\f7\f3REPLACE\f1 \f2nodename\f1  \f7\f2iosize\f1 \f7\f2numios\f1
.Ee
The first string on each line of the file must be one of the keywords
\f3ADD\f1, \f3REPLACE\f1 or the symbol for a comment line, \f3#\f1.
.PP
If the line begins with the keyword \f3ADD\f1,
the next item is the 28 character string identifying a particular type
of disk drive.
This is also known as the disk drive ID string.
Drives recommended by Silicon Graphics usually have "SGI"
string as the first three characters in this string.
The next number describes the optimal I/O size in bytes for the disk device.
The final number is the number of optimal sized I/O requests that can be
performed by the disk drive each second.
.PP
If the line begins with the keyword \f3REPLACE\f1,
the next item indicates a node name in the hwgraph or disk alias
format (as reported by \f3grio(1M)\f1 -P)
The third and fourth values on the line indicate the 
optimal I/O size and the number of I/O operations per second, respectively.
The system administrator may set the bandwidth values for any node
in the system.
Specifically, \f3REPLACE\f1 lines may be added to the 
\f3\/etc\/grio_disks\f1 file for the RAID controllers and the
RAID lun devices.
.PP
Normally the optimal I/O size of a disk device used in the GRIO subsystem
is set to the stripe width of the XLV realtime subvolume that
contains the disk.
The system administrator may override this value for a given disk by using
the \f3REPLACE\f1 keyword.
If the XLV realtime subvolume is not striped, and \f3REPLACE\f1 has
not been used to specify an optimal I/O size, the disk device is given
the optimal I/O size specified to \f2ggd\f1 with the -o option.
.PP
If the line begins with the comment symbol \f3#\f1, the remainder of
the line is ignored.
.PP
The performance characteristics for the supported disk drives
using optimal I/O sizes of 64k, 128k, 256k, and 512k bytes are listed
in the \f2/etc/grio_disks\f1 file.
If the system administrator wants to use a different disk drive or
a different optimal I/O size on an existing drive, new lines can be
added to the end of the file.
The \f2grio_bandwidth\f1(1M) utility can be used to help determine the
number of I/Os of a given size that can be supported by a given drive
every second.
.PP
After the \f2/etc/grio_disks\f1 file is updated, the
\f2ggd\f1 daemon must be restarted to make use of the new configuration.
.SH FILES
.nf
/etc/grio_disks
.fi
.SH SEE ALSO
ggd(1M),
grio(1M),
grio_bandwidth(1M),
hwgraph(4),
grio(5).
.SH NOTE
The number of optimal sized I/O requests that can be guaranteed each second
may be significantly less than the maximum performance of the drive.
This is because each request is considered to be distinct and may require
a maximum length seek before the request is issued.
