calmsacibis995/irix-6517-src/eoe/man/man4/group.4
'\"macro stdmacro
.if n .pH man4.group @(#)group	30.3 of 2/1/86
.TH GROUP 4
.SH NAME
group \- group membership file
.SH DESCRIPTION
.IX  "group file"  ""  "\fLgroup\fP \(em group file format"
The 
.B /etc/group
file contains for each group the following information:
.RS 3
.IP \(bu 2
group name
.IP \(bu 2
encrypted password
.IP \(bu 2
numerical group ID
.IP \(bu 2
a comma separated list of all users allowed in the group
.RE
.LP
For example, the entry for the \f2sys\f1 group is:
.Ex
sys::0:root,bin,sys,adm
.Ee
.LP
This is an
.SM ASCII
file.  
A ``#'' at the beginning of a line indicates a comment.
The ``#'' is only recognized at the beginning of a line, it should not be
used after the user list.
The fields are separated by colons;
each group is separated from the next by a new-line.
Except at the beginning of each line, white-space is not ignored, thus
in most cases there should be no spaces e.g. in the user list.
If the password field is null, no password is demanded.
A ``\(**'' in the password field locks the entry.
.LP
This file resides in the
.I /etc
directory.  Because of the encrypted passwords,
it can and does have general read permission and can be
used, for example, to map numerical group ID's to names.
.PP
If the 
.SM NFS
option is installed, 
a group file can have a line beginning with a plus (+),
which means to incorporate entries from the NIS group database.
There are two styles of + entries:
All by itself, + means to insert the entire contents
of the NIS group database at that point;
.I +name
means to insert the entry (if any) for
.I name
from the NIS database at that point.
If a + entry has a non-null password or group member field,
the contents of that field will override
what is contained in the NIS database.
The numerical group ID field cannot be overridden.
.PP
A group file can also have a line beginning
with a minus (\-),
these entries are used to disallow group entries.
There is only one style of \- entries:
an entry that consists of
.I \-name
means to disallow any subsequent entry (if any) for
.IR name .
These entries will be disallowed
regardless of whether the subsequent entry comes
from the NIS or the local group file.
.PP
For example, if the following entries 
.Ex
\-oldproj
+myproject:::bill, steve
+:
.Ee
appear at the end of a group file, then the group
.I oldproj
will be ignored if it appears after the entry
.IR \-oldproj .
Also, the group
.I myproject
will have members
\f2bill\f1 and \f2steve\f1,
and the password and group ID of the NIS entry for the group
.IR myproject .
All the groups listed in the NIS database
will be pulled in and placed after the entry for
.IR myproject .
.SH FILES
/etc/group
.SH "SEE ALSO"
crypt(3), newgrp(1M), passwd(1), passwd(4)
.SH BUGS
The
.IR passwd (1)
command won't change group passwords.
'\".SH ORIGINS
'\"AT&T V.3 (standard version)
'\".br 
'\"Sun Microsystems (NIS version)
