calmsacibis995/irix-6517-src/eoe/man/man4/hosts.equiv.4
'\"!  tbl | mmdoc
'\"macro stdmacro
.\" @(#)hosts.equiv.5	1.1 88/07/01 4.0NFSSRC; from 1.13 88/02/08 SMI; from UCB 4.2
.TH HOSTS.EQUIV 4
.SH NAME
hosts.equiv, rhosts \- trusted hosts by system and by user
.SH DESCRIPTION
.PP
The remote login and shell servers use an
authentication scheme based on ``trusted hosts.''
The \f2/etc/hosts.equiv\fP
file contains a list of hosts that are considered trusted
and under the same administrative control.  
When an
.IR rlogin (1C),
.IR rcp (1C),
.IR rdist (1C),
or
.IR rsh (1C)
request is received from a host listed in \f2hosts.equiv\fP
and when the targeted user account is listed in the
.I /etc/passwd
file, then the remote access is allowed with no further checking.
In this case,
.I rlogin
does not prompt for a password, and 
.IR rcp ,
.IR rdist ,
and
.I rsh
complete successfully.
Thus, a remote user with a local user ID is said to have ``equivalent''
access from a remote host named in \f2hosts.equiv\fP.
Users may expand this "equivalence" of
machines by installing a \f2.rhosts\fP file in their login directory.
The \f2root\fP login bypasses the \f2/etc/hosts.equiv\fP
file and uses only \f2root\fP's (typically /\f2.rhosts\fP) file.
'\"---------------------------------------------------
.SS The /etc/hosts.equiv File
.LP
The format of the
.I hosts.equiv
files consists of one or more entries of the form:
.IP
.IR hostname " [" username "]"
.LP
where
.I hostname 
is the ``official'' fully-qualified name of a host as listed in the 
.IR hosts (4)
database.  The official name is the first name given in 
the hosts database entry (and should include the domain name);
hostname aliases are not recognized.  
The domain portion of the hostname is optional if the hostname's domain
matches the one returned by
.IR gethostname(2)
or 
.IR hostname (1).
If a host is a gateway, i.e., it has more than 1 network interface,
then an entry for the primary name and each gateway name may be required.
The
.I hostname
can be an IP address if the IRIS can't translate a host's IP address 
into a name.
The 
.I username
field is
optional; if missing, the name of the remote user must match
the local username.
Spaces or tabs are used to separate the hostname from the username.
.PP
The
.I hostname
field normally contains the name of a trusted host from which a remote
access can be made.  However, a hostname consisting of a single
.RB ` + '
indicates that all known hosts are to be trusted.
(Sites connected to external networks such as the Internet should \f3not\fP use
.RB ` + '.)
An entry consisting of a hostname prefixed with a minus sign (\-)
denies access to any user from that host.
Remote access can also be
given or denied for all hosts within a specific network group
(if the optional NIS software has been enabled).
An entry
of the form:
.IP
.BI +@ group
.LP
means that all hosts in the named network group
are trusted.  An entry of the form:
.IP
.BI \-@ group
.LP
means that all hosts in the group
are not trusted; remote access is denied to hosts
in that group, except when an entry for a specific host appears ahead
of the ``minus'' group entry.
.LP
The 
.I username
field can be used to specify a user who is
allowed to log in under \f3any\fP valid user ID.  Careful thought about
security should be given before providing this privilege to a user.
You can also specify a
.I username
field with the form:
.IP
.BI +
.br
.BI \- username
.br
.BI +@ group1
.br
.BI \-@ group2
.LP
where
.B +
means any user is allowed access to any account, and
.BI \- username
means the specified user is denied access
(except when previous entries allow the specific user access).
The 
.B +@ 
netgroup allows any user in
.I group1
to log in as anyone, and no one from
.I group2
to log in at all.   
'\"---------------------------------------------------------
.SS The User's .rhosts File
.LP
If none of the entries in
.I /etc/hosts.equiv
give access to the user's account,
the user's
.I .rhosts
file is checked if the file exists.
If a remote user is excluded by a minus entry from
.I hosts.equiv
but included in
.IR .rhosts ,
then that remote user is considered trusted and given access to 
the local user's account.
The
.IR .rhosts
file has the same format as the
.IR hosts.equiv 
file.
If an entry does not contain an explicit username, the local user's 
name is implicitly used.
'\"---------------------------------------------------------
.SS The Root .rhosts File
.LP
When the remote user attempts to a remote access to the super-user account,
.IR root ,
only the
.I /.rhosts
file is checked, not 
.IR /etc/hosts.equiv .
Special care should be taken in deciding the contents
of \f2root\fP's
.I .rhosts
file.
Create \f2root\fP's \&\f2/.rhosts\f1 only if
all systems and their consoles are physically secure and all privileged
accounts have passwords.
Be selective about the systems you add to the file.
Given access to a console on a machine with /\&.\f2rhosts\f1
privileges, someone can log in as any user,
including the superuser, and become \f2root\f1 on any system that has your
system's name and \f2root\f1 in its \&\f2/.rhosts\f1 file.
.SH NOTES
The owner of the
.I .rhosts
file must be the super-user (i.e., \f2root\fP) 
or the user in whose home directory
it resides.
The contents of a user's
.I .rhosts 
file will be disregarded if it is owned
by another user or if its permissions allow anyone who is not the owner
to modify the file.
Use the
.IR chmod (1)
command
to add the proper protection:
.Ex
chmod  600  .rhosts
.Ee
Likewise,
.I /etc/hosts.equiv
must be owned by and writable only by the super-user.
.PP
If the user's home directory is NFS-mounted, 
the system daemons that try to read the user's
.I .rhosts 
file may fail if the NFS server treats uid 0 as ``nobody''
(see 
.IR exports(4)).
In this case, the permissions on the
directory and on the \f2.rhosts\fP file 
should allow read and search access by anyone, so it may be
located and read.
.PP
If 
.I rsh
commands to your account on an IRIS with a
.I .rhosts
file 
fail with ``permission denied'' errors, for example,
it means you have used the wrong hostname or
the IRIS can't translate the remote host's IP address into a name.
.I Rlogin 
to the IRIS and use the hostname or IP address 
contained in the REMOTEHOST environment variable as the hostname
in your
.I .rhosts
file.
The following will display the environment variable:
.Ex
echo $REMOTEHOST
.Ee
You must use the fully-qualified hostname of the remote system
if the IRIS's domain (as obtained from 
.IR hostname(1)
or
.IR gethostname(2))
is missing or not the same as the remote domain.
.PP
The programs mentioned above use the
.IR ruserok(3N)
library routine to grant access based on the contents of these files.
Other programs, such as
.IR su (1M)
also use this routine.
.SH "WARNING"
The references to network groups (+@ and \-@ entries) in
.I hosts.equiv
and
.I .rhosts
are only supported when the
.I netgroup
file is supplied by the NIS.
.PP
Be sure to to place entries with restrictions for a host preceding
permissions for it; the effect of specifications is order-dependent.  Also, 
once a host is mentioned, it is no longer subject to default action.
Hence, listing it once with a specific 
.I username
reference will usually
require an additional, following line which specifies the handling for
remaining users.
.br
.ne 10v
.SH EXAMPLES
The following 
.I .rhosts 
file for user 
.I warren 
on host 
.I clyde.widgets.com
.Ex
+
+                     beatty
clyde                 +
bonnie.gadgets.com        faye
gate-bonnie.gadgets.com   faye
.Ee
permits the following users on the following hosts to access \f2warren\fP's 
account on \f2clyde\fP:
.in +.25i
.TS
l l.
warren	any host
beatty	any host
any user	clyde.widgets.com
faye	bonnie.gadgets.com or gate-bonnie.gadgets.com 
.TE
.in -.25i
.SH FILES
/etc/hosts.equiv
.br
/etc/passwd
.br
~/.rhosts
.SH "SEE ALSO"
rcp(1C), rdist(1C), rlogin(1C), rsh(1C), su(1M), 
rcmd(3N), ruserok(3N), netgroup(4)
