calmsacibis995/irix-6517-src/eoe/man/man4/ldap.conf.4
.TH ldap.conf 4
.SH NAME
ldap.conf \- Lightweight Directory Access Protocol configuration file
.SH SYNOPSIS
.nf
/var/ns/ldap.conf
.fi
.SH DESCRIPTION
This file controls the behavior of the Lightweight Directory Access Protocol
(LDAP) client implementation for \fBnsd\fP.  It is read by the initialization
routine of the ldap(7P) library when the nsd daemon is started, or sent the
SIGHUP signal.  This file contains information about remote LDAP daemons
database schemas, and format rules.
.LP
The file is made up of comment lines, table entries, server entries and
the domain command.  Comment lines begin with either a '#' or a ';'
character, and are ignored by the parser.  Table entries begin with
the keyword \fBtable\fP followed by the name of the table, and a 
series of attributes.  Table entries are separated by one or
more blank lines.  Server entries
begin with the keyword \fBserver\fP, and are followed by a 
series of attributes.  Server entries are separated by one or more 
blank lines.
.TP
.B domain \f2[domainname]\f1
The domain command changes the domain context.  Each of the following
entries and command lines
set information for this domain.  If
the domainname is not given then it sets the context for the default,
or null, domain.
.TP
.B server \f2hostname[:port]\f4
A given domain may specify one or more ldap servers to send
requests to.  \f2hostname\f1 refers to the hostname of the
ldap server.  The hostname may be given directly as an IP
address.  If no port number is given, the default LDAP port
(389) is assumed.
The attribute, attribute value pairs following the
\fBserver\fP keyword define attributes for a particular server.
Attributes include:  
.P
.RS
.PD 0
.TP 8
\f4base\f1
Defines the distinguished name (dn) of the base for the ldap search.
.TP
\f4scope\f1
Defines the depth used in searching for ldap entries.  The value
may be one of the following: \fBsubtree\fP - will search all entries
below the base (default), \fBonelevel\fP - will search one level
below base, and \fBsbase\fP - will search only at the base level.
.TP
\f4binddn\f1
Specifies the distinguished name used in binding to the server.  This
attribute is optional.
.TP
\f4bindpwd\f1
Specifies the password used in binding to the server.  This attribute
is also optional.
.RE
.PD
.P
.B table \f2tablename\f1
The table entries define the way in which the ldap library 
responds to a particular request from the nsd daemon.  
\fBtablename\fP defines the name of the map requested.  
The attribute list must include
the following three items:  
.P
.RS
.PD 0
.TP 8
\f4filter_lookup\f1 
Defines the ldap filter
used for lookup type searches made against this map.  
The filter may contain one
(or more) strings "%s" which will be replaced by the key requested
(or a split of the key, split by the characters ",", "/" or ".".). 
.TP
\f4filter_list\f1
Defines the ldap filter
used for list type searches made against this map.
.TP
\f4format\f1 
Defines the way in which ldap responses are formatted
into output strings.  Alphanumeric strings conforming to the
ldap attribute protocol are replaced by server responses for that
attribute.  If an attribute is placed inside of brackets, and
followed by a separator (eg. (MEMBERUID,)+), then multiple responses
of that attribute will be added to the output string.  If the
special string "KEY" is used in the format attribute, this string
will be replaced with the key requested by the nsd daemon. 
.TP
\f4require\f1
A particular LDAP entry will be returned only if that entry
contains a value corresponding to the named attribute.
.TP
\f4default\f1
In the case of a split key (i.e. two substitutions in the filter),
the second substitution may be given a default value with this
attribute.
.TP
\f4single_line\f1
If this tag is set, multiple entries returned for a particular
query will be placed on a single output line.  The value for this
tag may be null.  If it is not null, the value is interpreted as
a prefix string conforming to the \f4format\f1 syntax defined
above.  This string will be placed before the formatted output
corresponding to individual ldap entries.
.RE
.PD
.P
.SH EXAMPLE
Part of an example ldap.conf file follow, demonstrating the domain
command, server and table entries:
.TP
domain  foo.com
.P
server  test.foo.com:390
.nf
base    "o=Your Organization Name, c=US"
.nf
binddn  "cn=root, o=Your Organization Name, c=US"
.nf
bindpwd secret
.P
table   group.byname
.nf
filter  (&(OBJECTCLASS=POSIXGROUP)(CN=%s))
.nf
format  "CN:GROUPPASSWORD:POSIXGIDNUMBER:(MEMBERUID,)+"
.nf
type    lookup
.SH FILES
/var/ns/ldap.conf
.SH SEE ALSO
nsd(1M), ldap(7P)
.PP
\f2IRIX Admin: Networking and Mail\f1
