calmsacibis995/irix-6517-src/eoe/man/man4/limits.4
'\"!  tbl | mmdoc
'\"macro stdmacro
.if n .pH g4.limits @(#)limits	30.4 of 4/2/86
.nr X
.if \nX=0 .ds x} LIMITS 4 "" "\&"
.if \nX=1 .ds x} LIMITS 4 ""
.if \nX=2 .ds x} LIMITS 4 "" "\&"
.if \nX=3 .ds x} LIMITS "" "" "\&"
.TH \*(x}
.SH NAME
limits \- file headers for implementation-specific constants
.SH SYNOPSIS
.B #include <limits.h>
.br
.B #include <float.h>
.SH DESCRIPTION
The header files
.I <limits.h>
and \f2<float.h>\fP
is a list of various limits on resources that IRIX imposes on applications.
The limits in these headers fall into 3 main categories.
.TP 20
Numerical limits
These specify the maximum and minimum representable numbers for the fundamental
"C" types (integer, float, etc.).
.TP
Minimum resource limits
These specify the minimum limits on certain resources. These are usually
specified by either the POSIX or XPG standards.
Many of these have higher actual limits that are available at runtime via
the \f4sysconf\fP(3C) or \f4pathconf\fP(2) system calls.
.TP
Resource limits
These are real non-varying resource limits imposed by the system.
.SH "SEE ALSO"
\f4sysconf\fP(3C), \f4fpathconf\fP(2), \f4pathconf\fP(2)
'\".so /pubs/tools/origin.att
