calmsacibis995/irix-6517-src/eoe/man/man4/llc2template.4
.TH LLC2TEMPLATE 4 "Network Files" " "
\" SpiderX.25 Manual Pages - Acknowlegements to Berkeley SCCS @(#) llc2tplate.4 5 5/12/92
\"
\"	Modifications:
\"	22nd Nov 90	TR	Made param names same as help info.
\"
\"						
.SH NAME
llc2template \- Description of LLC2 configuration file
.SH DESCRIPTION
An LLC2 configuration file contains 14 lines of
various parameters. 
Configuration of the llc2 driver is performed by
.IR "lltune"(1M) 
using files with this format.
These parameters are detailed
below:
.PP 
.IP " 1)  \fBN2_VAL\fR" 12
Maximum number of times that a Protocol Data Unit is sent following
the expiry of the Acknowledgement Timer, the P-bit timer, or the Reject
Timer.  This parameter also limits the number of times an RR is sent with 
the P-bit set when remote busy is true and the Busy timer expires.

.IP " 2)  \fBT1_VAL\fR" 
The time interval during which the LLC expects to receive an
acknowledgement to an outstanding I Protocol Data Unit(PDU)  or an expected
response to a sent unnumbered PDU (units in 0.1 seconds).

.IP " 3)  \fBTPF_VAL\fR" 
The time during which the LLC2 expects to receive a PDU with
the F-bit set to 1 in response to a command with the P-bit
set to 1. Value is in 0.1 second units and should be less than
the value specified for the Acknowledgement Timer.
 
.IP " 4)  \fBTREJ_VAL\fR" 
The time interval during which the LLC2 expects to receive a reply
to a sent REJ TPDU (units in 0.1 seconds).
 
.IP " 5)  \fBTBUSY_VAL\fR" 
The time interval during which the LLC2 waits for an indication of
the clearance of a busy condition at the other LLC2 (units in 0.1 seconds).
 
.IP " 6)  \fBTIDLE_VAL\fR" 
The time interval during which the LLC2 expects to receive a PDU
from the other LLC2.
 
.IP " 7)  \fBACK_DELAY\fR" 
RR delay time (units in 0.1 seconds).
 
.IP " 8)  \fBNOTACK_MAX\fR" 
Maximum number of unacknowledged  Rx I-frames.
 
.IP " 9)  \fBTX_WINDOW\fR" 
Transmit window (if no XID received).
 
.IP "10)  \fBTX_PROBE\fR"
The position before the window is closed at which an I PDU
is sent with the P-bit set to solicit an acknowledgement from
the receiver.

.IP "11)  \fBMAX_I_LEN\fR" 
Maximum size of LLC2 I frame. LLC2 requires all incoming I frames
above a certain size to be rejected by a FRMR.  
This parameter specifies the maximum size of
data you may receive starting from the LLC2 protocol header.
.sp 1
In a X.25 network, it is constructed as (maximum X.25 data length + X.25
protocol header length + LLC2 protocol header length).
In a SNA network, it is constructed as (maximum SNA data length + SNA
request header length + SNA transmission header length + LLC2 protocol
header length).
.IP "12)  \fBXID_WINDOW\fR" 
XID window size (receive window),
when the remote window size is unknown or zero.
 
.IP "13)  \fBXID_NDUP\fR" 
Duplicate MAC XID count (0 means no test).
 
.IP "14)  \fBXID_TDUP\fR" 
Duplicate MAC XID time (units in 0.1 seconds).
.PP
.SH SEE ALSO
lltune(1M).
