calmsacibis995/irix-6517-src/eoe/man/man4/mtab.4
.TH mtab 4
.SH NAME
mtab \- mounted filesystem table
.SH DESCRIPTION
.I /etc/mtab
contains a table of filesystems currently mounted by the
.IR mount (1M)
command.
.IR umount (1M)
removes entries from this file.
.PP
The file contains a line of information for each mounted filesystem,
structurally identical to the contents of
.IR /etc/fstab ,
described in
.IR fstab (4).
There are a number of lines of the form:
.Ex
\f2filesystem\ \ directory\ \ type\ \ options\ \ frequency\ \ pass\f1
.Ee
The
.BR dev ,
.BR port ,
.BR map ,
and
.B indirect
options are specific to
.I /etc/mtab
and are used by NFS system programs.
.PP
The file is accessed by programs using
.IR getmntent (3),
and by the system administrator using a text editor.
.SH EXAMPLES
.Ex
/dev/root / xfs rw,raw=/dev/rroot 0 0
/dev/usr /usr xfs rw,raw=/dev/rusr 0 0
bonnie:/src /net/src nfs ro,hard,bg,intr,dev=1200 0 0
.Ee
.SH FILES
/etc/mtab
.SH "SEE ALSO"
mount(1M),
getmntent(3),
fstab(4).
