calmsacibis995/irix-6517-src/eoe/man/man4/mtune.4
.nr X
.if \nX=0 .ds x} mtune 4 ""  "\&"
.TH \*(x}
.SH NAME
mtune \- default system tunable parameters
.SH DESCRIPTION
The directory \f4/var/sysgen/mtune\f1 contains information
about all the system tunable parameters, including default values.
The files in this directory should never be changed.
Instead, use
the \f4systune\f1(1M) utility to change parameters
in the \f4/var/sysgen/stune\f1 file.
.P
Each loadable module can have its own \f4mtune\fP file, which is placed
in the \f4mtune\fP directory and has the same name as the module.
Parameters in an \f4mtune\f1 file may be grouped together in groups,
according to the nature of the parameters.
For example, all parameters dealing with
the number of processes that can run on the system at any given
time are grouped together in the \f4numproc\f1 group in the \f4kernel\fP
module.
The syntax of an \f4mtune\f1 module file is given below:
.IP
[\f2group_name\f1: [\f2flag\f1]]
.br
\f2parameter_clauses\f1
.P
Names that end with a colon character, \f4:\f1, are group names.
Parameters can be grouped together in groups
so that one sanity checking function can be used to verify the values
and the dependencies between these variables.
The group name is optional if there is only one group in the module.
For this case,
the configuration tools use the module name as the group name.
.P
The group name is followed by a flag.
The flag can be either \f4run\fP or \f4static\fP.
If the flag is \f4run\f1,
this group of tunable variables can be changed with the command
\f4systune\f1 on a running system.
Otherwise, the variables
are set at initialization time and can be changed only by creating a
new kernel and booting that kernel.
Modules with no group specifier or a group specifier without a flag
default to \f4static\fP.
.P
Each tunable parameter is specified by a single line, a parameter clause,
in the file.
Blank lines and lines beginning with \f4#\f1 or \f4*\f1 are considered
comments and are ignored.
The syntax for each line is:
.IP
\f2name\f1[,\f2tag\f1] \f2default_value\f1 [[\f2min_value\f1 [\f2max_value\f1 [ll|LL]]
.TP 17
\f2name\f1
The name of the tunable parameter.
It is used to pass
the value to the system when a kernel is built or changed by \f4systune\f1
command.
Since this name is made into a global variable name, using a long descriptive
name is useful to avoid any name collisions.
.TP
\f2tag\f1
This optional field is separated from \f2name\f1 by a comma.
It is used to qualify whether the tunable parameter should be used in the
configuration being built.
This allows a single \f4tune\fP file to be used in multiple
different configurations.
Parameters without any \f2tag\f1 are always used, those with a \f2tag\f1
are only used if the tag matches one of the \f2tag\f1s specified
in the \f4system\fP file (see \f4system\fP(4)).
Only one \f2tag\f1 is permitted on a given line.
.TP
\f2default_value\f1
The default value of the tunable parameter.
If the value
is not specified in the \f4stune\f1 file, this value is used when
the system is built.
This value is mandatory.
.TP
\f2min_value\f1
The minimum allowable value for the tunable parameter.
If the
parameter is set in the \f4stune\f1 file, the \f4lboot\f1 command checks
that the new value is equal to or greater than this value.
The
command \f4systune\f1 also verifies the new value against this value
before changing the system.
This field is optional; a value of 0 is equivalent to not specifying a value.
.TP
\f2max_value\f1
The maximum allowable value for the tunable parameter.
If the
parameter is set in the \f4stune\f1 file, the \f4lboot\f1 command checks
that the new value is equal to or less than this value.
The
command \f4systune\f1 also verifies the new value against this value
before changing the system.
This field is optional; a value of 0 is equivalent to not specifying a value.
.TP
\f4ll\fP|\f4LL\fP
By default, each tunable parameter is represented by an global variable
in the kernel of type int (32 bits).
Some tunable parameters may need to be specified as 64 bit quantities.
Adding
an \f4ll\fP or \f4LL\fP to the end of the parameter specification causes
\f4lboot\fP to represent the parameter as a \f4long long\fP.
.RE
.SH FILES
.PD 0
.TP 23
/var/sysgen/mtune/*
default system tunable parameters
.TP
/var/sysgen/stune
local settings for system tunable parameters
.TP
/var/sysgen/system/*
master system configuration files
.PD
.SH SEE ALSO
lboot(1M),
systune(1M),
stune(4),
system(4).
