calmsacibis995/irix-6517-src/eoe/man/man4/netgroup.4
'\"macro stdmacro
.if n .pH man4.netgroup @(#)netgroup	30.3 of 2/1/86
.TH NETGROUP 4
.SH NAME
netgroup \- list of network groups
.SH DESCRIPTION
.IX  "netgroup file"  ""  "\fLnetgroup\fP \(em network groups list"
.I Netgroup
defines network-wide groups,
used for permission checking when doing
remote mounts, remote logins, and remote shells.
For remote mounts, the information in 
.I netgroup
is used to classify machines;
for remote logins and remote shells,
it is used to classify users.
Each line of the
.I netgroup
file defines a group and has the format
.IP
 groupname member1 member2 ....
.PP
where member\f2i\fP\| is either another group name, or a triple:
.IP
 (hostname, username, domainname)
.RS
.TP 17
 hostname:
The ``preferred'' name of the client host, the host from which
the \f2rlogin\fP(1C) or \f2rsh\fP(1C) command is invoked.  Note
that the preferred name is the first name given to that host in the
.I /etc/hosts
file.  The second and later names are the \f2aliases\fP
for that preferred name.  The preferred name is commonly the
fully-qualified ``domain-style'' name.
.TP
.SM
 username:
This is the simple user name string.
.TP
.SM
 domainname:
This is the name of the domain of the \f2server\fP system, not
the client system.
.RE
.\"----- May want to include the examples mentioned in bug 142892
.PP
Any of three fields can be empty,
in which case it signifies a wild card.
Thus
.IP
 universal (,,)
.PP
defines a group to which everyone belongs.
Field names that begin with something other than a letter, digit or underscore
(such as ``-'') work in precisely the opposite fashion. 
For example, consider the following entries:
.IP
 justmachines	(analytica,-,sun)
 justpeople	(-,babbage,sun)
.PP
The machine
.I analytica
belongs to the group
.I justmachines
in the domain
.IR sun ,
but no users belong to it.
Similarly, the user
.I babbage
belongs to the group 
.I justpeople
in the domain
.IR sun ,
but no machines belong to it. 
.SH CAVEATS
The netgroup data is used only when the \fBnsd(1M)\fP daemon is running.
It is supported in any of the protocol libries included with Irix, but
only one protocol may be used.  Listing multiple protocols on the netgroups
line in \fBnsswitch.conf(4)\fP is not well defined.
.SH FILES
/etc/netgroup
.SH "SEE ALSO"
getnetgrent(3Y), innetgr(3Y), nsd(1M), nis(7P), nsswitch.conf(4)
