calmsacibis995/irix-6517-src/eoe/man/man4/networks.4
'\"macro stdmacro
.if n .pH man4.networks @(#)networks	30.3 of 2/1/86
.TH NETWORKS 4
.SH NAME
networks \- network name database
.SH DESCRIPTION
.IX  "networks file"  ""  "\fLnetworks\fP \(em network name database"
The
.B /etc/networks
file contains information regarding
the known networks which comprise the Internet.
For each network a single line should be present with the following information:
.RS 3
.IP \(bu 2
official network name
.IP \(bu 2
network number
.IP \(bu 2
aliases (optional)
.RE
.PP
Items are separated by any number of blanks and/or tab characters.
A ``#'' indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
.PP
Network number may be specified in the conventional
``.'' notation using the \f2inet_network\fP() routine
from the Internet address manipulation library,
.IR inet (3N).
Network names may contain any printable character other than a field
delimiter, newline, or comment character.
For example,
.Ex
loopback    127    loopback-net
.Ee
.PP
For hosts connected to the Internet,
this file can be created from the official network database
maintained at the Network Information Control Center (NIC), though local
changes may be required to bring it up-to-date regarding unofficial aliases
and/or unknown networks.
.SH FILES
/etc/networks
.PP
If the 
.SM NFS
option is installed and NIS is running, 
the \f2getnetent\f1(3N) library routines do not access this file.
.SH "SEE ALSO"
getnetent(3N)
.SH BUGS
The Internet name server should be used instead of a static file.
A binary indexed file format should be available for fast access.
'\".so /pubs/tools/origin.bsd
