calmsacibis995/irix-6517-src/eoe/man/man4/nsswitch.conf.4
.TH nsswitch.conf 4
.SH NAME
nsswitch.conf \- name service configuration file
.SH SYNOPSIS
.nf
/etc/nsswitch.conf, /var/ns/domains/*/nsswitch.conf
.fi
.SH DESCRIPTION
This file controls the behavior of the name service daemon
.IR nsd (1M).
It is read by the daemon on startup and is used to build a
filesystem maintained by nsd typically mounted on \fB/ns\fR.
The paths are of the format \fB/ns/domain/table/protocol/key\fR.
Each nsswitch.conf file results in a domain directory under \fB/ns\fR.
The \fB/etc/nsswitch.conf\fR file corresponds to \fB/ns/.local\fR, while each
file in \fB/var/ns/domains/DOMAINNAME/nsswitch.conf\fR will result in
a directory \fB/ns/DOMAINNAME\fR.
.LP
The file contains a list of maps supported by the daemon and a list
of protocols to use to obtain data for each map.
Anything following the comment character '#' will be ignored.  Each
line represents a different map (or a domain wide attribute list, see below).
It contains the name of the map (or an alias, see below), followed
by a list of protocols to be used in the order in which they should be called:
.nf
.in +.5i
map: protocol1 protocol2 protocol3 ... protocolN
.in -.5i
.fi
Each of these items can include any character but '/' up to 255 characters.
If they include whitespace then they should be quoted using the
double-quote character '"'.
.LP
The default list of protocols that are supported via shared libraries
includes: 
.TP 12
.B files
Traditional text files from /etc
.TP 12
.B dns
Domain name service.
.TP 12
.B ldap
Lightweight Directory Access Protocol version 2.
.TP 12
.B mdbm
Mdbm database format files.
.TP 12
.B ndbm
Ndbm database format files.
.TP 12
.B db
Berkeley db database format files.
.TP 12
.B nis
Network Information Services (formerly YP) client.  This is an optional
product. 
.TP 12
.B nisserv
Network Information Services (formerly YP) server.  This is an optional
product. 
.LP
Any standard map that does not have a configuration entry in nsswitch.conf
will be assigned a default value.  Aliases for the standard maps exist to
simplify the file.  If a well known tabled is not listed in the
/etc/nsswitch.conf file, a default value is used.  The maps, aliases, and
defaults are:
.TP 12
.B aliases
for mail.aliases and mail.byaddr
.br
Default value is:
.in 20
aliases(null_extend_key): ndbm(file=/etc/aliases) nis
.TP 12
.B capability
for capability.byname
.br
Default value is:
.in 20
capability: files nis
.TP 12
.B clearance
for clearance.byname
.br
Default value is:
.in 20
clearance: files nis
.TP 12
.B ethers
for ethers.byname and ethers.byaddr
.br
Default value is:
.in 20
ethers: files nis
.TP 12
.B group
for group.byname and group.bygid
.br
Default value is:
.in 20
group: files nis
.TP 12
.B hosts
for hosts.byname and hosts.byaddr
.br
Default value is:
.in 20
hosts: nis dns files
.TP 12
.B mac
for mac.byname and mac.byvalue
.br
Default value is:
.in 20
mac: files nis
.TP 12
.B mail
for mail.aliases and mail.byaddr
.br
Default value is:
.in 20
aliases(null_extend_key): ndbm(file=/etc/aliases) nis
.TP 12
.B netgroup
for netgroup.byname, netgroup.byhost and netgroup.byuser
.br
Default value is:
.in 20
netgroup: nis
.TP 12
.B networks
for networks.byname and networks.byaddr
.br
Default value is:
.in 20
networks: files nis
.TP 12
.B passwd
for passwd.byname and passwd.byuid
.br
Default value is:
.in 20
passwd: files(compat) [notfound=return] nis
.TP 12
.B protocols
for protocols.byname and protocols.bynumber
.br
Default value is:
.in 20
protocols: nis [success=return] files
.TP 12
.B rpc
for rpc.byname and rpc.bynumber
.br
Default value is:
.in 20
rpc: files nis
.TP 12
.B services
for services.byname and services.byport
.br
Default value is:
.in 20
services: files nis
.TP 12
.B shadow
for shadow.byname
.br
Default value is:
.in 20
shadow(mode=0700): files
.TE
.LP
The daemon uses extended attributes attached to each object in the tree
to control the behavior of lookups.  An attribute is specified by a
key and value pair list in parenthesis:
.nf
.in +.5i
(key1=value1, key2=value2, key3=value3)
.in -.5i
.fi
A set of global attributes can be given to nsd on the command line see
\fInsd(1M)\fR.  Attributes on the domain are given on a line of their
own anywhere in the nsswitch.conf file.  Attributes on the map are
given immediately following the map on a line, and attributes on the
protocol are given immediately following the protocol name on a line.
Attributes are inherited from above, so if an attribute does not exist
on a protocol then it is inherited from the attribute list on the map,
and if it does not exist on the map then it is inherited from the
domain, and if not from the domain then from the global attributes.  If
the value is not specified then it is considered a boolean true.  All
keys and values are strings, but may be interpreted internally as numbers
or boolean values.
.nf
.in +.5i
(key1=value1, key2=value2) 
map1(key1=value1, key3=value3): protocol1(key1=value1) \\
protocol2 
.in -.5i
.fi
.LP
Most of the attributes are protocol specific and are listed in the manual
page for each attribute.  Those attributes that are global in meaning are
listed in the \fInsd(1M)\fR manual page.
.LP
A control can be placed between any two protocols on the line.  The
control is a state control pair in a set of square brackets.  These are
used to force non-standard behavior in a file.  The states are one of
\fBsuccess\fR, \fBnotfound\fR, \fBunavail\fR, \fBtryagain\fR and
\fBnoperm\fR.  The controls are \fBreturn\fR and \fBcontinue\fR:
.nf
.in +.5i
map: protocol1 protocol2 [state=control] protocol3
.in -.5i
.fi
A partial example configuration using attributes and controls is:
.Ex
.nf
.in +.5i
(timeout=100)
hosts: files(timeout=1000) dns
passwd(timeout=10): files(compat) [notfound=return] nis
phone: files(filename=/usr/local/phone, separator=":")
.in -.5i
.fi
.Ee
.fi
.LP
This sets a default cache file timeout of 100 seconds for the domain
represented by this file.  The domain contains five maps hosts.byname,
hosts.byaddr, passwd.byname, passwd.byuid and phone.  Entries in the
hosts.byname and hosts.byaddr maps are identical. First nsd looks in a
local ASCII file, then it calls out to a dns server which answers for
the domain (as specified in the dns configuration file
\fB/etc/resolv.conf\fR, see \fIresolver(4)\fR).  Host entries looked up in the
local file are given a longer cache timeout of 1000 seconds.  The
passwd.byname and passwd.byuid maps are identical.  First nsd will look
in the local ASCII file then it will call out to an nis server
answering for this domain.  If the key does not exist in the local file
then we force nsd to return immediately without ever calling out the
nis.  However, the files library is given the "compat" flag which will
cause it to expand +/- escapes for password lookups using the following
libraries.  Thus, every user must exist in the local passwd file, but if a
+/- escape exists for them in the file the nis protocol is used to expand
it. The phone map is a non-standard map.  The data is kept in a simple
ASCII file \fB/usr/local/phone\fR of the format "key:data". 
.FP
For the local domain \fI/etc/nsswitch.conf\fP if required tables are
missing then the nsd daemon will add the table with default values.  If you
wish to override this behavior then you should add a line for the table
with no protocols, such as:
.nf
.in +.5i
shadow.byname:
.in -.5i
.fi
.FP
After editing any nsswitch.conf file the nsd daemon must be sent a
SIGHUP signal to reread the configuration.  You can do this by running
\fBkillall -HUP nsd\fP.  This will not change the contents of the system
wide cache.   To restart nsd and clear the cache use the \fBnsadmin
restart\fR command.
.LP
The following shows how to set an attribute for any level in the /ns
namespace:
.TP 8
.B global
Set attributes in the /ns namespace via the -a nsd command line option.
.TP 8
.B domain
Set attributes in the /ns/DOMAIN namespace by using (attribute=value) by
itself in the domain's nsswitch.conf file.
.TP 8
.B table (map)
Set attributes in the /ns/DOMAIN/TABLE namespace by appending
(attribute=value) to the name of the TABLE before the colon.
.TP 8
.B protocol 
Set attributes for in the /ns/DOMAIN/TABLE/PROTOCOL namespace by appending
(attribute=value) to the name of the PROTOCOL library.
.TP 8
.B single key
Set attributes in for /ns/DOMAIN/TABLE/[PROTOCOL/]/key 
by appending (attribute=value) to the name of the key when accessing the
file via the libc interfaces or inside of the /ns filesystem.
.SH BUGS
Most versions of sendmail do not use UNS to resolve aliases lookups.  
You may have to modify /etc/aliases or /etc/sendmail.cf to get sendmail to 
resolv aliases via NIS or nsd.
.SH FILES
/etc/nsswitch.conf,
/var/ns/domains/*/nsswitch.conf
.SH SEE ALSO
nsd(1M), nsadmin(1M)
nis(7P), nisserv(7P), dns(7P), files(7P), mdbm(7P), ldap(7P)
.PP
\f2IRIX Admin: Networking and Mail\f1
.PP
\f2IRIX Admin: NFS and NIS\f1
