calmsacibis995/irix-6517-src/eoe/man/man4/passwd.4
'\"macro stdmacro
'\" portions from NFS4.1 man/man5/passwd.5
'\" portions from 4.3BSD-reno src/share/man/man5/passwd.5
.\" Copyright (c) 1988 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted provided
.\" that: (1) source distributions retain this entire copyright notice and
.\" comment, and (2) distributions including binaries display the following
.\" acknowledgement:  ``This product includes software developed by the
.\" University of California, Berkeley and its contributors'' in the
.\" documentation or other materials provided with the distribution and in
.\" all advertising materials mentioning features or use of this software.
.\" Neither the name of the University nor the names of its contributors may
.\" be used to endorse or promote products derived from this software without
.\" specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR IMPLIED
.\" WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)passwd.5	6.6 (Berkeley) 6/23/90
.TH passwd 4
.SH NAME
passwd \- password file
.SH DESCRIPTION
.I /etc/passwd
is an
ASCII
file containing entries for each user.
Each field within each user's entry
is separated from the next by a colon.
Each user is separated from the
next by a newline.
An entry beginning with # is ignored.
.LP
The
.I passwd
file contains the following information for each user:
.IP name 10
User's login name \-\- consists of alphanumeric characters
and must not be greater than eight characters long.
It is recommended that the login name consist of a leading
lower case letter followed by a combination of digits
and lower case letters for greatest portability across multiple
versions of the UNIX operating system.
This recommendation can
be safely ignored for users local to IRIX systems.
The
.IR pwck (1M)
command checks for the greatest possible portability on names,
and complains about user names that do not cause problems
on IRIX.
.IP password 10
Encrypted password and optional password aging information.
If the password field is null (empty), no password is demanded when
the user logs in.
If the system is configured to use shadow passwords,
this field of
.I /etc/passwd
is ignored by all programs that do password checking.
See
.IR pwconv (1M)
for information about shadow passwords.
.IP "numerical user ID" 10
This is the user's ID in the system and it must be unique.
.IP "numerical group ID" 10
This is the number of the default group that the user belongs to.
.IP "user's real name" 10
In some versions of UNIX, this field also contains the user's office,
extension, home phone, and so on.
For historical reasons this field is
called the
GECOS
field.
The
.IR finger (1)
program can interpret
the
GECOS
field if it contains comma (``,'') separated subfields as follows:
.sp .8v
.RS
.PD 0
.TP 9
name
user's full name
.TP
office
user's office number
.TP
wphone
user's work phone number
.TP
hphone
user's home phone number
.PD
.RE
.IP
An & in the user's full name field stands for the login name
(in cases where the login name appears in a user's real name).
.RE
.IP "initial working directory" 10
The directory that the user is positioned in when they log in; this
is known as the home directory.
.IP shell 10
The program to use as the command interpreter (shell) when the user logs in.
If the
.I shell
field is empty, the Bourne shell (\f2/bin/sh\fP) is assumed.
If the first character of this field is an
.BR * ,
then the
.IR login (1)
program treats the home directory field as the directory to be
used as the argument to the
.IR chroot (2)
system call, and then loops back to reading the
.I /etc/passwd
file under the new root, reprompting for the login.
This can be used to implement secure or restricted logins, in
a manner similar to
.IR ftp (1C).
.LP
Password aging is used for a particular
user if his encrypted password is followed by a
comma and a non-null string of characters from a 64-character alphabet
(.,/,0-9, A-Z, a-z) parsed left to right by
.IR a64l (3)).
The first character of the age, \f2M\f1 say, denotes the maximum
number of weeks for which a password is valid.
A user who attempts to
login after his password has expired is forced to change his
password.
The next character, \f2m\f1 say, denotes the minimum period
in weeks that must expire before the password can be changed.
If the second character is omitted, zero weeks is the default minimum.
\f2M\f1 and \f2m\f1 have
numerical values in the range 0\-63 that correspond to the 64-character
alphabet shown above (\f3/\f1 = 1 week, \f3z\f1 = 63 weeks).
The remaining characters are the weeks since the epoch
when the password was last changed.
If
\f2m\f1 = \f2M\f1 = 0 (derived from the string \f3.\f1 or \f3..\f1) the
user is forced to change his password the next time he logs in
(and the age disappears from his entry in the password file).
If \f2m\f1 > \f2M\f1
only the superuser is able to change the password.
The password must have been previously changed and therefore have a valid last
change date in the aging field for this \f2m\f1 > \f2M\f1 mechanism to 
control password manipulation.  Simply putting \f3./\f1 as the aging string
will be interpreted by \f3login\f1 as an expired password (because the
last changed date is 0), and the automatic
invocation of \f3passwd\f1 by \f3login\f1 will fail due to the \f2m\f1 > \f2M\f1
mechanism.
.LP
The password file resides in the
.I /etc
directory.
Because of the encrypted passwords,
it has general read permission and can be used,
for example, to map numerical user ID's to names.
.SH "NIS ENTRIES"
If the
NFS
option is installed, the
.I passwd
file can also have lines beginning with a
.RB ` + '
(plus sign)
which means to incorporate entries from the NIS.
There are three styles of
.B +
entries in this file:
.IP + 13
Means to insert the entire contents
of the NIS password file at that point.
.IP +name
Means to insert the entry (if any) for
.I name
from the NIS at that point.
.IP +@netgroup
Means to insert the entries for all members of the network group
.I netgroup
at that point.
.LP
If a + entry has a non-empty password, directory, GECOS, or
shell field, the value of that field overrides what is
contained in the NIS.
The
.I uid
and
.I gid
fields cannot be overridden.
.LP
The
.I passwd
file can also have lines beginning with a
.RB ` \- '
(minus sign)
which means to disallow entries from the NIS (or from local use).
There are two styles of
.RB ` \- '
entries in this file:
.IP \-name 13
Means to disallow any subsequent entries (if any) for
.I name
(in this file or in the NIS).
.IP \-@netgroup
Means to disallow any subsequent entries
for all members of the network group
.IR netgroup .
.LP
Password aging is not supported for NIS entries.
.SH UID CONVENTIONS
User ID number restrictions and conventions in the UNIX community are
few and simple.
.LP
Reserved:
.RS
.IP "UID 0" 14
The superuser (aka root).
.IP "UID \-2"
NFS 'nobody'.
Note that because uid_t is unsigned, -2 is mapped to
the special value 60001 by NFS.
.IP "UID 60001 and 60002"
For historical reasons, these values correspond to the users ``nobody''
and ``noaccess'', respectively.
It is recommended that you not allocate
these values to real users.
.RE
.LP
Conventions:
.RS
.IP "UID 1 to 10" 14
Commonly used for system pseudo users and daemons.
.IP "UID 11 to 99"
Commonly used for uucp logins and 'famous users'.
.IP "UID 100 to 2147483647 (except for 60001 and 60002)"
Normal users (start at 100).
For historical reasons certain operations
are restricted for uids larger than 65535.
Most significantly, these
users cannot own files on an
.IR efs (4)
filesystem.
This also means that
they cannot run a program that allocates a
.IR pty (7M)
(for example,
.IR vi (1)
and
.IR xwsh (1G))
if \f2/dev\f1 resides on an
.IR efs (4)
filesystem.
.IP
For these reasons, we recommend that large uids only be used on
.IR xfs (4)
based systems.
.RE
.SH EXAMPLE
.PP
Here is a sample
.I /etc/passwd
file:
.Ex
root:q.mJzTnu8icF.:0:10:superuser:/:/bin/csh
.br
bill:6k/7KCFRPNVXg,z/:508:10:& The Cat:/usr2/bill:/bin/csh
.br
+john:
.br
+@documentation:no-login:
.br
+::::Guest
.br
nobody:*:-2:-2::/dev/null:/dev/null
.Ee
In this example, there are specific entries for users
.I root
and
.IR bill ,
to assure that they can log in even when
the system is running stand-alone or when the NIS is not running.
The user
.I bill
has 63 weeks of maximum password aging and 1 week of minimum
password aging.
Programs that use the
GECOS
field replace the & with `Bill'.
The user
.I john
has his password entry in the NIS
incorporated without change;
anyone in the netgroup
.I documentation
has their password field disabled,
and anyone else is able to log in with their usual password,
shell, and home directory, but with a
GECOS
field of
.I Guest.
The user
.I nobody
cannot log in and
is used by the
.IR exportfs (1M)
command.
.SH FILES
/etc/passwd
.SH "SEE ALSO"
login(1),
passwd(1),
pwck(1M),
pwconv(1M),
ypchpass(1),
yppasswd(1),
a64l(3C),
crypt(3C),
getpwent(3C),
exports(4),
group(4),
netgroup(4),
shadow(4).
