calmsacibis995/irix-6517-src/eoe/man/man4/peer_encaps_config.4
.TH peer_encaps_config 4
.SH NAME
peer_encaps_config \- SNMP version one subagent encapsulator configuration
.SH SYNOPSIS
.nf
/etc/peer_encaps_config
.fi
.SH DESCRIPTION
This file controls the behavior of the
.IR peer_encaps (1M)
daemon.  It contains information about each SNMP version one subagent that
runs on the local system.  The peer_encaps daemon registers each subtree
with the peer_snmpd master daemon, then for each request converts the
possibly version two protocol request into version one packets and forwards
it to the encapsulated subagent.  Each response is then converted back into
the requesting version and sent back.
.LP
The format of this file is:
.in +.5i
[AGENT [ON HOST <ip>] [AT PORT <port>] [WITH COMMUNITY community] SUBTREES <treelist> [FORWARD traplist TRAPS] ; ]+

ip ::= <hostname> | <ipaddr>

ipaddr ::= <d>.<d>.<d>.<d>

d ::= 0..255

port ::= 1..65535

community ::= <string> | <hexstring>

hexstring ::= 0x<hexdigits>

treelist ::= oid | oid , treelist

oid ::= decimal  | decimal . oid

decimal ::= 0..4294967295

traplist ::= ALL | NO | onlylist | exceptlist

onlylist ::= ONLY kindlist

exceptlist ::= ALL EXCEPT kindlinst

kindlist ::= kind | kind , kindlist

kind ::= enterpise generic

enterprise ::= ANY | ENTERPRISE oid

generic ::= coldStart | warmStart | linkDown | linkUp | authenticationFailure | egpNeighborLoss | specific

specific ::= enterpriseSpecific (s)

s ::= d | range

range ::= d .. d

.in -.5i
.fi
where constructs in braces "[]" are optional, and constructs enclosed
in braces "[]" and followed by a '+' may be repeated one or more times
(at least one occurance must be present).

Each line must begin with an \fBAGENT\fP keyword followed by the information
about that agent.  You can have the requests sent to a different system
using the optional \fBON HOST\fP keywords followed by a hostname or address
of the remote system.  You should almost always specify an alternate port
using the \fBON PORT\fP keyword followed by a port number, since the master
agent \fBpeer_snmpd(1M)\fP is typically running on the default SNMP port.
You can specify the community information using the \fBWITH COMMUNITY\fP
keywords followed by the community information which overrides the community
string from the request.  You must always specify a list of subtrees
using the \fBSUBTREES\fP keyword followed by a comma separated list of
SNMP OIDs.  Finally, you can specify a list of traps to forward using
the \fBFORWARD\fP keyword followed by a trap specification and ending
with the \fBTRAPS\fP keyword.

An example follows:
.in +.5i
.nf
AGENT AT PORT 1161 WITH COMMUNITY public
SUBTREES        1.3.6.1.2.1.1,
                1.3.6.1.2.1.2,
                1.3.6.1.2.1.3,
                1.3.6.1.2.1.4,
                1.3.6.1.2.1.5,
                1.3.6.1.2.1.6,
                1.3.6.1.2.1.7,
                1.3.6.1.2.1.8,
                1.3.6.1.4.1.59
FORWARD ALL TRAPS;
.in =.5i
.fi
This specifies a subagent running on the local system UDP port 1161 which
handles a number of SNMP subtrees.  All requests are forwarded using the
public community, and all traps are forwarded.
.SH NOTE
The peer_encaps daemon is based on PEER Networks' OptiMate product.
PEER Networks is a division of BMC Software Inc.
.SH FILES
/etc/peer_encaps_config
.SH SEE ALSO
peer_encaps(1M),
peer_snmpd(1M),
