calmsacibis995/irix-6517-src/eoe/man/man4/profile.4
.nr X
.if \nX=0 .ds x} profile 4 ""  "\&"
.TH \*(x}
.SH NAME
profile \- setting up an environment at login time
.SH SYNOPSIS
.nf
\f3/etc/profile\f1
\f3$HOME/.profile\f1
.fi
.SH DESCRIPTION
All users who have the shell, \f2sh\f1(1), as their login command
have the commands in these files executed as part of their
login sequence.
.P
.I /etc/profile
allows the system administrator to perform services for the entire
user community.
Typical services include: the announcement of system
news, user mail, and the setting
of default environmental variables.
It is not unusual for \f2/etc/profile\f1
to execute special actions for the \f3root\f1
login or the \f2su\f1(1M) command.
.P
The file
.I $HOME/\&.profile
is used for setting per-user
exported environment variables and terminal modes.
The following example is typical (except for the comments):
.Ex
#  Set the file creation mask to prohibit
#  others from reading my files.
umask 027
#  Add my own /bin directory to the shell search sequence.
PATH=$PATH\f3:\fP$HOME/bin
#  Set terminal type
eval `tset -S -Q`
#  Set the interrupt character to control-c.
stty intr ^c
#  List directories in columns if standard out is a terminal.
ls()    { if [ -t ]; then /bin/ls -C $*; else /bin/ls $*; fi }
.Ee
.SH FILES
.PD 0
.TP 17
/etc/TIMEZONE
timezone environment
.TP
$HOME/.profile
user-specific environment
.TP
/etc/profile
system-wide environment
.PD
.SH SEE ALSO
env(1),
login(1),
mail(1),
sh(1),
stty(1),
su(1M),
tput(1),
tset(1),
terminfo(4),
timezone(4),
environ(5),
term(5).
.SH NOTES
Care must be taken in providing system-wide services
in \f2/etc/profile\f1.
Personal \f2.profile\f1 files are better for serving
all but the most global needs.
