calmsacibis995/irix-6517-src/eoe/man/man4/projid.4
.TH projid 4
.SH NAME
projid \- project name to project ID mapping file
.SH DESCRIPTION
Project IDs are stored internally by IRIX as numeric values.
However, the \f3/etc/project\f1 file specifies projects using
ASCII names.
The \f3/etc/projid\f1 file is used to map these ASCII
names to numeric values that IRIX can use.
.PP
Entries in \f3/etc/projid\f1 consist simply of a project name and
numeric project ID value, separated by a colon.
Each entry should be separated by a newline, and should contain no
white-space.
A ``#'' at the beginning of a line indicates a comment.
The numeric values for project IDs should be positive numbers.
Invalid entries may be ignored, or may have other undefined effects.
.PP
A simple \f3projid\f1 file might look like this:
.Ex
#
# projid file for ReallyBigCo Corporate Data Center
#
genuser:1
sysadm:2
guests:999
.Ee
.SH FILES
/etc/projid
.SH "SEE ALSO"
newproj(1),
project(4),
array_sessions(5),
projects(5).
.SH BUGS
Projid information cannot currently be obtained via NIS.
