calmsacibis995/irix-6517-src/eoe/man/man4/project.4
.TH project 4
.SH NAME
project \- project membership file
.SH DESCRIPTION
The \f3/etc/project\f1 file contains for each user a comma separated
list of all projects for which the user is authorized.
For example, an entry for the user "rdb" might look like this:
.Ex
rdb:genuser,sysadm,kerndev
.Ee
which indicates that "rdb" is authorized for the projects
\f3genuser\f1, \f3sysadm\f1 and \f3kerndev\f1.
.PP
The first project in a user's entry is considered to be the user's
default project, and will be assigned to the user's array session
during login.
The user can switch to the other projects using the \f2newproj\f1(1)
command.
.PP
\f3project\f1 is an ASCII file.
A "#" at the beginning of a line indicates a comment.
The "#" is only recognized at the beginning of a line, it should not be
used after the project list.
The user name and project list fields are separated by colons;
each user is separated from the next by a new-line.
Except at the beginning of each line, white-space is not ignored, thus
in most cases there should be no spaces e.g.\& in the project list.
.PP
This file resides in the \f3/etc\f1 directory.
Because it contains no passwords, it can and does have general read
permission.
.PP
Like user and group ids, project ids are stored as numeric values by
IRIX.
The mapping from ASCII
project names to numeric project ids is contained in the file
\f3/etc/projid\f1.
.PP
Users that do not have entries in the \f3project\f1 file or whose
entries contain only invalid project names will be assigned a system
default project ID.
This project ID is defined in the system variable \f3dfltprid\f1,
which can be examined and/or modified using \f2systune\f1(1).
.SH FILES
/etc/project
.SH "SEE ALSO"
newproj(1),
projid(4),
array_sessions(5),
projects(5).
.SH BUGS
Project information cannot currently be obtained via NIS.
