calmsacibis995/irix-6517-src/eoe/man/man4/protocols.4
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)protocols.5	6.2 (Berkeley) 5/6/86
.\"
.if n .pH man4.protocols @(#)protocols	30.3 of 2/1/86
.TH PROTOCOLS 4
.UC 5
.SH NAME
protocols \- protocol name database 
.SH DESCRIPTION
The
.B /etc/protocols
file contains information regarding the known protocols used in the
Internet.  For each protocol a single line should be present
with the following information:
.RS 3
.IP \(bu 2
official protocol name
.IP \(bu 2
protocol number
.IP \(bu 2
aliases (optional)
.RE
.PP
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
.PP
Protocol names may contain any printable
character other than a field delimiter, newline,
or comment character.
For example,
.Ex
tcp   6    TCP     # transmission control protocol
.Ee
.SH FILES
/etc/protocols
.PP
If the 
.SM NFS
option is installed and NIS is running, 
the \f2getprotoent\f1(3N) library routines do not access this file.
.SH "SEE ALSO"
getprotoent(3N)
.SH BUGS
A name server should be used instead of a static file.
'\".so /pubs/tools/origin.bsd
