calmsacibis995/irix-6517-src/eoe/man/man4/proto.4
'\"macro stdmacro
.TH PROTO 4
.SH NAME
proto \- prototype job file for at
.SH SYNOPSIS
.LP
.B /usr/lib/cron/.proto
.LP
.BI /usr/lib/cron/.proto. queue
.SH DESCRIPTION
.LP
When a job is submitted to
.IR at (1)
or
.IR batch (1),
the job is constructed as a shell script.  First, a prologue is
constructed, consisting of:
.IP \(bu 3
A header whether the job is an
.I at
job or a
.I batch
job (actually,
.I at
jobs submitted to all queues other than queue
.BR a ,
not just to the batch queue
.BR b ,
are listed as
.I batch
jobs); the header will be
.LP
.RS
.nf
.ft 3
: at job
.ft 1
.fi
.RE
.LP
for an
.I at
job, and
.LP
.RS
.nf
.ft 3
: batch job
.ft 1
.fi
.RE
.LP
for a
.I batch
job.
.IP \(bu
A set of Bourne shell commands to make the environment (see
.IR environ (5))
for the
.I at
job the same as the current environment;
.IP \(bu
A command to run the user's shell (as specified by the
.SM SHELL
environment variable) with the rest of the job file as input.
.LP
.I At
then reads a \*(lqprototype file,\*(rq and constructs the rest of the
job file from it.
.LP
Text from the prototype file is copied to the job file, except for
special \*(lqvariables\*(rq that are replaced by other text:
.RS
.TP
.B $d
is replaced by the current working directory
.PD 0
.TP
.B $l
is replaced by the current file size limit (see
.IR ulimit (2))
.TP
.B $m
is replaced by the current umask (see
.IR umask (2))
.TP
.B $t
is replaced by the time at which the job should be run, expressed as seconds
since January 1, 1970, 00:00 Greenwich Mean Time, preceded by a colon
.TP
.B $<
is replaced by text read by
.I at
from the standard input (that is, the commands provided to
.I at
to be run in the job)
.PD
.RE
.LP
If the job is submitted in queue
.IR queue ,
.I at
uses the file
.BI /usr/lib/cron/.proto. queue
as the prototype file if it exists, otherwise it will use the file
.BR /usr/lib/cron/.proto .
.SH EXAMPLES
The standard
.B .proto
file supplied is:
.LP
.RS
.nf
.ft 3
#ident	"@(#)adm:.proto	1.2"
cd $d
ulimit $l
umask $m
$<
.ft 1
.fi
.RE
.LP
which causes commands to change the current directory in the job to the
current directory at the time
.I at
was run, to change the file size limit in the job to the file size limit
at the time
.I at
was run, and to change the umask in the job to the umask at the time
.I at
was run, to be inserted before the commands in the job.
.SH FILES
.PD 0
.TP 20
.B /usr/lib/cron/.proto
.LP
.BI /usr/lib/cron/.proto. queue
.PD 
.SH "SEE ALSO"
.IR at (1)
'\".so /pubs/tools/origin.att
