calmsacibis995/irix-6517-src/eoe/man/man4/resolver.4
.\" Copyright (c) 1986 The Regents of the University of California.
.\" All rights reserved.
.\"
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
.\"	@(#)resolver.5	5.9 (Berkeley) 12/14/89
.\"
.TH resolver 4
.SH NAME
resolver, resolv.conf \- host-address resolver configuration file (DNS/NIS)
.SH SYNOPSIS
.nf
/etc/resolv.conf
.fi
.SH DESCRIPTION
This file controls the behavior of then
.IR resolver (3N)
routines in the C library.
It is read
by these routines the first time they are invoked by a process.
.LP
The file is designed to be human readable and contains a list of
keywords with values that provide various types of resolver information.
The keyword and value must appear on a single line, and the keyword
(for example, \f3nameserver\fP) must start the line.
The value follows
the keyword, separated by white space.
.LP
This file is not necessary if
there is a name server running on the local machine and
the hostname contains the domain name.
It is necessary, however, if the system administrator wants
to override the default ordering of the host lookup services.
.TP 9
\f3nameserver\fP
Internet address (in dot notation) of a name server
that the resolver should query.
Up to three of these lines can be specified;
the resolver library queries them in the order listed.
If no \f3nameserver\fP entries are present,
the default is to use the name server on the local machine.
(The algorithm used is to try a name server, and if the query times out,
try the next, until out of name servers,
then repeat trying all the name servers
until a maximum number of retries are made.)
When specifying a \f3nameserver\fP entry for the local machine,
use the address 0 instead of the \f3localhost\f1 address of 127.1.
.TP
\f3domain\fP
Local domain name.
Most queries for names within this domain can use short names
relative to the local domain.
If no \f3domain\fP entry is present, the domain is determined
from the local hostname returned by
\f2gethostname\fP(2);
the domain part is taken to be everything after the first `.'.
Finally, if the hostname does not contain a domain part, the root
domain is assumed.
.TP
\f3search\fP
Search list for host-name lookup.
The search list is normally determined from the local domain name;
by default, it begins with the local domain name, then successive
parent domains that have at least two components in their names.
This can be changed by listing the desired domain search path
following the \f2search\fP keyword with spaces or tabs separating
the names.
Most resolver queries are attempted using each component
of the search path in turn until a match is found.
This process can be slow and generates a lot of network
traffic if the servers for the listed domains are not local.
Queries time out if no server is available
for one of the domains.
.IP
The first item in the list
becomes the default domain name; the remaining items are the
other domains to search after the default one.
.LP
The \f3domain\fP and \f3search\fP keywords are mutually exclusive.
If more than one instance of these keywords is present,
the last instance overrides.
.TP
\f3sortlist\fP
List of preferred networks.
The sortlist keyword is followed by a list of network addresses.  On each
lookup the address list is sorted according to the list of addresses.  If
multiple addresses match for a single subnet they are presented in the
order returned from the server.  The format of
the items of the list is a dotted quad with an optional slash '/' and netmask.
.IP
e.g. sortlist 130.155.160.0/255.255.240.0 130.155.0.0
.TP
\f3options\fP
A list of resolver options.  Currently the only supported option is \fBndots\fP
which specifies how many dots need to be in a name for the resolver to attempt
to lookup the name as a fully qualified name if the name does not contain a
trailing dot.  It is followed by a colon ':' and a number.  The default is
\fBndots:1\fP.
.SH NOTE
The
.B hostresorder
keyword is now ignored.  Resolve order for gethostbyname and gethostbyaddr
is now done in the nsswitch.conf file.
.P
In previous IRIX releases, the
.I resolv.conf
file was in the
.I /usr/etc
directory.
In order for pre-IRIX5 binaries that use BIND to work correctly,
a symbolic link from
.I /etc/resolv.conf
must be made to the old name.
.SH FILES
/etc/resolv.conf
.SH SEE ALSO
named(1M),
gethostbyname(3N),
resolver(3N),
hostname(5).
nsswitch.conf(3);
.PP
\f2IRIX Admin: Networking and Mail\f1
