calmsacibis995/irix-6517-src/eoe/man/man4/sccsfile.4
'\"macro stdmacro
.if n .pH @(#)sccsfile	30.4 of 3/25/86
.nr X
.if \nX=0 .ds x} SCCSFILE 4 "" "\&"
.if \nX=1 .ds x} SCCSFILE 4 ""
.if \nX=2 .ds x} SCCSFILE 4 "" "\&"
.if \nX=3 .ds x} SCCSFILE "" "" "\&"
.TH \*(x}
.tr ~
.\".bd S B 3
.ds K)  \f3\s-1DATA KEYWORDS\s+1\f1
.ds D)  \f3\s-1DDDDD\s+1\f1
.ds M)  \f3\s-1MR\s+1\f1
.ds S)  \s-1SCCS\s+1
.ds I)  \s-1SID\s+1
.SH NAME
sccsfile \- format of \s-1SCCS\s+1 file
.SH DESCRIPTION
An \*(S) (Source Code Control System) file is an \s-1ASCII\s+1 file.
It consists of six logical parts:
the
.IR checksum ,
the
.I "delta table"\^
(contains information about each delta),
.I "user names"\^
(contains login names and/or numerical group \s-1ID\s+1s of users who may add deltas),
.I flags\^
(contains definitions of internal keywords),
.I comments\^
(contains arbitrary descriptive information about the file),
and the
.I body\^
(contains the actual text lines intermixed with control lines).
.PP
Throughout an \*(S) file there are lines which begin with the \f3\s-1ASCII SOH\s+1\f1
(start of heading) character (octal 001).
This character is hereafter referred to as
.I "the control character"\^
and will be represented graphically as @.
Any line described below which is not depicted as beginning with
the control character is prevented from beginning
with the control character.
.PP
Entries of the form
\*(D)
represent a five-digit string
(a number between 00000 and 99999).
.PP
Each logical part of an \*(S) file is described in detail below.
.TP
.I Checksum\^
The checksum is the first line of an \*(S) file.
The form of the line is:
.if !\ns .sp
.ti +5
@\f3h\*(D)\f1
.br
.sp
The value of the checksum is the sum of all characters, except
those of the first line.
The @\f3h\f1 provides a
.I "magic number"\^
of (octal) 064001.
.TP
.I "Delta table"\^
The delta table consists of a variable number of entries of the form:
.if !\ns .in +5
.if \ns .sp
.if \ns .ps -1
.nf
@\f3s\f1 \*(D)/\*(D)/\*(D)
.if t @\f3d\f1 <type> <\f3\s-1SCCS ID\s+1\f1>  yr/mo/da hr:mi:se  <pgmr>  \*(D)  \*(D)
.if n @d <type> <\f3\s-1SCCS ID\s+1\f1> yr/mo/da hr:mi:se <pgmr> \*(D) \*(D)
@\f3i\f1 \*(D) \f3...\f1
@\f3x\f1 \*(D) \f3...\f1
@\f3g\f1 \*(D) \f3...\f1
@\f3m\f1 <\*(M) number>
  \f3.\f1
  \f3.\f1
  \f3.\f1
@\f3c\f1 <comments> \f3...\f1
  \f3.\f1
  \f3.\f1
  \f3.\f1
@\f3e\f1
.fi
.if !\ns .in -5
.if \ns .ps +1
.sp
The first line
(@\f3s\f1)
contains the number of lines
inserted/deleted/unchanged, respectively.
The second line
(@\f3d\f1)
contains the type of the delta
(currently, normal: \f3\s-1D\f1\s+1,
and
removed: \s-1\f3R\s+1\f1),
the \*(S) \s-1ID\s+1 of the delta,
the date and time of creation of the delta, the\p
login name corresponding to the real user \s-1ID\s+1
at the time the delta was created,
and the serial numbers of the delta and its predecessor,
respectively.
.sp
The @\f3i\f1, @\f3x\f1, and @\f3g\f1 lines contain the serial numbers of deltas
included, excluded, and ignored, respectively.
These lines are optional.
.sp
The @\f3m\f1 lines (optional) each contain one \*(M) number associated with the delta;
the @\f3c\f1 lines contain comments associated with the delta.
.sp
The @\f3e\f1 line ends the delta table entry.
.TP
.I "User names"\^
The list of login names and/or numerical group \s-1ID\s+1s of users who may add deltas to
the file, separated by new-lines.
The lines containing these login names and/or numerical group \s-1ID\s+1s are surrounded
by the bracketing lines @\f3u\f1 and @\f3U\f1.
An empty list allows anyone
to make a delta.
Any line starting with a
.B !
prohibits the succeeding group or user from making deltas.
.TP
.I Flags\^~~~~~
Keywords used internally.
[See
.IR admin (1)
for more information on their use.]
Each flag line takes the form:
.sp
.ti +5
@\f3f\f1 <flag>	<optional text>
.br
.sp
The following flags are defined:
.ti +5
@\f3f\f1 t	<type of program>
.ti +5
@\f3f\f1 v	<program name>
.ti +5
@\f3f\f1 i	<keyword string>
.ti +5
@\f3f\f1 b
.ti +5
@\f3f\f1 m	<module name>
.ti +5
@\f3f\f1 f	<floor>
.ti +5
@\f3f\f1 c	<ceiling>
.ti +5
@\f3f\f1 d	<default-sid>
.ti +5
@\f3f\f1 n
.ti +5
@\f3f\f1 j
.ti +5
@\f3f\f1 l	<lock-releases>
.ti +5
@\f3f\f1 q	<user defined>
.ti +5
@\f3f\f1 z	<reserved for use in interfaces>
.br
.sp
The
.B t
flag defines the replacement for
the \s-1\f3%\&Y%\s+1\f1 identification keyword.
The
.B v
flag controls prompting for \*(M) numbers
in addition to comments;
if the optional text is present it defines
an \*(M) number validity
checking
program.
The
.B i
flag controls the warning/error
aspect of the ``No id keywords'' message.
When the
.B i
flag is not present,
this message is only a warning;
when the
.B i
flag is present,
this message will cause a ``fatal'' error
(the file will not be gotten, or the delta will not be made).
When the
.B b
flag is present
the
.B \-b
keyletter may be used on the
.I get\^
command to cause a branch in the delta tree.
The
.B m
flag defines the first choice
for the replacement text of the \s-1\f3%\&M%\s+1\f1 identification keyword.
The
.B f
flag defines the ``floor'' release;
the release below which no deltas may be added.
The
.B c
flag defines the ``ceiling'' release;
the release above which no deltas may be added.
The
.B d
flag defines the default \*(I) to be used
when none is specified on a
.I get\^
command.
The
.B n
flag causes
.I delta\^
to insert a ``null'' delta (a delta that applies
.I no\^
changes)
in those releases that are skipped when a delta is made in a
.I new\^
release (e.g., when delta 5.1 is made after delta 2.7, releases 3 and
4 are skipped).
The absence of the
.B n
flag causes skipped releases to be completely empty.
The
.B j
flag causes
.I get\^
to allow
concurrent edits of the same base \*(I).
The
.B l
flag defines a
.I list\^
of releases that are
.I locked\^
against editing
''''(\c
(\f2get\f1(1)
with the
.B \-e
keyletter).
The
.B q
flag defines the replacement for the \s-1\f3%\&Q%\s+1\f1 identification keyword.
The
.B z
flag is used in certain specialized interface programs.
.I Comments\^
Arbitrary text is surrounded by the bracketing lines @\f3t\f1 and @\f3T\f1.
The comments section typically will contain a description of the file's purpose.
.TP
.I Body~~~~~\^
The body consists of text lines and control lines.
Text lines do not begin with the control character,
control lines do.
There are three kinds of control lines:
.IR insert , ~delete ,
and
.IR end ,
represented by:
.sp
.ti +5
\s-1@\f3I\f1\s+1 \*(D)
.ti +5
\s-1@\f3D\f1\s+1 \*(D)
.ti +5
\s-1@\f3E\f1\s+1 \*(D)
.br
.sp
respectively.
The digit string is the serial number corresponding to the delta for the
control line.
.SH "SEE ALSO"
admin(1),
delta(1),
get(1),
prs(1).
.\"	@(#)sccsfile.4	6.2 of 10/20/83
.Ee
'\".so /pubs/tools/origin.att
