calmsacibis995/irix-6517-src/eoe/man/man4/scr_dump.4
'\"macro stdmacro
.if n .pH g4.scr_dump @(#)scr_dump	30.10 of 2/24/86
.nr X
.if \nX=0 .ds x} SCR_DUMP 4 "Terminal Information Utilities" "\&"
.if \nX=1 .ds x} SCR_DUMP 4 "Terminal Information Utilities"
.if \nX=2 .ds x} SCR_DUMP 4 "" "\&"
.if \nX=3 .ds x} SCR_DUMP "" "" "\&"
.TH \*(x}
.SH NAME
scr_dump \- format of curses screen image file.
.SH SYNOPSIS
.BR scr_dump (file)
.SH DESCRIPTION
The \f2curses\f1(3X) function
.IR scr_dump ()
will copy the contents of the screen into a file.
The format of the screen image is as described below.
.P
The name of the tty is 20 characters long and the modification time
(the \f2mtime\f1 of the tty that this is an image of)
is of the type \f2time_t\f1.
All other numbers and characters are stored as
.IR  chtype
(see
.BR <curses.h> ).
No newlines are stored between fields.
.sp
.ta .5i 2.625i
.nf
	<magic number:  octal 0433>
	<name of tty>
	<mod time of tty>
	<columns> <lines>
	<line length> <chars in line>	for each line on the screen
	<line length> <chars in line>
	   \&.
	   \&.
	   \&.
	<labels?>	\f31\fP, if soft screen labels are present
	<cursor row> <cursor column>
.fi
.sp
Only as many characters as are in a line will be listed.
For example,
if the <\f2line length\f1> is \f30\f1,
there will be no characters following
<\f2line length\f1>.
If <\f2labels?\f1> is \s-1TRUE\s0, following it will be
.sp
.ta .5i
.nf
	<number of labels>
	<label width>
	<chars in label 1>
	<chars in label 2>
	    \&.
	    \&.
	    \&.
.fi
.sp
.SH "SEE ALSO"
curses(3X).
'\".so /pubs/tools/origin.att
