calmsacibis995/irix-6517-src/eoe/man/man4/securenets.4
.TH securenets 4
.SH NAME
securenets \- NIS map security file
.SH SYNOPSIS
.nf
/etc/securenets
.fi
.SH DESCRIPTION
The \fB/etc/securenets\fP file lists networks and hosts that may participate
in the NIS protocol with this host.  This file is used by both the NIS
server library \fBnisserv(7p)\fP.

This file contains any number of netmask/address pairs, one per line
separated by white space.  The netmask controls which bits in an
address are contained in the match.  It should contain all ones
followed by all zeros in binary.  A netmask of 255.255.255.255 (all
ones in binary) would require an exact match of the address.  An
example file would be:

.in +.5i
.nf
255.255.0.0 128.1.0.0
255.255.255.255 128.2.1.1
255.255.255.0 128.3.4.0
.fi
.in -.5i

When the NIS libraries are initially loaded into nsd this file is parsed
into an internal binary format.  When a request from a host is received
its source address is logically ANDed with the netmask and compared to
the address.  If they are identincal then the request is allowed, else
a message is logged and the request is ignored.

When this file is changed a HUP signal must be sent to the nsd daemon
for the file to be reparsed.  This can be done with the command
\fBkillall -HUP nsd\fP.
.SH FILES
/etc/securenets
.SH SEE ALSO
nsd(1M), nisserv(7P)
.br
\f2IRIX Admin: Networking and Mail\f1
.br
\f2IRIX Admin: NFS and NIS\f1
