calmsacibis995/irix-6517-src/eoe/man/man4/ssdi.4
'\"macro stdmacro
.TH SSDI 4
.SH NAME
ssdi.conf \- Standardized Systems Database Interface (SSDI) configuration file
.SH SYNOPSIS
/etc/ssdi.conf
.SH DESCRIPTION
This file controls the behavior of accesses to standard system databases,
such as the \f3passwd\fP and \f3group\fP databases. Normally, each
database has its own set of standard access routines. For example,
the passwd database routines are defined by \f2getpwent\f1(3C).
When such a routine is called, the requested information is iteratively
searched through various \f3sources\fP. Usually, all database routines
support a standard source which are \f3compiled-in\fP along with them.
For example, the standard source for passwd is the \f3files\fP source,
which implements the database as files.  In addition, the database
routines can be made to access sources which are \f3dynamic\fP.

The file
.B /etc/ssdi.conf
contains entries for each database that needs to access dynamic sources.
Entries are separated by newlines, and entries with a sharp-sign (\f3#\fP)
in column 1 are treated as comments.
Utmost one entry is allowed for a database. 
Each line begins with the name of the database, followed by a colon,
and then a blank separated list of the names of dynamic sources.
Each dynamic source needs to be available as a Dynamic Shared Object (DSO),
and physically present in \f3_SSDI_STD_SRC_DIR\fP (as defined in
.B /usr/include/ssdi.h
). The name of the DSO for a source named as \f3foo\fP needs to be \f3foo.so\fP.
The maximum number of  dynamic source for a database is limited
to \f3_SSDI_MAXSRCS\fP and the maximum number of characters in the name of
a source is limited to \f3_SSDI_MAXSRCNAME\fP (as defined in 
.B /usr/include/ssdi.h
).

Currently only the following databases are supported:
\f3passwd\fP, \f3group\fP, and \f3aux\fP.

Following is an example of
.B /etc/ssdi.conf
which lists \f3btree\fP as a source for both passwd and group databases.
.Ex
# Sample ssdi conf file
passwd: btree
group: btree
.Ee
The file btree.so should be present in the \f3_SSDI_STD_SRC_DIR\fP directory.

.SH FILES
/etc/ssdi.conf
/usr/include/ssdi.h
.SH SEE ALSO
getpwent(3C), getgrent(3C), dso(5).
