calmsacibis995/irix-6517-src/eoe/man/man4/statmon.4
.\" @(#)statmon.5	1.1 88/06/03 4.0NFSSRC SMI; from 1.11 88/02/25 SMI;
.TH STATMON 4 "19 October 1987"
.SH NAME
sm, sm.bak, state \- statd directories and file structures
.SH SYNOPSIS
.B /var/statmon/sm
.br
.B /var/statmon/sm.bak
.br
.B /var/statmon/state
.SH DESCRIPTION
.LP
.B /var/statmon/sm
and
.B /var/statmon/sm.bak
are directories generated by
.BR statd .
Each entry in
.B /var/statmon/sm
represents the name of a machine to be monitored by
.BR statd .
Each entry in
.B /var/statmon/sm.bak
represents the name of a machine to be notified of
.BR statd 's
recovery.
.LP
.B /var/statmon/state
is a file generated by
.B statd
to record its version number.
This version number is incremented each time a crash or
recovery takes place.
.SH FILES
.PD 0
.TP 20
/var/statmon/sm
.TP
/var/statmon/sm.bak
.TP
/var/statmon/state
.PD
.SH "SEE ALSO"
.LP
lockd(1M), statd(1M)
