calmsacibis995/irix-6517-src/eoe/man/man4/strftime.4
'\"macro stdmacro
.if n .pH g4.strftime @(#)strftime	41.3 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} strftime 4 "" "\&"
.if \nX=1 .ds x} strftime 4 ""
.if \nX=2 .ds x} strftime 4 "" "\&"
.if \nX=3 .ds x} strftime "" "" "\&"
.TH \*(x}
.SH NAME
\f4strftime\f1 \- language-specific strings
.SH DESCRIPTION
There can exist one printable file per locale
to specify its date and time formatting information.
These files must be kept in
the directory \f4/usr/lib/locale/<\f2locale\f4>/LC_TIME\f1.
The contents of these files are:
.RS
.TP 4n
 1.
abbreviated month names (in order)
.TP
 2.
month names (in order)
.TP
 3.
abbreviated weekday names (in order)
.TP
 4.
abbreviated weekday names (in order)
.TP
 5.
weekday names (in order)
.TP
 6.
default strings that specify formats for locale time (\f4%X\fP) and 
locale date (\f4%x\fP)
.TP
 7.
default strings that specify formats for locale date and time representation(\f4%c\fP) 
.TP
 8.
AM (ante meridian) string
.TP
 9.
PM (post meridian) string
.TP
10.
default format for \f4cftime\fP, if the argument for \f4cftime\fP is zero or null
.TP
11.
default strings that specify format for locale   12-hour time representation(\f4%r\fP)
.RE
.PP
Each string is on a line by itself.
All white space is significant.
The order of the strings in the above list
is the same order in which they must appear in the file.
.SH EXAMPLE
Here are the contents of \f4/usr/lib/locale/C/LC_TIME\f1:
.P
.RS
.nf
.ft4
Jan
Feb
 ...
January
February
 ...
Sun
Mon
 ...
Sunday
Monday
 ...
%H:%M:%S
%m/%d/%y
%a %b %e %H:%M:%S %Y
AM
PM
%a %b %e %T %Z %Y
%I:%M:%S %p
.ft1
.fi
.RE
.SH FILES
\f4/usr/lib/locale/<\f2locale\f4>/LC_TIME\f1
.SH "SEE ALSO"
\f4ctime\fP(3C), \f4setlocale\fP(3C), \f4strftime\fP(3C).
