calmsacibis995/irix-6517-src/eoe/man/man4/stune.4
.nr X
.if \nX=0 .ds x} stune 4 ""  "\&"
.TH \*(x}
.SH NAME
stune \- local settings for system tunable parameters
.SH DESCRIPTION
The file \f4/var/sysgen/stune\f1 contains local system settings for
tunable parameters.
The parameter settings in this file replace
the default values specified in \f4/var/sysgen/mtune/*\f1,
if the new values are within the legal range for the specified parameter.
Blank lines and lines beginning with the # or * characters
are considered comments and are ignored.
The file contains one line for each parameter to be reset.
The syntax for each line is:
.PP
\f2parameter name\f1[,\f2tag\f1] = \f2value\f1 [\f4ll\f1|\f4LL\f1]
.TP 17
\f2parameter name\f1
The name of the tunable parameter.
.TP
\f2tag\f1
Optional field that if specified controls whether the parameter is
used in the current configuration.
Use of this field can permit multiple configurations to be present in a
single \f4stune\fP file.
See \f4mtune\fP(4) and \f4system\fP(4) for more details.
.TP
\f2value\f1
The new value for the tunable parameter.
.TP
\f4ll\fP|\f4LL\fP
This optional field specifies whether the parameter should be interpreted
as a 32 or 64 bit quantity.
.PP
The file \f4stune\f1 normally resides in \f4/var/sysgen\f1.
You can edit this file, as root, as you find necessary.
However,
it is suggested that you use the system tuning tool, \f4systune\f1(1M),
instead of making changes directly to the \f4stune\f1 file.
\f4systune\f1
makes specified changes in the \f4stune\f1 file for you.
You should never directly edit the default configuration files
in the \f4mtune\f1 directory.
.SH FILES
.PD 0
.TP 22
/var/sysgen/mtune/*
default system parameters
.TP
/var/sysgen/stune
local settings for system tunable parameters
.PD
.SH SEE ALSO
lboot(1M),
systune(1M),
mtune(4),
system(4).
