calmsacibis995/irix-6517-src/eoe/man/man4/sulog.4
'\"macro stdmacro
.if n .pH g4.sulog @(#)sulog	40.10 of 1/3/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} sulog 4 "" "\&"
.if \nX=1 .ds x} sulog 4 ""
.if \nX=2 .ds x} sulog 4 "" "\&"
.if \nX=3 .ds x} sulog "" "" "\&"
.TH \*(x}
.SH NAME
\f4sulog\f1 \- log of all su attempts
.SH DESCRIPTION
The
\f4su\fP
command attempts to write an entry to the file
specified by 
\f3SULOG\f1
in 
.B /etc/default/su
(\f4/var/adm/sulog\fP by default)
each time it is invoked, regardless of outcome.
If \f4sulog\fP doesn't exist, \fIsu\fP
attempts to create it, setting owner and group to that of the
directory in which the file resides
(root.sys if \f4/var/adm\fP), and mode to read/write for owner only.
(Because \fIsu\fP
executes with root privileges, this operation should succeed; 
if it does fail, however, subsequent invocations of \fIsu\fP
will be recorded only by
other logging mechanisms selected in
.BR /etc/default/su ,
if any; see \f2su\fP(1M)).
.PP
\f4sulog\fP is an 
.SM ASCII
file, and each of its entries (or \f2records\fP)
contains 6 fields of information about a particular \fIsu\fP invocation, 
using a single space character as delimiter.
Field 1 is always "SU".  Field 2 contains the date in "mm/dd" format, with
"mm" ranging from "01" to "12", "dd" from "01 to "31".
Field 3 is the 24-hour time in "hh:mm" format, with "hh" ranging from "01"
to "23", "mm" from "00" to "59".  Field 4 indicates the outcome of 
the \fIsu\fP: '+' means it succeeded, '-' means it was disallowed. 
Field 5 is the tty on which the \fIsu\fP executed (as determined by
\f2ttyname\fP(3C)), or "???" if the process had no controlling terminal.
Field 6 identifies the usernames involved, and has the format 
"olduser-newuser", where "olduser" is the invoking username, "newuser"
the requested new username.
.SH FILES
.PD 0
.TP 1.9i
\f4/var/adm/sulog\f1
log file
.TP
\f4/etc/default/su\f1
defaults file
.sp
.SH "SEE ALSO"
\f4su\fP(1M), \f4ttyname\fP(3C)
.Ee
