calmsacibis995/irix-6517-src/eoe/man/man4/timezone.4
'\"macro stdmacro
.if n .pH @(#)timezone	31.2 of 3/4/87
.nr X
.if \nX=0 .ds x} TIMEZONE 4 ""  "\&"
.if \nX=1 .ds x} TIMEZONE 4 "" 
.if \nX=2 .ds x} TIMEZONE 4 "" "\&"
.if \nX=3 .ds x} TIMEZONE "" "" "\&"
.TH \*(x}
.SH NAME
timezone \- set default system time zone
.SH SYNOPSIS
.B /etc/\s-1TIMEZONE\s0
.SH DESCRIPTION
.PP
This file sets the time zone environmental variable \f3\s-1TZ\s+1\f1.
.PP
This file is read by
.IR init (1)
after system boot up and all subsequent processes inherit \f3\s-1TZ\s+1\f1
in their environment.  Other variables than \f3\s-1TZ\s+1\fP may also be
set in this file, for programs that are run from \f4init\fP.  Some programs
started by \f4init\fP reset all or part their environment, and therefore these 
variables may not be seen by all programs.  The form of the variables is
.PP
.BR 	TZ\^
=value
.PP
Lines that are too long are ignored; in practice this is not a problem.
.PP
For the syntax of timezone value specifications, see 
.BR environ\^
(5).
.SH SEE ALSO
environ(5), ctime(3C)
.Ee
'\".so /pubs/tools/origin.att1
