calmsacibis995/irix-6517-src/eoe/man/man4/unistd.4
'\"!  tbl | mmdoc
'\"macro stdmacro
.if n .pH g4.unistd @(#)unistd	30.4 of 3/25/86
.nr X
.if \nX=0 .ds x} UNISTD 4 "" "\&"
.if \nX=1 .ds x} UNISTD 4 ""
.if \nX=2 .ds x} UNISTD 4 "" "\&"
.if \nX=3 .ds x} UNISTD "" "" "\&"
.TH \*(x}
.SH NAME
unistd \- file header for symbolic constants
.SH SYNOPSIS
.B #include <unistd.h>
.SH DESCRIPTION
The header file
.I <unistd.h>
lists the symbolic constants and structures
not already defined or declared in some other
header file.
.nf
.na
.ta 1.7i 2.7i
.sp 
/\(** Symbolic constants for the "access" routine: \(**/
.sp
.ta 1.3i 2i
.nf
#define R_OK	4	/\(**Test for Read permission \(**/
#define W_OK	2	/\(**Test for Write permission \(**/
#define X_OK	1	/\(**Test for eXecute permission \(**/
#define F_OK	0	/\(**Test for existence of File \(**/
.sp
#define F_ULOCK	0	/\(**Unlock a previously locked region \(**/
#define F_LOCK	1	/\(**Lock a region for exclusive use \(**/
#define F_TLOCK	2	/\(**Test and lock a region for exclusive use \(**/
#define F_TEST	3	/\(**Test a region for other processes locks \(**/
.sp
/\(**Symbolic constants for the "lseek" routine: \(**/
.sp
#define SEEK_SET	0	/\(** Set file pointer to "offset" \(**/
#define SEEK_CUR	1	/\(** Set file pointer to current plus "offset" \(**/
#define SEEK_END	2	/\(** Set file pointer to EOF plus "offset" \(**/
.sp
/\(**Pathnames:\(**/
.sp
#define GF_PATH	/etc/group	/\(**Pathname of the group file \(**/
#define PF_PATH	/etc/passwd	/\(**Pathname of the passwd file \(**/
.Ee
'\".so /pubs/tools/origin.att
