calmsacibis995/irix-6517-src/eoe/man/man4/updaters.4
'\"macro stdmacro
.TH UPDATERS 4
.SH NAME
updaters \- configuration file for NIS updating
.SH SYNOPSIS
.B /var/yp/updaters
.SH DESCRIPTION
.LP
The file
.I /var/yp/updaters
is a makefile (see
.IR make (1))
which is used for updating NIS databases.
Each entry in the file is
a make target for a particular
.SM NIS
database. For example, if there is a
.SM NIS
database named
.B passwd.byname
that can be updated, there should be a
.I make
target named
.B passwd.byname
in the
.I updaters
file with the command to update the file.
.LP
The information necessary to make
the update is passed to the update
command through standard input. The
information passed is described
below (all items are followed by a
.SM NEWLINE\s0,
except for 4 and 6)
.IP \(bu 3
Network name of client wishing to
make the update (a string)
.IP \(bu
Kind of update (an integer)
.IP \(bu
Number of bytes in key (an integer)
.IP \(bu
Actual bytes of key
.IP \(bu
Number of bytes in data (an integer)
.IP \(bu
Actual bytes of data
.LP
After getting this information through
standard input, the command to update
the particular database should decide
whether the user is allowed to make
the change. If not, it should exit with the status
.SM YPERR_ACCESS\s0.
If the user is allowed to make the change,
the command should make the change and
exit with a status of zero. If there are
any errors that may prevent the updater from
making the change, it should exit with the status
that matches a valid
.SM NIS
error code described in
.RI < rpcsvc/ypclnt.h >.
.SH FILES
.PD 0
.TP 20
/var/yp/updaters
.PD
.SH "SEE ALSO"
.IR make (1),
.IR ypupdated (1M)
.SH BUGS
Access control is insecure.  Use only on a trusted network.
