calmsacibis995/irix-6517-src/eoe/man/man4/utmp.4
'\"!  tbl | mmdoc
'\"macro stdmacro
.if n .pH g4.utmp @(#)utmp	40.19 of 5/1/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} utmp 4 "" "\&"
.if \nX=1 .ds x} utmp 4 ""
.if \nX=2 .ds x} utmp 4 "" "\&"
.if \nX=3 .ds x} utmp "" "" "\&"
.TH \*(x}
.SH NAME
\f4utmp\f1, \f4wtmp\f1 \- utmp and wtmp entry formats
.SH SYNOPSIS
\f4#include <utmp.h>\f1
.SH DESCRIPTION
These files, which hold user and accounting information
for such commands as
\f4who\f1,
\f4last\f1,
\f4write\f1,
and
\f4login\f1,
contain entries with the following structure, defined in
\f4utmp.h\f1:
.PP
.ft 4
.nf
.ps -1
#define UTMP_FILE   "/var/adm/utmp"
#define WTMP_FILE   "/var/adm/wtmp"
#define ut_name     ut_user
.sp .5
.tr ~ 
struct     utmp {
   char    ut_user[8];      /\(** user login name \(**/
   char    ut_id[4];        /\(** /etc/inittab id (created by \(**/
                            /\(** process that puts entry in utmp) \(**/
   char    ut_line[12];     /\(** device name (console, lnxx) \(**/
   short   ut_pid;          /\(** process id \(**/
   short   ut_type;         /\(** type of entry \(**/
   struct  exit_status {
      short  e_termination; /\(** process termination status \(**/
      short  e_exit;        /\(** process exit status \(**/
   } ut_exit;               /\(** exit status of a process \(**/
                            /\(** marked as DEAD_PROCESS \(**/
   time_t  ut_time;         /\(** time entry was made \(**/
};
.sp .5
/\(**  Definitions for ut_type  \(**/
.sp .5
#define EMPTY         0
#define RUN_LVL       1
#define BOOT_TIME     2
#define OLD_TIME      3
#define NEW_TIME      4
#define INIT_PROCESS  5   /\(** process spawned by "init" \(**/
#define LOGIN_PROCESS 6   /\(** a "getty" process waiting for login \(**/
#define USER_PROCESS  7   /\(** a user process \(**/
#define DEAD_PROCESS  8
#define ACCOUNTING    9
#define UTMAXTYPE     ACCOUNTING /\(** max legal value of ut_type \(**/
.sp .5
/\(**  Below are the special strings or formats used in the "ut_line" \(**/
/\(**  field when accounting for something other than a process.  \(**/
/\(**  Strings for the ut_line field must be no more than 11 chars +  \(**/
/\(**  terminating NULL in length.  \(**/
.sp .5
#define RUNLVL_MSG     "run\-level %c"
#define BOOT_MSG       "system boot"
#define OTIME_MSG      "old time"
#define NTIME_MSG      "new time"
.fi
.ps
.SH FILES
\f4/var/adm/utmp\f1
.br
\f4/var/adm/wtmp\f1
.SH "WARNING"
All changes to \f4/var/adm/wtmp\f1 must also be logged in
\f4/var/adm/wtmpx\f1.  Most commands that extract information from
these files silently discard all \f4wtmpx\f1 entries without \f4wtmp\f1
complements.
.SH SEE ALSO
\f4w\f1(1), \f4login\f1(1), \f4who\f1(1), \f4last\f1(1), \f4utmpx\f1(4), 
\f4write\f1(1),
\f4getut\f1(3C), \f4getutx\f1(3C)
\"	@(#)utmp.4	6.2 of 10/20/83
.Ee
