calmsacibis995/irix-6517-src/eoe/man/man4/visuallogin.4
'\"macro stdmacro
.if n .pH g4.visuallogin @(#)visuallogin	31.8 of 3/4/87
.nr X
.if \nX=0 .ds x} visuallogin 4 ""  "\&"
.if \nX=1 .ds x} visuallogin 4 ""
.if \nX=2 .ds x} visuallogin 4 "" "\&"
.if \nX=3 .ds x} visuallogin "" "" "\&"
.TH \*(x}
.SH NAME
visuallogin, noiconlogin \- select and control console login program
.SH DESCRIPTION
The configuration flag
.I visuallogin
selects the type of login program used for the graphics console.
If
.I windowsystem 
is 
.I on
and 
.I visuallogin
is
.IR on ,
the visual login program 
.IR pandora (1)
or
.IR clogin (1)
is used for logins.
(Systems running 4Sight have
.IR pandora (1),
systems with the IRIX Interactive Desktop have
.IR clogin (1)
).  If 
.I windowsystem
is
.I on
and
.I visuallogin
is 
.IR off ,
the standard
.I xdm
login program is run.  If both
.I windowsystem
and
.I visuallogin
are 
.IR off ,
the standard IRIX 
.IR login (1)
program is used.
.PP
If the configuration flag
.I noiconlogin
is 
.IR off ,
.IR pandora (1)
or
.IR clogin (1)
displays icons for each user.
If it is
.IR on ,
icons are not displayed.
For
.IR clogin (1),
this can also be configured using
.IR configClogin (1M).
.PP
The value of the flags
can be set to
.I on
or
.I off
using
.IR chkconfig (1M).
.SH FILES
/etc/config/visuallogin
.br
/etc/config/noiconlogin
.SH SEE ALSO
chkconfig(1M), clogin(1M), configClogin(1M), login(1), pandora(1).
