calmsacibis995/irix-6517-src/eoe/man/man7m/cdsio.7
'\"macro stdmacro
.TH CDSIO 7
.SH NAME
cdsio \- 6-port serial I/O
.SH SYNOPSIS
.B /dev/tty[dmf][5-10]
.br
.B /dev/tty[dmf][13-18]
.SH DESCRIPTION
6-port boards can be used for modems or other asynchronous, serial I/O
devices.
The ports provided by the
.I cdsio
board are very similar to the on-board
.I duart
ports.
.PP
Various character echoing and interpreting parameters can be set
independently for each port.
See
.IR termio (7)
for details.
.PP
By opening either the ttyd*, ttym*, or ttyf* device name of a port, different
hardware signals are supported.
Ttyd* is typcially used for direct connect devices such as terminals;
ttym* is used for devices that use modem control such as modems; and ttyf*
is used for devices that understand hardware flow control such printers 
and high speed modems.
If ttyf* is desired, the "new" cabling scheme must be used.
The driver is informed of which cabling is present by its
.IR lboot (1M)
file,
.IR /var/sysgen/master.d/cdsio .
.PP
When the ttyf* device name is used, the board requires that the DSR
signal be "true" before receiving any data.
.PP
With the "new firmware," the board can process significantly more than 
30,000 bytes of input and output per second.  This is enough to 
support as many as 4 ports with data being simultaneously transmitted
and received at 38,400 bits/second.  The "old firmware" is significantly
slower, and 38,400 is not recommended.
.PP
To allow the system and the board to handle high volume, high speed
input, individual characters are accumulated for short periods before
they are given to the rest of the system.  While this does make
higher throughput possible, it also increases the latency for individual
characters.  This latency can be adjusted in the
.IR lboot (1M)
file.
.PP
Detection of the serial I/O board is automatic.
If the board is present,
its driver is included in the configured kernel.  This probing and configuring
is done when the system starts by the
.I rc2
scripts.
.SH FILES
/dev/tty[dmf][5-10]
.br
/dev/tty[dmf][13-18]
.br
/dev/MAKEDEV
.br
/etc/init.d/autoconfig
.br
/var/sysgen/master.d/cdsio
.br
/var/sysgen/system
.SH "SEE ALSO"
duart(7), lboot(1M), rc2(1M), system(4), termio(7)
.* .so /pubs/tools/origin.sgi
