calmsacibis995/irix-6517-src/eoe/man/man7m/console.7
'\"macro stdmacro
.if n .pH g7.console @(#)console	30.2 of 12/25/85
.nr X
.if \nX=0 .ds x} CONSOLE 7 "" "\&"
.if \nX=1 .ds x} CONSOLE 7 ""
.if \nX=2 .ds x} CONSOLE 7 "" "\&"
.if \nX=3 .ds x} CONSOLE "" "" "\&"
.TH \*(x}
.SH NAME
console \- console interface
.SH DESCRIPTION
The console provides the operator interface to the system.
The operating system and system utility programs display
error messages on the system console.
.PP
The console can be a serial terminal connected to the first
serial port on the back panel of the workstation
or it can be a logical terminal
represented by a text window on the graphics monitor.
.PP
The device special file
.I /dev/console
represents the system console.
When the console is a window on the graphics
monitor,
.I /dev/console
will be the slave side of pseudo-tty (see pty(7)).
.PP
When the console is a serial terminal, the 
file
.I /dev/console
will be the appropriate
DUART device.
.SH FILES
/dev/console
.SH SEE ALSO
termio(7).
.Ee
'\".so /pubs/tools/origin.att
