calmsacibis995/irix-6517-src/eoe/man/man7m/dn_ll.7
.TH dn_ll 7
.SH NAME
dn_ll, dn_netman \- 4DDN special files
.SH DESCRIPTION
The
.I dn_ll
special file is used to create 4DDN logical links.
Logical links are temporary software data paths established
between two communicating processes in a 4DDN network and use
DECnet phase-IV protocols.
.P
The
.I dn_netman
special file is used by the 4DDN network management software.
.SH FILES
/dev/dn_ll
.br
/dev/dn_netman
.SH "SEE ALSO"
.PP
\f24DDN User's Guide\f1 and \f24DDN Network Management Guide\f1.
.SH NOTE
These files are used only with the optional 4DDN software.
.br
DECnet is a trademark of Digital Equipment Corporation.
