calmsacibis995/irix-6517-src/eoe/man/man7m/dns.7p
.TH DNS 7P
.SH NAME
dns \- Domain Name Service
.SH SYNOPSIS
/var/ns/lib/libns_dns.so
.SH DESCRIPTION
.PP
The Domain Name System (DNS) is an Internet standard name service for hostname
to address translation.  Queries are made from a client library (termed the
\fBresolver(4)\fP) to a server daemon \fBnamed(1M)\fP.  The daemon \fBnsd(1M)\fP
will make these calls and present the data in a filesystem namespace when
the \fBdns\fP keyword exists in the \fBnsswitch.conf\fP configuration file
for a domain.  This man page documents the behavior of the DNS extension to
the nsd daemon.
.PP
The nsd daemon reads all of the nsswitch.conf configuration files, first
\fB/etc/nsswitch.conf\fP for the default domain, then files
\fB/var/ns/domains/DOMAIN/nsswitch.conf\fP for each DOMAIN the local host
acts as a server for.  As it reads these files if it encounters the
keyword \fBdns\fP for some map then it will open the DNS library
\fB/var/ns/lib/libns_dns.so\fP.  On first open the library initialization
routine will parse the resolver configuration file \fB/etc/resolv.conf\fP
to determine the addresses of nameservers and the domain names to use for
queries.
.PP
Extended attributes in the \fBnsswitch.conf\fP file can be used to control
the behavior of the DNS resolver.  Extended attributes are simply lists of
key/value pairs attached to each object in the nsd filesystem.  The
attributes supported in this library are:
.TP
.B domain
This is the domainname given as a parameter to the remote name server.  This
attribute is typically inherited from the daemon depending on the nsswitch.conf
file that is being read.  Given the configuration file
\fB/var/ns/domains/DOMAINNAME/nsswitch.conf\fP the attribute "domain" is set
to DOMAINNAME.  For the default domain, represented by the file
\fB/etc/nsswitch.conf\fP, the domain is unset and the DNS library uses the
search path given in the \fBresolver(4)\fP configuration file.  If the
resolv.conf file is changed then the change will be reflected in the next
lookup.
.TP
.B table
The \fBtable\fP attribute is typically inherited from the daemon based on
the line from which this entry occurs in the nsswitch.conf file.  This
implementation of the DNS resolver recognizes only two tables:
\fBhosts.byname\fP which is translated into a type A request,
\fBhosts.byaddr\fP which is translated into a type PTR request.
.\" and \fBmx.byname\fP which results in a type MX request.
.TP
.B key
The \fBkey\fP attribute is set by the daemon on each request.  If the address
is fully qualified (ends in a '.') then it is forwarded on to the remote
name server as is.  Else, it will have each element of the search path appended
and looked up.  If the key contains a sufficient number of dots (as defined
by in resolv.conf as "option ndots") then it will first be attempted as is.
.TP
.B dns_max_ttl
The \fBdns_max_ttl\fP attribute specifies that nsd should use the DNS TTL
value for the nsd cache timeout.  Because DNS TTL values can be quite large
a maximum value in seconds can be specified.  Default is zero.
.B dns_servers
The \fBdns_servers\fP attribute is a space separated list of IP addresses
of DNS servers.  If this is not set then the nameservers listed in the
/etc/resolv.conf file are used.
.TP
.B dns_search
The \fBdns_search\fP attribute is used to override the default domain
search path built from /etc/resolv.conf.
.TP
.B dns_parallel
The \fBdns_parallel\fP attribute is a performance optimization where
queries will be made to all defined name servers in parallel.  This only
works if each of the name servers is equally able to answer the request.
This should be set to an integer number of packets which should be sent
out at one time.  The default is 1.
.TP
.B dns_retries
The \fBdns_retries\fP attribute specifies the number of queries that we
will make to each server.  Each server is tried in turn in a round-robin
basis until the number of retries is exhausted.  This should be set to an
integer value, and defaults to 3.
.TP
.B dns_timeout
The \fBdns_timeout\fP attribute is the number of milliseconds the library
code will wait for a response from a name server before continuing to the
next name server.  The default is 2000.
.SH NOTE
If there is no \fBresolv.conf\fP file on a system nsd will \fBNOT\fP use a
default nameserver of localhost unless \fBnamed\fP has been enabled via
\fBchkconfig\fP. 
.SH SEE ALSO
chkconfig(1M), named(1M), nsd(1M), nsswitch.conf(4), resolver(4),
db(7P), dns(7P), files(7P), ldap(7P), mdbm(7P), ndbm(7P), nis(7P),
nisserv(7P).
.br
\fBIRIX Admin: Networking and Mail\fP
