calmsacibis995/irix-6517-src/eoe/man/man7m/files.7p
.TH FILES 7P
.SH NAME
files \- local files name service parser library
.SH SYNOPSIS
/var/ns/lib/libns_files.so
.SH DESCRIPTION
.PP
The files client library parses traditional local name service
configuration files such as \fI/etc/passwd\fP and makes the data
available through the \fBnsd(1M)\fP filesystem.  This library is meant
to be used only by the \fBnsd(1M)\fP daemon to efficiently access local
name service data.
.PP
The library \fB/var/ns/lib/libns_files.so\fP is opened by the \fBnsd(1M)\fP
daemon when \fBfiles\fP is listed as the protocol for some map in a
\fBnsswitch.conf\fP file.
.PP
Extended attributes in the \fBnsswitch.conf\fP file can be used to control
the behavior of the files library.  Extended attributes are simply lists of
key/value pairs attached to each object in the nsd filesystem.  The
attributes supported in this library are:
.TP
.B compat
The \fBcompat\fR attribute is only used for the password file.  This attribute
specifies that lines beginning with +/- represent entries supported in later
libraries and results in a recursive call into nsd.  When the directive
\fB[notfound=return]\fP follows this line then entries which are not in the
local password file, or where there is no +/- entry which matches will fail.
This allows the historic behavior at the cost of performance.  To get the
same behavior from previous OS releases use the following line for the
password entry:

.in +.5i
passwd: files(compat) [notfound=return] nis
.in -.5i
.TP
.B library_compat
The \fBlibrary_compat\fR attribute is set when a entry is generated from a
+/- compat request.   Similar to the \fBlibrary\fR attribute, it will be
set to the name of the library that the compat information was returned
from. 
.TP
.B domain
The \fBdomain\fR attribute determines the path used to find the source
file.  This attribute is typically inherited from the daemon depending on
the nsswitch.conf ` file that is being read.  Given the configuration file
\fB/var/ns/domains/DOMAINNAME/nsswitch.conf\fP the attribute "domain" is
set to DOMAINNAME.  Given a domain DOMAINNAME the library would open the
file \fB/var/ns/domains/DOMAINNAME/FILE\fP where file is the tradition
file name for each table.  If a table does not match one of the traditional
files then the table name itself is used for the file name.  If the domain
attribute is unset then the file \fB/etc/FILE\fP would be used.  See the
information about the \fBtable\fP and \fBfile\fP attributes below.  A
client system can be a member of multiple domains by including multiple
instances of the \fBfiles\fP keyword in the nsswitch.conf file like:

.nf
.in +.5i
hosts: files(domain=engr) files(domain=corp)
.in -.5i
.fi
.TP
.B file
The file attribute overrides the domain and table attributes to set the name
of the file to be opened.  If the file begins with a leading '/' then that
file is simply opened.  If not, then the contents of this attribute are
appended to the directory name -- either \fB/etc/\fP for the default domain,
or \fB/var/ns/domains/DOMAINNAME/\fP when the domain attribute is set.
The default files for each of the traditional maps are as follows:

.in +.5i
.TS
lB lB
l l .
Filename	Tables
aliases	mail.aliases, mail.byaddr
capability	capability.byname
clearance	clearance.byname
ethers	ethers.byname, ethers.byaddr
group	group.byname, group.bygid, group.bymember
hosts	hosts.byaddr, hosts.byname
mac	mac.byname, mac.byvalue
netgroup	netgroup, netgroup.byuser, netgroup.byhost
networks	networks.byaddr, networks.byname
passwd	passwd.byname, passwd.byuid
protocols	protocols.byname, protocols.bynumber
rpc	rpc.byname, rpc.bynumber
services	services, services.byname
shadow	shadow.byname
.TE
.in -.5i
.TP
.B key
The key attribute is used to fetch the data from the file.  It is
set by the nsd(1M) daemon.  Each of the
traditional files uses the key in a different way.  For instance when
looking up an address in the \fBhosts.byaddr\fP map the library would
open up the \fBhosts\fP file, convert the key to an address, then walk
through the file one line at a time converting the first string in
the file to an address and then doing an address comparison until one
matched.
.TP
.B table
The table attribute is typically inherited from the daemon based on the line
from which this entry occurs in the nsswitch.conf file.  In the above example
the \fBtable\fP attribute would be set to \fBhosts.byname\fP or
\fBhosts.byaddr\fP depending on the context of the request.  This attribute
is used as the file name containing the data unless the table matches one of
the traditional files (see \fBfile\fP attribute above).
For the \fBhosts.byname\fP map in the default domain the file
\fB/etc/hosts\fP would be opened and searched.
.TP
.B separator
The separator attribute is used when using the files library to support
a non-traditional file.  The file is expected to be of the format:
.in +.5i
keySEPARATORvalue
.in -.5i
The separator is a string which is passed directly to the \fBstrtok(3C)\fP
function.
.SH FILES
/etc/nsswitch.conf,
/etc/aliases, /etc/capability, /etc/clearance, /etc/ethers, /etc/group,
/etc/hosts, /etc/mac, /etc/netgroup, /etc/networks, /etc/passwd,
/etc/protocols, /etc/rpc, /etc/services, /etc/shadow
.SH SEE ALSO
nsd(1M), strtok(3C), nsswitch.conf(4),
aliases(4), capability(4), clearance(4), ethers(4), group(4), hosts(4),
mac(4), netgroup(4), networks(4), passwd(4), protocols(4), rpc(4),
services(4), shadow(4)
