calmsacibis995/irix-6517-src/eoe/man/man7m/ik.7
'\"macro stdmacro
.TH IK 7
.SH NAME
ik \- Ikon 10088 (ikc) parallel interface controller
.SH SYNOPSIS
.B /dev/cent
.br
.B /dev/vp0
.SH DESCRIPTION
This is the driver for the
Ikon 10088 (and 10088A)
parallel interface controller.
The controller can support any one of three possible interfaces:
Versatec TTL, Versatec differential, or (Tektronix-compatible) Centronics.
The Ikon controller board must be
jumpered, switched, connected, and terminated
differently depending on
which interface is being used.
.PP
If the board is configured for the Centronics interface,
bytes written to
.I /dev/cent
are output to the parallel port.
A printer reset (input prime) is issued when the device file is opened.
.PP
If the board is configured for either Versatec interface,
bytes written to
.I /dev/vp0
are output to the parallel port.
A printer reset is issued when the device file is opened.
In addition,
the following Versatec control calls are provided via
.IR ioctl (2).
The relevant definitions are contained in the include file
.IR <sys/vcmd.h> .
.PP
.IP "ioctl(fd,VSETSTATE,int_3_ptr);"
.br
changes the Versatec device state according to
the contents of the 3 integers pointed at by
.IR int_3_ptr .
The first integer specifies a Versatec command:
.sp .25
.nf
VPRINT commands the Versatec device to enter print mode;
VPLOT commands it to enter plot mode;
VPRINTPLOT commands it to enter simultaneous print/plot mode;
VLF commands it to output a linefeed;
VFF commands it to output a formfeed;
VREOT drives the remote EOT signal.
.fi
.sp .25
.br
The second integer specifies a timeout delay (in seconds)
for subsequent Versatec operations, including output operations.
A specified delay of 0 is ignored.
The default delay is 300 seconds.
This may be insufficient for large and / or slow devices.
The third integer is ignored.
.IP "ioctl(fd,VGETSTATE,int_3_ptr);"
.br
passes back Versatec device state information in
the 3 integers pointed at by
.IR int_3_ptr .
The first integer contains:
.nf
.sp .25
VPRINT if the Versatec device is in print mode;
VPLOT if it is in plot mode;
VPRINTPLOT if it is in simultaneous print/plot mode.
.fi
.sp .25
.br
The second integer contains the current timeout delay (in seconds)
(see VSETSTATE above).
The third integer is not used.
.PP
It is normally unnecessary to use
.I /dev/cent
or
.I /dev/vp0
directly;
the spooling software (see
.IR lp (1))
provides an adequate interface.
.SH FILES
/dev/cent
.br
/dev/vp0
.SH SEE ALSO
image(4), ipaste(1), lp(1), snap(1)
'\".so /pubs/tools/origin.sgi
