calmsacibis995/irix-6517-src/eoe/man/man7m/inet.7p
'\"macro stdmacro
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
.\"
.\"	@(#)inet.4f	6.3 (Berkeley) 6/1/86
.\"
.TH INET 7F 
.UC 5
.SH NAME
inet \- Internet protocol family
.SH SYNOPSIS
.B #include <sys/types.h>
.br
.B #include <netinet/in.h>
.SH DESCRIPTION
.de _d
.if t .ta .6i 2.1i 2.6i
.\" 2.94 went to 2.6, 3.64 to 3.30
.if n .ta .84i 2.6i 3.30i
..
.de _f
.if t .ta .5i 1.25i 2.5i
.\" 3.5i went to 3.8i
.if n .ta .7i 1.75i 3.8i
..
The Internet protocol family is a collection of protocols
layered atop the
.I Internet Protocol
(IP) transport layer, and utilizing the Internet address format.
The Internet family provides protocol support for the
SOCK_STREAM, SOCK_DGRAM, and SOCK_RAW socket types; the
SOCK_RAW interface provides access to the IP protocol.
.SH ADDRESSING
Internet addresses are four byte quantities, stored in
network standard format.
The include file
.RI < netinet/in.h >
defines this address
as a discriminated union.
.PP
Sockets bound to the Internet protocol family utilize
the following addressing structure:
.sp 1
.nf
._f
struct sockaddr_in {
	short	sin_family;
	u_short	sin_port;
	struct	in_addr sin_addr;
	char	sin_zero[8];
};
.sp 1
.fi
Sockets may be created with the local address INADDR_ANY
to effect \*(lqwildcard\*(rq matching on incoming messages. 
The address in a
.IR connect (2)
or
.IR sendto (2)
call may be given as INADDR_ANY to mean ``this host.''
The distinguished address INADDR_BROADCAST
is allowed as a shorthand for the broadcast address on the primary
network if the first network configured supports broadcast.
.SH PROTOCOLS
The Internet protocol family is comprised of
the IP transport protocol, 
Internet Control Message Protocol (ICMP), 
Internet Group Management Protocol (IGMP), 
Transmission Control
Protocol (TCP), and User Datagram Protocol (UDP).
TCP is used to support the SOCK_STREAM
abstraction while UDP is used to support the SOCK_DGRAM
abstraction.  A raw interface to IP is available
by creating an Internet socket of type SOCK_RAW.
The ICMP message protocol is accessible from a raw socket.
.PP
The 32-bit Internet address contains both network and host parts.
It is frequency-encoded; the most-significant bit is clear
in Class A addresses, in which the high-order 8 bits are the network
number.
Class B addresses use the high-order 16 bits as the network field,
and Class C addresses have a 24-bit network part.
Sites with a cluster of local networks and a connection to the DARPA
Internet may chose to use a single network number for the cluster;
this is done by using subnet addressing.
The local (host) portion of the address is further subdivided
into subnet and host parts.
Within a subnet, each subnet appears to be an individual network;
externally, the entire cluster appears to be a single, uniform
network requiring only a single routing entry.
Subnet addressing is enabled and examined by the following
.IR ioctl (2)
commands on a datagram socket in the Internet domain;
they have the same form as the
SIOCIFADDR command (see
.IR netintro (7)).
.PP
.TP 20
SIOCSIFNETMASK
Set interface network mask.
The network mask defines the network part of the address;
if it contains more of the address than the address type would indicate,
then subnets are in use.
.TP 20
SIOCGIFNETMASK
Get interface network mask.
.SH SEE ALSO
ioctl(2), socket(2), netintro(7), route(7F), tcp(7P), udp(7P), ip(7P), icmp(7P)
.br
\f2IRIX Network Programming Guide\fP.
.SH CAVEAT
The Internet protocol support is subject to change as
the Internet protocols develop.  Users should not depend
on details of the current implementation, but rather
the services exported.
