calmsacibis995/irix-6517-src/eoe/man/man7m/intro.7
.nr X
.if \nX=0 .ds x} intro 7 "" "\&"
.TH \*(x}
.SH NAME
intro \- introduction to special files
.SH DESCRIPTION
This section describes various special files that refer to specific
hardware peripherals, and
IRIX
system device drivers.
STREAMS (see \f2intro\f1(2)) software drivers, modules, and the
STREAMS-generic set of \f2ioctl\f1(2) system calls are also
described.
.P
For hardware-related files, the names of the entries are generally
derived from names for the hardware, as opposed to the names of the
special files themselves.
Characteristics of both the hardware device and the corresponding
IRIX
system device driver are discussed where applicable.
.PP
Disk device filenames are described in \f2dks\f1(7M).
.PP
Tape device filenames are in the following format:
.Ex
\f3/dev/rmt/\f2typecontroller\f1\f3d\f1\f2unit\f1{\f3nr\f1}{\f3ns\f1|\f3s\f1}{\f3v\f1}{\f3stat\f1}{\f3.\f1\f2density\f1}{\f3c\f2}
.Ee
Where:
.TP 13
.I type
Identifies the controller type.
.TP
.I controller
Indicates the controller number.
.TP
.I unit
Indicates the device attached to the controller.
.TP
.B nr
Indicates a non rewinding interface.
.TP
.B ns
Indicates bytes are not swapped.
This should be used for all tape types
other than QIC, in almost all cases.
It should also be used for QIC
tapes imported from or exported to systems other than IRIX.
.TP
.B s
Indicates bytes are swapped by the driver, primarily for backwards
compatibility with older Silicon Graphics systems.
.TP
.B v
Indicates that the variable blocksize device should be used.
This
device writes a single logical block per read or write system
call.
The fixed block device transfers 1 or more logical blocks per
read or write system call.
Variable mode is preferred on 9-track,
DAT, and often when importing or exporting 8mm media from non-IRIX
systems.
.TP
.B stat
A special device that can be used only for the
.B MTIOCGET
ioctl.
All other I/O requests and ioctls fail with the
.B EINVAL
errno.
.TP
.BI . density
Optionally specifies the media density, where appropriate.
For devices
with only one density setting,
.I density
is omitted.
The \f3.\f1 is used to keep the
.I unit
from visually merging with the
.IR density .
.TP
.B c
indicates a device which performs hardware data compression and should not
be confused with density.
.PP
The \f2/dev/mt\fP directory exists as a link to \f2/dev/rmt\fP as
a portability aid; IRIX does not support block mode tape access.
Not all tape types support all of these options.
For backwards
compatibility, a tape device with neither
.BR ns ,
nor
.B s
is created.
It is normally the same device as the
.B s
device for QIC tapes and
.B ns
for all other tape types.
.SH SEE ALSO
MAKEDEV(1M),
fx(1M),
hinv(1M),
mt(1),
prtvtoc(1M).
.SH NOTE
The other devices in section 7 can be listed with:
.Ex
\f4man -w 7 '*'\f1
.Ee
or all of them can be read with:
.Ex
\f4man 7 '*'\f1
.Ee
