calmsacibis995/irix-6517-src/eoe/man/man7m/kbd.7
'\"macro stdmacro
.if n .pH g7.kbd @(#)kbd	41.5 of 5/26/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.nr X
.if \nX=0 .ds x} kbd 7 "" "\&"
.if \nX=1 .ds x} kbd 7 ""
.if \nX=2 .ds x} kbd 7 "" "\&"
.if \nX=3 .ds x} kbd "" "" "\&"
.TH \*(x}
.SH NAME
\f4kbd\f1 \- generalized string translation module
.SH DESCRIPTION
The \s-1STREAMS\s+1 module \f4kbd\fP is a programmable
string translation module. 
It can perform two types of
operations on an input stream: the first type is simple
byte-swapping via a lookup table, the second is 
string translation.
It is useful for \f2code set conversion\fP and \f2compose-key\fP
or \f2dead-key\fP character production
on terminals and production of overstriking sequences
on printers. 
It may also be used for minor types of key-rebinding,
expansion of abbreviations,
and keyboard re-arrangement (an example of the
latter would be swapping the positions of
the \f3Y\fP and \f3Z\fP keys, required for German keyboards, or
providing Dvorak keyboard emulation for \s-1QWERTY\s+1 keyboards).
The manual
entry \f4kbdcomp\fP(1M) discusses table construction, the
input language, and contains sample uses.
This document is intended mainly to aid administrators
in configuring the module
on a particular system; the user interface to the module is solely through
the commands \f4kbdload\fP(1M) and \f4kbdset\fP(1).
.PP
The \f4kbd\fP module works by modifying an input stream according to
instructions embodied in tables.
It has no
built in default tables.
Some tables may be loaded when the system is first brought up
by pushing the module
and loading standard or often-used tables
[see \f4kbdload\fP(1M)]
which are retained in main-memory across
invocations and made available
to all users.
These are called \f2public tables\fP. 
Users may also load \f2private tables\fP at any time\(emthese do not
remain resident.
.PP
With the \f4kbdset\fP command, users may query the module for a list of available
and attached
tables, attach various tables, and set the optional
per-user \f2hot-key\fP,
\f2hot-key mode\fP, and \f2verbose string\fP for their particular invocation.
.PP
When a user attaches more than one table, the user's hot-key
may be used to cycle to the next
table in the list.
If only one
table is specified, the hot-key may be used to toggle translation
on and off.
When multiple tables are in use, the hot-key
may be used to cycle through the list of tables. 
[See \f4kbdset\fP(1)
for a description of the available modes.]
.PP
In its initial state, \f4kbd\fP scans input for occurrences of
bytes beginning a translation sequence.
Upon receiving
such a byte, it attempts to match
subsequent bytes of the input to programmed sequences.
Input is buffered beginning with the byte which caused
the state change and is released
if a match is not found.
When a match
fails, the first byte of the invalid sequence is sent upstream, the
buffered input is shifted, and the scan begins again with the
resulting input sequence.
If the current table contains an error
entry, its value (one or more bytes) is substituted for the offending
input byte.
When a sequence is found to be valid, the entire sequence
is replaced with the \f2result string\fP specified for it.
.PP
The \f4kbd\fP module may be used in either the read or write directions,
or both simultaneously.
Maps and hot-keys may be specified independently for input and output.
.PP
The \f4kbd\fP also supports the use of \f2external kernel-resident
functions\fP as if they were tables; once declared and attached
(via \f4kbdload\fP and \f4kbdset\fP respectively) they may be
used as simple tables or members of composites.
To accomplish this, \f4kbd\fP
understands the registration functions of the \f4alp\f1 module
and can access any function registered with that module.
Further information on external functions and their definition is contained
in \f4alp\fP(7).
External functions are especially useful in
supporting multibyte code set conversions that would be difficult
or impossible with normal \f4kbd\f1 tables.
.SS Limitations
It is not an error to attach multiple tables without defining a
hot-key, but the tables will not all be accessible.
It is recommended that the user's hot-key be set before loading and
attaching tables to avoid unpleasant side effects when an unfamiliar
arrangement is first loaded.
.PP
Each user has a limitation on the
amount of memory that may be used for private and attached tables. 
This
``quota'' is controlled by the \f4kbd_umem\fP variable described below.
When a user that is not the super-user attempts to load a table or
create a \f2composite table\fP, the quota
is checked, and the load will fail if it would cause the quota to
be exceeded.
When a composite
table is attached, the space for attachment
(which requires more space than
the composite table itself) is charged
against this quota (attachment of simple tables is not
charged against the quota).
The quota is enforced only when loading
new tables.
Detaching temporarily from unneeded composite tables
may reduce the current allocation
enough to load a table that would otherwise fail due to
quota enforcement.
To minimize chances of failure while loading tables, it is advisable
to load all required tables and make all required composite tables
before attaching any of them.
.SS Configuration Parameters
The master (or \f4space.c\fP) file contains some configurable parameters.
.PP
\f4NKBDU\fP is the maximum number of tables that may be attached by
a single user.
The number should be large enough to cover uncommon cases, and
must be at least 2.
Default is 6.
.PP
\f4ZUMEM\fP\|, from which the variable \f4kbd_umem\fP is assigned,
is the maximum number of bytes that a user (other than the super user)
may have allocated to private tables (that is, the quota).
Default is 4096.
.PP
\f4KBDTIME\fP is the default timer value for \f2timeout mode\fP.
It is the number of clock ticks allowed before timing out.
The
value of one clock tick depends on the hardware, but is usually
1/100 or 1/60 of a second. 
A timeout value of 20 is 1/5 second at 100Hz;
with a 60Hz clock, a value of 12 produces a 1/5 second timeout.
Values from 5 to 400 inclusive are allowed by the module; if the value
set for \f4KBDTIME\fP is outside this range, the module forces it to
the nearest limit.
(This value is only
a default; users may change their particular stream to use a different
value depending on their own preferences, terminal baud-rate,
and typing speed.)
.SH FILES
.nf
\f4/usr/lib/kbd\fP	  	\- directory containing system standard table files.
\f4/usr/lib/kbd/\(**.map\fP	\- source for some system table files.
.fi
.SH SEE ALSO
\f4kbdset\fP(1), \f4kbdcomp\fP(1M), \f4kbdload\fP(1M), \f4alp\fP(7).
.SH NOTES 
\s-1NULL\s+1 characters may not be used in result or input strings, because they
are used as string delimiters.
.PP
One should be able to obtain information on timeout values of currently
attached tables, and be able to reset values more easily.
