calmsacibis995/irix-6517-src/eoe/man/man7m/klog.7
'\"macro stdmacro
.TH KLOG 7
.SH NAME
klog \- kernel error logging interface
.SH DESCRIPTION
Minor device 0 of the
.I klog
driver is the interface between a process and the kernel's error
logging mechanism.
When this device is open, messages printed by the kernel, which
normally appear only in the system console window, also are buffered
by the
.I klog
driver.
The data obtained by reading from this driver are the text of
the kernel messages.
The driver may be opened only for reading by a single process.
Each read causes the requested number
of bytes to be retrieved; the request is truncated if the read request is
for more than the data currently available.
.PP
Normally, this device is opened and read
by \f2syslogd\fP(1M), the system logging daemon.
.PP
This special device supports the following
.IR open (2)
flags:
.RS
.TP
.B O_NDELAY
When set a read will not block if no data is present.  If not set, a read
will block until information becomes available.
.RE
.PP
Each \f2ioctl\fP(2) call that this special device supports has the form:
.PP
.RS
.ft 3
ioctl(fd, cmd, arg)
.ft 1
.RE
.PP
where the format and meaning of
.I arg
vary with the specified \f2cmd\fP as described below:
.RS
.TP
.B FIONREAD
Returns the number of bytes currently available to read to the
area pointed to by
.IR arg ,
where
.I arg
is treated as a pointer to a variable of type \f3size_t\fP.
.TP
.B FIONBIO
Enables or disables non-blocking mode, according to the boolean value
supplied as \f2arg\fP.
Enabling this mode has the same affect as the
.B O_NDELAY
flag for
.IR open (2).
.TP
.B FIOASYNC
Enables or disables asynchronous mode, according to the boolean value
supplied as \f2arg\fP.
When asynchronous mode is enabled, the process
group associated with the open of the special device receives a
.B SIGIO
signal when data is available to be read.
.TP
.B TIOCSPGRP
Set the process group for use with asynchronous I/O (\f3FIOASYNC\fP).
For this command,
.I arg
should contain the process group id.
.TP
.B TIOCGPGRP
Returns the current process group to the area pointed to by
.IR arg ,
where
.I arg
is treated as a pointer to a variable of type \f3int\fP.
.RE
.SH FILES
/dev/klog	special file
.SH "SEE ALSO"
open(2), ioctl(2), syslogd(1M)
'\".so /pubs/tools/origin.bsd
