calmsacibis995/irix-6517-src/eoe/man/man7m/ldap.7p
.TH LDAP 7P
.SH NAME
ldap \- Lightweight Directory Access Protocol (Client)
.SH SYNOPSIS
/var/ns/lib/libns_ldap.so
.SH DESCRIPTION
.PP
Lightweight Directory Access Protocol (LDAP) is a specification for a 
client-server protocol to retrieve and manage directory information.
Originally intended as a means for clients on lightweight workstations
to access X.500 directories, it can be used with any directory 
system which follows the X.500 data model.
The libns_ldap.so shared
library contains routines to contact a remote LDAP server daemon, fetch
information, and format it so that it is available to local name service
routines.  This library is meant to be used with the nsd(1M) name service
daemon only.
.PP
The library \fB/var/ns/lib/libns_ldap.so\fP is opened by the \fBnsd(1M)\fP
daemon when \fBldap\fP is listed as the protocol for some map in a
\fBnsswitch.conf\fP file.  On first open the library initialization procedure
parses the configuration file \fB/var/ns/ldap.conf\fP to determine the list
of servers to contact, and the schemas for each table in the database.
.PP
The library contains code to fetch data from a remote LDAP server and present
it as lines from the configuration file from which it came.  The nsd daemon
then presents that data in the filesystem mounted under /ns.
.PP
Extended attributes in the \fBnsswitch.conf\fP file can be used to control
the behavior of the LDAP protocol.  Extended attributes are simply lists of
key/value pairs attached to each object in the nsd filesystem.  The
attributes supported in this library are:
.TP
.B domain
The \fBdomain\fP is used to determine which remote LDAP server to contact
for a request.  This attribute is typically inherited from the daemon
depending on the nsswitch.conf file that is being read.
.TP
.B table
The \fBtable\fP attribute is typically inherited from the daemon based on
the line from which this entry occurs in the nsswitch.conf file.  In the
above example the \fBtable\fP attribute would be set to \fBhosts.byname\fP
or \fBhosts.byaddr\fP depending on the context of the request.  The table 
attribute determines which database schema and format are used.  See the
ldap-ns.conf(4) man page for more information on schemas.
.TP
.B key
The \fBkey\fP is set by the nsd daemon for each request.  The schema for
the current table typically contains a rewriting rule for the key to make 
an appropriate request to the remote LDAP daemon.
.TP
.B open_timeout
The \fBopen_timeout\fP attribute specifies the amount of time in seconds
the client will wait for a bind or connect request to be returned from
the server before giving up.  The default is 2 seconds.
.TP
.B search_timeout
The \fBsearch_timeout\fP attribute specifies the amount of time in seconds
the client will wait for a search request to be returned from the server
before giving up.  The default is 2 seconds.
.TP
.B error_timeout
The \fBerror_timeout\fP attribute specifies the amount of time in seconds
a particular server will be taken off of the round-robin cue after an
error has occurred.  The default is 5 seconds.
.TP
.B max_requests
The \fBmax_requests\fP attribute specifies the number of referrals that
will be followed for a given request.  The default is 3.
.SH SEE ALSO
nsd(1M), nsswitch.conf(4), ldap.conf(4)
.br
\fBIRIX Admin: Networking and Mail\fP
