calmsacibis995/irix-6517-src/eoe/man/man7m/llc2.7
.TH LLC2 7 "Network Utilities" " "
\" SpiderX.25 Manual Pages - Acknowlegements to Berkeley SCCS @(#) llc2.7 5 5/12/92
\" DJJM/TR 11th April 89 
\" TR       1st Nov   89  changed llc2conf to llc2template
.SH NAME
llc2 \-
.IR \s-1DLPI\s0
multiplexor-driver
.SH DESCRIPTION
.PP
.B "llc2" 
is the Data Link Provider Interface (DLPI) (\f2dlpi\fP(7)) STREAMS 
multiplexor-driver which provides
the logical link control (LLC) for Local Area Networks (LAN)
(e.g. 
.IR "Ethernet",
.IR "Token Ring",
.IR "FDDI") 
as specified in IEEE 802.2.
.PP
The multiplexor supports all LLC type 1 and type 2 procedures.
.PP
\fI/dev/llc2\fP is the interface to the upper multiplexor of DLPI.
It provides a mechnism for the Data Link Service (DLS) user to access
different LAN media (DLS providers). Examples of the DLS user are X.25, OSI, 
and SNA.
.PP
The driver does not have any accessible user-level interface.
.PP
.SH SEE ALSO
.PP
dlpi(7)
