calmsacibis995/irix-6517-src/eoe/man/man7m/mem.7
'\"macro stdmacro
.if n .pH g7.mem @(#)mem	30.2 of 12/25/85
.nr X
.if \nX=0 .ds x} MEM 7 "" "\&"
.if \nX=1 .ds x} MEM 7 ""
.if \nX=2 .ds x} MEM 7 "" "\&"
.if \nX=3 .ds x} MEM "" "" "\&"
.TH \*(x}
.SH NAME
mem, kmem, mmem \- core memory
.SH DESCRIPTION
The file
.I /dev/mem\^
is a special file that is an image of the core memory
of the computer.
It may be used, for example, to examine,
and even to patch the system.
.PP
Byte addresses in
.I /dev/mem\^
are interpreted as memory addresses.
References to non-existent locations cause errors to be returned.
.PP
Examining and patching device registers is likely
to lead to unexpected results when read-only or write-only
bits are present.
.PP
The file
.I /dev/kmem\^
is similar to
.I /dev/mem\^
except that kernel virtual memory, rather than physical memory, is accessed.
.I read(2)
and
.I write(2)
access is supported, to
kernel virtual space that represents physical memory.
\f2mmap\f1(2) access to
.I /dev/kmem
is not supported.
This is due to
.I mmap
creating data consistency problems which could lead to corrupted data
and kernel panics.
.PP
The file
.I /dev/mmem
is similar to
.I /dev/kmem
except that only \f2mmap\f1(2) access is permitted (both read and write),
and only for those addresses configured into the system via the file
\f2/var/sysgen/master.d/mem\f1 and the \f2/etc/autoconfig\f1 script.
.SH FILES
/dev/mem
.br
/dev/kmem
.br
/dev/mmem
.SH WARNING
Some of \f2/dev/kmem\f1 cannot be read because
of write-only addresses or unequipped memory addresses.
.\"	@(#)mem.7	6.2 of 9/6/83
.Ee
'\".so /pubs/tools/origin.att
