calmsacibis995/irix-6517-src/eoe/man/man7m/nisserv.7p
.TH NISSERV 7P
.SH NAME
nisserv, ypserv \- Network Information Services Protocol (Server)
.SH SYNOPSIS
/var/ns/lib/libns_nisserv.so
.SH DESCRIPTION
.PP
The Network Information Services Protocol (NIS) is a simple Sun RPC
based protocol to fetch keyed data from a remote host.  It is typically
used to distribute name service information in medium sized
organizations.  The data is maintained on a single host (designated the
NIS master), and is pushed occasionally to a list of slave servers.
Client systems dynamically locate a server and request data given a
domain name, map name and key.  In Irix the daemon \fBnsd(1M)\fP acts
as both the server and client side proxy for the protocol.  The server
side is implemented in the nsd extension library \fBnisserv(7P)\fP
while the client side and binding server are implemented in the nsd
extension library \fBnis(7P)\fP.  This manual page documents the
behavior of the server side protocol library for the nsd daemon.
Applications which wish to make direct requests can still use the NIS
API routines documented in \fBypclnt(3Y)\fP.
.PP
The library \fB/var/ns/lib/libns_nisserv.so\fP is opened by the \fBnsd(1M)\fP
daemon when \fBnis\fP is listed as the protocol for some map in a
\fBnsswitch.conf\fP file.  On first open the library initialization procedure
sets up a port to handle YPSERV RPC requests.
.PP
For each NIS DOMAIN for which you wish to act as a server the configuration
file \fB/var/ns/domains/DOMAIN/nsswitch.conf\fP must exist, and for each
map you want to serve in that domain, a line must exist of the form:
.nf
.in +.5i
hosts: nisserv
.in -.5i
.fi
The script \fBypinit(1M)\fP will create the nsswitch.conf file for a domain
and on a master will create all the database files by running \fBmdbm_parse\fP
to read the local configuration files and parse them into \fBmdbm(3B)\fP hash
files.  On a slave it will use \fBypxfr(1M)\fP to copy the database files
from the master.
.PP
If the file \fB/etc/securenets\fP exists then only requests originating on
one of these networks will be responded to.  See \fBsecurenets(4)\fP for
more information on this file.
.PP
Extended attributes in the \fBnsswitch.conf\fP file can be used to control
the behavior of the NIS protocol.  Extended attributes are simply lists of
key/value pairs attached to each object in the nsd filesystem.  The
attributes supported in this library are:
.TP
.B domain
This is the domainname which is typically given as part of the request.
A request can be made to look into multiple different databases, or even
forwarded to another remote name server like:
.nf
.in +.5i
hosts: nisserv(domain=engr) nisserv(domain=corp) nis(domain=mfg)
.in -.5i
.fi
.TP
.B table
The \fBtable\fP attribute is sent as part of the request.  This
implementation includes a number of tables which were not in the original
implementation. To include a local table a line must exist in the
nsswitch.conf file for the table to specify the resolution order, and an
mdbm file must exist in \fB/var/ns/domains/DOMAIN/\fP for each table.
.TP
.B key
This is passed in as part of the request and is used to fetch data out of
the database file.
.TP
.B nis_secure
The \fBnis_secure\fP attribute is a boolean which specifies that data
can only be sent to requests originating on a privileged port. In
order to have the client send requests from a privileged port, this
same attribute is required on the client (see \fBnis(7P)\fP).
.SH ENABLING
The NIS server functionality of \fBnsd\fP must be enabled via the
\fBchkconfig ypserv\fP command.
.SH NOTE
The daemon \fBnsd(1M)\fP with this library now replaces the daemon
\fBypserv\fP from previous IRIX releases.  Similarly, nsd with the
\fBnis(7P)\fP library replaces the daemon \fBypbind\fP from
previous releases.
.SH FILES
\fB/etc/securenets\fP
.br
\fB/var/ns/domains/*/nsswitch.conf\fP
.SH SEE ALSO
chkconfig(1M), nsd(1M), nsswitch.conf(4), nis(7P), securenets(4)
.br
\fBIRIX Admin: Networking and Mail\fP
.br
\fBIRIX NIS Administration Guide\fP
