calmsacibis995/irix-6517-src/eoe/man/man7m/prf.7
'\"macro stdmacro
.if n .pH g7.prf @(#)prf	30.2 of 12/25/85
.nr X
.if \nX=0 .ds x} PRF 7 "" "\&"
.if \nX=1 .ds x} PRF 7 ""
.if \nX=2 .ds x} PRF 7 "" "\&"
.if \nX=3 .ds x} PRF "" "" "\&"
.TH \*(x}
.SH NAME
prf \- operating system profiler
.SH DESCRIPTION
The special file
.I /dev/prf
provides access to activity information
in the operating system.
Writing the file
loads the measurement facility with text addresses to be monitored.
Reading the file returns these 
addresses and a set of counters
indicative of activity between adjacent text addresses.
.PP
The recording mechanism is driven by a separate profiling clock.
The profiling clock period is set so that it does not become
synchronized with the regular system clock.
Samples that catch the operating system
are matched against the stored text addresses
and increment corresponding counters for later processing.
.PP
The file
.I /dev/prf
is a pseudo-device
with no associated hardware.
.SH FILES
/dev/prf
.SH "SEE ALSO"
profiler(1M).
.\"	@(#)prf.7	6.2 of 9/6/83
.Ee
'\".so /pubs/tools/origin.att
