calmsacibis995/irix-6517-src/eoe/man/man7m/root.7m
.TH root 7M
.SH NAME
root, rroot, usr, rusr, swap, rswap \- partition names
.SH DESCRIPTION
.BR root ,
.BR rroot ,
.BR usr ,
.BR rusr ,
.BR swap ,
and
.B rswap
are the device special files providing access to important
partitions on the root disk drive of a system.  These links
are made by the
.IR MAKEDEV (1m)
script, and map to fixed partitions, even if not used that way
by local conventions.  Therefore it is best not to change these links,
if you intend to use different partition layouts, but rather to use
the full device name
.RI ( /dev/dsk/dks* )
instead, particular in 
.IR fstab (4).
The names beginning
with \f3r\f1 are the raw (character) device access; the others are
the block device access, which uses the kernel buffer system.
.PP
The standard system drive partition allocation shipped by Silicon Graphics has
.B root
on partition 0 and
.B swap
on partition 1.
Partition 7 is the entire
usable
portion of the disk (excluding the volume header) and is normally
used for 
.I option
drives, rather than the system drive.
Partition 8 is the volume header (see
.IR vh (7M),
.IR prtvtoc (1M),
and
.IR dvhtool (1M)).
Partition 10 (\f4vol\fP) is the entire drive.
.PP
The standard system with SCSI drives usually has
.I /dev/root
linked to
.IR /dev/dsk/dks0d1s0 ,
.I /dev/swap
linked to
.IR /dev/dsk/dks0d1s1 ,
and (if / and /usr are seperate filesystems, a
.I usrroot
partitioning),
.I /dev/usr
linked to
.IR /dev/dsk/dks0d1s6 .
.SH FILES
.br
/dev/dsk/dks*
.br
/dev/rdsk/dks*
.br
/dev/root
.br
/dev/usr
.br
/dev/swap
.br
/dev/rvh
.SH SEE ALSO
MAKEDEV(1M),
dvhtool(1M),
fx(1M),
prtvtoc(1M),
fstab(4),
dksc(7M),
vh(7M).
