calmsacibis995/irix-6517-src/eoe/man/man7m/scsiha.7m
.ds f. scsiha.7m
'\"macro stdmacro
'\" $Revision: 1.5 $
.de _C	\" prefix for C code
.RS 2
.nf
.ta 2 +2 +2 +2 +2 +2 +2 +2
.ps -2
.vs -2
.ft C	\" fixed size font
.sp
..
.de _E	\" end C code include
.sp
.ps	\" return to previous sizes
.vs
.ft P	\" return to previous font
.DT
.fi
.RE
..
.TH SCSIHA 7M
.SH NAME
scsiha \- SCSI bus and loop operation driver
.SH SYNOPSIS
/hw/scsi_ctlr/<number>/bus
.SH DESCRIPTION
.PP
The scsiha driver is used to pass requests to the scsi host adapter
drivers to perform activities that aren't related to SCSI commands
issued to individual
devices.  On parallel SCSI, this includes operations like resetting
a SCSI bus and probing for devices.  With Fibrechannel, it adds
loop initialization, device reset and port bypass.
.LP
All communication through the scsiha driver is via ioctls.  Opens and
closes automatically succeed.  The ioctl structure is defined in
.IR <sys/scsi.h>,
and is called
.I scsi_ha_op .
The
.I scsi_ha_op
structure:
._C
struct scsi_ha_op
{
	uint		sb_opt;    /* command option */
	uint		sb_arg;    /* usually data count */
	uintptr_t	sb_addr;   /* usually user address */
};
typedef struct scsi_ha_op scsi_ha_op_t;
._E


.LP
The
.I sb_opt
field is typically used to specifiy different options to the ioctl.
For example, the debug level of the host adapter driver, or a sub-operation code.
.br
The
.I sb_arg
field is typically used to specify how much data to transfer to/from
the user level application and the driver.
.br
The
.I sb_addr
field should contain the user address to transfer the data to/from.
.LP
There are a number of different ioctls that can be issued.

.ta
SOP_RESET - fields unused
.br
SOP_SCAN - fields unused
.br
SOP_DEBUGLEVEL - uses sb_opt
.br
SOP_LIP - fields unused
.br
SOP_LIPRST - sb_opt is target ID to reset (255 = all targets)
.br
SOP_LPB - sb_opt is target ID to bypass
.br
SOP_LPE - sb_opt is target ID to enable
.br
SOP_LPEALL - fields unused
.br
SOP_QUIESCE - sb_opt is time for quiesce attempt, sb_arg is time for quiesce to be active
.br
SOP_QUIESCE_STATE - sb_addr is address of state variable
.br
SOP_UN_QUIESCE - fields unused
.br
SOP_GET_SCSI_PARMS - sb_addr is address to receive data
.br
.fi

.nf
Hardware Interface Driver Support

IOCTL                   WD93    WD95    SCIP    QL      ADP78   FCADP
---------------------------------------------------------------------
SOP_RESET               YES     YES     YES     YES     YES     YES
SOP_SCAN                YES     YES     YES     YES     YES     YES
SOP_DEBUGLEVEL          NO      NO      NO      YES     NO      YES
SOP_LIP                 NO      NO      NO      NO      NO      YES
SOP_LIPRST              NO      NO      NO      NO      NO      YES
SOP_LPB                 NO      NO      NO      NO      NO      YES
SOP_LPE                 NO      NO      NO      NO      NO      YES
SOP_LPEALL              NO      NO      NO      NO      NO      YES
SOP_QUIESCE             NO      NO      NO      YES     NO      YES
SOP_QUIESCE_STATE       NO      NO      NO      YES     NO      YES
SOP_UNQUIESCE           NO      NO      NO      YES     NO      YES
SOP_GET_SCSI_PARMS      NO      NO      NO      YES     YES     NO
.fi
.sp 2
.nf
Utilization By Program

IOCTL                   scsiha  scsiadminswap   scsiquiesce
-----------------------------------------------------------
SOP_RESET               YES         NO          NO
SOP_SCAN                YES         YES         YES
SOP_DEBUGLEVEL          YES         NO          NO
SOP_LIP                 YES         NO          NO
SOP_LIPRST              YES         NO          NO
SOP_LPB                 YES         NO          NO
SOP_LPE                 YES         NO          NO
SOP_LPEALL              YES         NO          NO
SOP_QUIESCE             NO          YES         YES
SOP_QUIESCE_STATE       NO          YES         YES
SOP_UNQUIESCE           NO          YES         YES
SOP_GET_SCSI_PARMS      YES         NO          NO
.fi

.SH NOTES
.LP
Since the driver provides direct access to the SCSI host adapter, the
system administrator must be very careful in setting up the permissions on
the device files, lest security holes occur, no checking is performed
for potentially dangerous actions (bus reset, get data, send data,
port bypass).  There should be no reason for non-superuser use of
this driver interface.  Resetting a SCSI bus can affect currently
running programs.  Anything that is using a tape drive will be aborted
when the bus is reset.
.SH FILES
.LP
.I /hw/scsi_ctlr/#/bus
.SH SEE ALSO
.LP
ds(7M) to issue SCSI commands directly to devices.
.br
scsiha(1m), scsiquiesce(1m), scsiadminswap(1m),
for programs that use this driver.
