calmsacibis995/irix-6517-src/eoe/man/man7m/smfd.7m
'\"macro stdmacro
.if n .pH ts
.nr X
.if \nX=0 .ds x} SMFD 7M "" "\&"
.if \nX=1 .ds x} SMFD 7M ""
.if \nX=2 .ds x} SMFD 7M "" "\&"
.if \nX=3 .ds x} SMFD "" "" "\&"
.TH \*(x}
.SH NAME
smfd, floppy, floptical \- driver for SCSI floppy and floptical disk drives
.SH SYNOPSIS
/dev/rdsk/fds*
.SH DESCRIPTION
This driver supports 5 \(14" floppy drives in 3 standard formats when
used with the freestanding SCSI floppy drive.
The standard single and double density dual sided 3 \(12" drive and 
the 3 \(12" 20.1MB floptical drive is also supported.
.PP
The driver also supports a large range of special formats
by use of the
\f3SMFDSETMODE\fP ioctl 
(defined along with the associated structure in
\f2/usr/include/sys/smfd.h\fP).
.PP
Most of the ioctls for the \f3dksc\fP also apply to this driver, with the
exception of the bad block handling.  The volume header ioctl \f3DIOCGETVH\fP
is supported by creating the structure based on the current driver
parameters.  The \f3DIOCGETVH\fP ioctl is not supported.
Individual tracks may be formatted using the \f3DIOCFMTTRK\fP ioctl
and the fmt_map_info structure defined in 
.I /usr/include/sys/dvh.h.
The \f3SMFDMEDIA\fP ioctl is
used to get the status of the floppy and the \f3SMFDEJECT\fP ioctl
is used to eject the floppy on a drive with the software eject mechanism.
.PP
The standard devices (and suffixes) are the standard PC formats of 360KB (.48), 720KB (.96),
1.2 MB (.96hi) on the regular 5 \(14" device,
and the standard
720 KB (.3.5), and 1.44MB (.3.5hi).  The .3.5.20m suffix is for the 20.1MB
3 \(12" floptical drives and disks only.
.PP
The special files are named according to the convention
discussed in 
.IR intro (7M), 
with the exception of \f3.type\f1, instead
of \f3s#\f1:
.sp
.ce
\f3/dev/{r}dsk/fds<controller-#>d<drive-#>{.type}\f1
.sp
.PP
These devices can be used as filesystems, as backup devices,
and for data interchange with other systems.
.PP
Ordinarily, the devices may be opened by more than one process at a time,
as long as all are opened at the same density.  Attempts to open at a
different density than which it is already open will fail.
.PP
To manually access a disk, use \fBmount(1m)\fP.  \fBmediad(1m)\fP can also be
configured to automatically mount a disk.  New disks must be formatted;
see \fBmkfp(1m)\fP.
.SH FILES
/dev/{r}dsk/fds?d?.48
.br
/dev/{r}dsk/fds?d?.96
.br
/dev/{r}dsk/fds?d?.96hi
.br
/dev/{r}dsk/fds?d?.3.5
.br
/dev/{r}dsk/fds?d?.3.5hi
.br
/dev/{r}dsk/fds?d?.3.5.20m
.br
.SH ERROR RETURNS
The following errors are returned by this driver; other errors can also
be returned by higher levels of the operating system.
.IP EAGAIN 10
The drive returned an error indicating it was not ready (media ejected,
and so on).
.IP EIO 10
Some physical I/O error has occurred.
.IP ENXIO 10
Device number doesn't correspond to a valid device.
.SH NOTE
In previous releases, the flag
.B O_EXCL
had special meaning to this driver when used on open;
it is now ignored.  For true exclusive use access, the
.IR ds (7m)
driver should be used, with the 
.B O_EXCL
flag passed on open, where it will either complete the open with
no other opens allowed, or will fail if the device is already
open by any driver.
.sp
An open will now succeed if there is no media in the floppy drive.
.SH SEE ALSO
fx(1M), mkfp(1m), fpck(1m), mediad(1m), mount(1m), open(2), 
intro(7), dksc(7M), ds(7m)
