calmsacibis995/irix-6517-src/eoe/man/man7m/t3270.7
'\"macro stdmacro
.if n .pH man7.t3270 @(#)t3270	30.3 of 2/1/86
.nr X
.if \nX=0 .ds x} T3270 7 "Silicon Graphics" "\&"
.if \nX=1 .ds x} T3270 7 "Source Code Control System Utilities"
.if \nX=2 .ds x} T3270 7 "" "\&"
.if \nX=3 .ds x} T3270 "" "" "\&"
.TH \*(x}
.UC 5
.SH NAME
t3270 \- Silicon Graphics 3270 interface card
.SH DESCRIPTION
This is the driver for the Silicon Graphics 3270 interface card.
The card is a communication adapter for the connection of a Silicon
Graphics 4D system to a IBM 3270 Cluster Controller using
the 3270 Coax Type A protocol.
.PP
For Control Unit Terminal (CUT) operations, the coax emulation code
is soft-loaded by the driver onto the card to maintain the session,
and to manage the contents of the display buffer.
.PP
For Distributed Function Terminal (DFT) operations, the coax
emulation code is to maintain the communication session, while the
driver is responsible for the decoding and execution of the SNA
data stream.
.PP
The interface between the coax emulation code and the driver is
maintained as a dual-ported communication memory area, while the
interface between the driver and the application level emulator
(t3270(1)) is through ioctl.
.LP
.ta 0.5i 1.0i 1.5i 2.6i
.nf
	#include <sys/t3270reg.h>
	di_info_t diaginfo;

	ioctl(fd,UCODE_DLOAD,addr);	/* microcode download */
	ioctl(fd,START_8344,0);		/* start the DP8344 */
	ioctl(fd,EM_CTRL,ctrl_word);	/* set emulation control */
	ioctl(fd,SET_DID,id);		/* set device id */
	ioctl(fd,START_COMM,0);		/* start communication */
	ioctl(fd,STOP_COMM,0);		/* stop communication */
	ioctl(fd,CUR_UD,cursor);	/* get cursor */
	ioctl(fd,SCR_UD,scr);		/* update screen */
	ioctl(fd,SEND_KEY,key);		/* send key code */
	ioctl(fd,BEGIN_MSG,0);		/* begin messaging mode */
	ioctl(fd,STOP_MSG,0);		/* stop messaging mode */
	ioctl(fd,SEND_MSG,msg_count);	/* send message */
	ioctl(fd,RECV_MSG,addr);	/* receive message */
	ioctl(fd,SET_TIME,t);		/* set timeout */
	ioctl(fd,SELF_TST,&diaginfo);	/* self test */
	ioctl(fd,REG_TST,&diaginfo);	/* register test */
	ioctl(fd,DP_MEM_TST,&diaginfo);	/* data memory test */
	ioctl(fd,IT_MEM_TST,&diaginfo);	/* instruction memory test */

	typedef struct {
		u_int	pattn_w;	/* pattern written */
		u_int	pattn_r;	/* pattern read */
		u_short	err_addr;	/* where error occur */
		u_char	err_flag;	/* type of error */
		u_char	cycles;		/* # of test cycle */
	}	di_info_t;		/* diag info */

.PP
Only one device file may be opened at a time.
.SH FILES
/dev/t3270
.SH SEE ALSO
t3270(1)
'\".SH ORIGIN
'\"Silicon Graphics, Inc.

