calmsacibis995/irix-6517-src/eoe/man/man7m/ticlts.7
'\"! tbl | mmdoc
'\"macro stdmacro
.if n .pH g7.ticlts @(#)ticlts	40.9 of 1/3/91
.\" Copyright 1991 UNIX System Laboratories, Inc.
.\" Copyright 1989, 1990 AT&T
.nr X
.if \nX=0 .ds x} ticlts 7 "" "\&"
.if \nX=1 .ds x} ticlts 7 ""
.if \nX=2 .ds x} ticlts 7 "" "\&"
.if \nX=3 .ds x} ticlts "" "" "\&"
.TH \*(x}
.SH "NAME"
\f4ticlts, ticots, ticotsord\fP \- loopback transport providers
.SH "SYNOPSIS"
.nf
.ftCW
#include <ticlts.h>
#include <ticots.h>
#include <ticotsord.h>
.ft 1
.fi
.SH "DESCRIPTION"
The devices known as \f4ticlts\fP, \f4ticots\fP, and \f4ticotsord\fP 
are ``loopback transport providers,'' that is, stand-alone networks
at the transport level.
Loopback transport providers are
transport providers in every sense except one:
only one host (the local machine) is ``connected
to'' a loopback network.
Loopback transports present a
.SM TPI
(\f4STREAMS\f1-level) interface to
application processes and are intended to be accessed via the 
.SM TLI
(application-level) interface.
They are implemented as clone devices
and support address spaces consisting of ``flex-addresses,'' i.e.,
arbitrary sequences of octets, of length >\ 0,
represented by a \f4netbuf\fP structure.
.P
\f4ticlts\fP is a datagram-mode transport provider.
It offers (connectionless) service of type \f4T_CLTS\fP.
Its default address size is \f4TCL_DEFAULTADDRSZ\fP.
\f4ticlts\f1 prints the following error messages
(see \f4t_rcvuderr\fP(3N)):
.sp
.nf
.ta.5i 2.2i
	\f4TCL_BADADDR\f1	bad address specification
	\f4TCL_BADOPT\f1	bad option specification
	\f4TCL_NOPEER\f1	bound
	\f4TCL_PEERBADSTATE\f1	peer in wrong state
.fi
.P
\f4ticots\f1 is a virtual circuit-mode transport provider.
It offers (connection-oriented) service of type \f4T_COTS\fP.
Its default address size is \f4TCO_DEFAULTADDRSZ\fP.
\f4ticots\fP prints the following disconnect 
messages
(see \f4t_rcvdis\fP(3N)):
.TS
center;
lfCW l.
TCO_NOPEER	no listener on destination address
TCO_PEERNOROOMONQ	peer has no room on connect queue
TCO_PEERBADSTATE	peer in wrong state
TCO_PEERINITIATED	peer-initiated disconnect
TCO_PROVIDERINITIATED	provider-initiated disconnect
.TE
.P
\f4ticotsord\f1
is a virtual circuit-mode transport provider, offering service of type 
\f4T_COTS_ORD\fP (connection-oriented service with orderly release).
Its default address size is \f4TCOO_DEFAULTADDRSZ\fP.
\f4ticotsord\fP prints the following disconnect 
messages
(see \f4t_rcvdis\fP(3N)):
.TS
center;
lfCW l.
TCOO_NOPEER	no listener on destination address
TCOO_PEERNOROOMONQ	peer has no room on connect queue
TCOO_PEERBADSTATE	peer in wrong state
TCOO_PEERINITIATED	peer-initiated disconnect
TCOO_PROVIDERINITIATED	provider-initiated disconnect
.TE
.SH "USAGE"
Loopback transports support a local
.SM IPC
mechanism through the
.SM TLI
interface.
Applications implemented in a
transport provider-independent manner on a client-server model
using this
.SM IPC
are transparently transportable to networked environments.
.P
Transport provider-independent applications must not include
the header files listed in the synopsis section above.
In particular,
the options are (like all transport provider options)
provider dependent.
.P
\f4ticlts\fP and \f4ticots\fP
support the same service types
(\f4T_CLTS\f1 and \f4T_COTS\f1) supported by the
.SM OSI
transport-level model. 
The use of \f4ticlts\fP and \f4ticots is encouraged.
.P
\f4ticotsord\fP supports the same service type (\f4T_COTSORD\f1)
supported by the
.SM TCP/IP
model.
The use of \f4ticotsord\fP is discouraged except for reasons of
compatibility.
.SH "FILES"
.nf
\f4/dev/ticlts\f1
\f4/dev/ticots\f1
\f4/dev/ticotsord\f1
.fi
