calmsacibis995/irix-6517-src/eoe/man/man7m/tsd.7
'\"macro stdmacro
.if n .pH g7.tsd @(#)tsd	1.1 of 7/19/94
.\" Copyright 1994 SGI
.nr X
.if \nX=0 .ds x} tsd 7 "" "\&"
.if \nX=1 .ds x} tsd 7 ""
.if \nX=2 .ds x} tsd 7 "" "\&"
.if \nX=3 .ds x} tsd "" "" "\&"
.TH \*(x}
.SH NAME
\f4tsd\fP \- TELNET server protocol \s-1STREAMS\s0 device
.SH DESCRIPTION
\f4tsd\fP is a \s-1STREAMS\s0-based module that provides Internet TELNET
server protocol handling within the IRIX kernel.
.P
When the device special file
.I /dev/tnclone
is opened a stream is created and is attached to a special terminal
device. A program can call \f4fstat\fP(2) with the returned file
descriptor to determine which device the stream has been connected
to. The device behaves like a terminal with transparent TELNET server
protocol processing.
.P
On success, an open of \f4tnclone\fP returns a non-negative number.
On failure, it returns -1 and \f4errno\fP is set to one of the following
values:
.TP 13
\f4ENXIO\fP
\f4tsd\fP devices are not configured into the kernel or all are in use.
.TP
\f4ENODEV\fP
Devices are not configured into the kernel, or device file does not
exist, or device numbers are incompatible.
.TP
\f4EBUSY\fP
Exclusive open failed because another process already has the device open.
.SH "FILES"
.DT
/dev/tnclone				- telnet stream clone device
.br
/dev/tty[ghij][0-0xff]		- telnet streams terminals
.SH "CAVEATS"
The \f2tsd\fP driver is intended to be used only by the
\f4telnetd\fP(1M) program and the interface is likely to change in
future releases.
.SH "SEE ALSO"
streamio(7), telnetd(1M)
.Ee
'\".so /pubs/tools/origin.sgi
