calmsacibis995/irix-6517-src/eoe/cmd/miser/man/man4/cpuset.4
.TH cpuset 4
.SH NAME
\f3cpuset\f1, \f3miser_cpuset\f1 \- cpuset configuration files
.SH DESCRIPTION
A cpuset is defined by a cpuset configuration file and a name.
The cpuset configuration file is used to list the CPUs that are 
members of the cpuset and contains any additional parameters needed 
to define the cpuset.  The file permissions of the configuration 
file define access to the cpuset. Everytime permissions need to be 
checked, the current permissions of the file are used. It is therefore 
possible to change access to a particular cpuset, without having to 
tear it down and recreate it, simply by changing the access permissions. 
Read access allows a user to retrieve information about a cpuset while
execute permission allows the user to attach a process to the cpuset.
.P
The name of the cpuset is a three to eight character string.  Queue 
names having one or two characters are reserved for use by IRIX.
.SH EXAMPLE
The following configuration file describes an exclusive cpuset containing
4 CPUs:
.nf
\f3
#cpuset configuration file
EXCLUSIVE
MEMORY_LOCAL
MEMORY_EXCLUSIVE

CPU 16 
CPU 17
CPU 18
CPU 19
\f1
.fi
.P
This specification will create a cpuset containing 4 CPUs, and will
restrict those cpus to running threads that have been explicitly 
assigned to the cpuset.  Jobs running on the cpuset will use memory 
from nodes containing the cpus in the cpuset. Jobs running on other 
cpusets or on the global cpuset will not use memory from these nodes.
.SH SUMMARY
Commands are newline terminated,
characters following the comment delimiter '#' are ignored, case
matters, and tokens are separated by whitespace which is ignored.
.P
The valid tokens are:
.TP
.BR EXCLUSIVE
Defines a cpuset to be restricted. It can occur anywhere in the
file. Anything else on the line is ignored.
.TP
.BR MEMORY_LOCAL
Threads assigned to the cpuset will attempt to assign memory only 
from nodes within the cpuset.  Assignment of memory from outside the 
cpuset will occur only if no free memory is available from within the 
cpuset.  No restrictions are made on memory assignment to threads 
running outside the cpuset.
.TP
.BR MEMORY_EXCLUSIVE
Threads not assigned to the cpuset will not use memory from within 
the cpuset unless no memory outside the cpuset is available.

If, at the time a cpuset is created, memory is already assigned to 
threads that are already running, no attempt will be made to explicitly 
move this memory.  If page migration is enabled, the pages will be
migrated when the system detects that most references to the pages are 
non-local.
.TP
.BR MEMORY_KERNEL_AVOID
The kernel should attempt to avoid allocating memory from nodes contained in
this cpuset. If kernel memory requests cannot be satisfied from outside this
cpuset, this option will be ignored and allocations will occur from within the
cpuset. (This avoidance currently extends only to keeping buffer cache away
from the protected nodes.)
.TP
.BR CPU " cpuid "
Specifies a CPU that will be part of the cpuset.
.SH "SEE ALSO"
cpuset(1).
