calmsacibis995/irix-6517-src/eoe/cmd/miser/man/man4/miser_submit.4
.TH miser_submit 4
.SH NAME
\f3miser_submit\f1 \- resource schedule list
.SH DESCRIPTION
The 
.I miser_submit
command allows the user to specify the resource schedule of a particular 
job in a file.  The resource is a list of resource specifications, called 
segments, that define the resource requirements of a particular job.  A  
resource specification is a tuple of CPUs, memory and wall clock time.  
Currently Miser only supports resource schedules consisting of one segment.  
A segment also has additional optional fields defining how the job is 
scheduled.
.P
The resource file consists of a list of segments.  Each segment must begin 
with the token SEGMENT and have the number of CPUs, memory, and wall clock 
time specified.  In addition to the resources, it is also possible to specify 
additional scheduling parameters. 
.SH EXAMPLE
An example resource schedule list for an application that requires 10 CPUs,
100 megabytes of memory, and 100 minutes of wall clock time:
.nf
\f3
#resource schedule
SEGMENT
TIME 100m
NCPUS 10
MEMORY 100m
\f1
.fi
.SH SUMMARY
Commands are newline terminated, characters following the comment delimiter 
'#' are ignored, and case matters.  Each new segment must begin with the 
token 'SEGMENT' and must have the number of CPUs, memory, and wall clock time 
specified.
.P
The valid tokens are:
.TP
.BR SEGMENT
Defines the beginning of a new segment of the resource schedule.
.TP
.BR NCPUS " cpus"
The number of CPUs that the segment can use.
.TP
.BR MEMORY " memory [g|m|k] "
The maximum amount of memory, for all requested CPUs, that can be used at 
any one point.  The memory is specified by a positive integer followed by 
a unit of 
.I g 
for gigabyte,
.I m
for megabyte, and
.I k
for kilobyte.  If no unit is specified the value is assumed to be bytes.
.TP
.BR TIME " time "
The time, total wall clock time requested for the job, is the product of 
the total wall clock time per CPU and the number of CPUs (time = wall 
clock time per CPU * number of CPUs).  The time can either be specified 
by a positive integer followed by an 
.I h 
for hours,
.I m
for minutes, or
.I s 
for seconds.  The time may also be specified by a string of the form 
.I hh:mm.ss.
.TP
.BR STATIC 
This is an optional field.  A segment that is
.I STATIC
and submitted to a queue with a default scheduling policy has the 
property that an application will only run when the segment is scheduled 
to run.  It will not run earlier even if there are idle resources available 
to the application.  If the segment is submitted to a queue with a repack 
policy it may be rescheduled and run earlier than the time that it was 
initially scheduled at.
.TP
.BR MULTIPLE " number "
If a miser policy cannot schedule an application with the number of CPUs 
requested, the miser policy may try to schedule the application with fewer 
CPUs.  This option allows the user to specify what multiple of CPUs may be 
considered.  For example, if an application can only be run using CPUs in 
multiples of two, the multiple value specified would be two.  If no value 
is specified the default is one.
.TP
.BR EXCEPTION " type "
This is an optional field.  The type parameter may only be "KILL" at this 
time.  Future versions of miser may support additional options.
.SH "SEE ALSO"
miser_submit(1).
