calmsacibis995/irix-6517-src/eoe/cmd/miser/man/man4/miser_move.4
.TH miser_move 4 
.SH NAME
\f3miser_move\f1 \- resource transfer list
.SH DESCRIPTION
The 
.I miser_move 
command allows the resource tuples and start and end times to be specified
in a file.
.P
The resource transfer list consists of a single segment. The
segment begins with the token SEGMENT and has a start and end time,
as well as a set of resources specified.  
.SH EXAMPLE
An example resource list transferring a 2 CPUs 2 minutes in the future
from queue user to queue user2 is
.nf
\f3
SEGMENT
START 120
END   320 
NCPUS 2
MEMORY 0
\f1
.fi
.SH SUMMARY
Commands are newline terminated,
characters following the comment delimiter are '#' are ignored,
case matters,
each new segment must begin with the token SEGMENT and
must have the number of CPUs, memory and wall clock time
specified.
.P
The valid tokens are:
.TP
.BR SEGMENT
Defines the begining of a new segment of the resource schedule.
.TP
.BR NCPUS " cpus"
The number of CPUs that the segment can use.
.TP
.BR MEMORY " memory [g|m|k] "
The maximum amount of memory that can be used at any one point. The memory
is specified by a positive integer followed by a unit of 
.I g 
for gigabyte,
.I m
for megabyte, and
.I k
for kilobyte. If no unit is specified the value is assumed to be
bytes.
.TP
.BR START " time "
The start time is the time from the current time resources are to begin
being transferred from the source queue.
.TP
.BR END " time "
The end time is the time from the current time resources to stop being
transferred from the source queue.
Both the end and start times can either be specified by a positive integer
followed by an 
.I h 
for hours,
.I m
for minutes, or
.I s 
for seconds. The time may also be specified by a string of
the form 
.I hh:mm.ss.
.SH "SEE ALSO"
miser_move(1)
