calmsacibis995/irix-6517-src/irix/man/man2/nanosleep.2
'\"macro stdmacro
.TH NANOSLEEP 2 
.SH NAME
nanosleep \- high resolution sleep
.Op c p a
.SH C SYNOPSIS
.nf
.B #include <time.h>
.PP
.B "int nanosleep(const struct timespec *rqtp, struct timespec *rmtp);
.fi
.PP
.Op
.SH DESCRIPTION
.PP
The
.I nanosleep
system call causes the current thread to suspend until either the
time interval specified by the
.B rqtp
argument has elapsed or a signal is delivered to the calling
thread and its action is to invoke a signal-handling function
or terminate the process.
.PP
The suspension time will be rounded to a multiple of the underlying
system-provided sleep resolution.  On Onyx/Challenge systems
this resolution is defined by the variable
.B fasthz
which may be examined or modified using
.I systune(1M).
On other platforms, the resolution is determined by
.B fasthz
for realtime processes and by the length of a clock
tick for non-realtime processes.
The length of a clock tick is defined by
.B CLK_TCK
in the include file
.I <limits.h>.
This is the same for all
.SM
.I IRIS-4D
products.
.SH "SEE ALSO"
sleep(3), sginap(2), alarm(2), pause(2), schedctl(2), timers(5), realtime(5).
.SH "DIAGNOSTICS"
.PP
If the calling thread remains suspended for the requested time
interval, 
.I nanosleep
returns 0.  If, however, the thread is interrupted prematurely
by a signal, it returns \-1 and sets
.I errno
to indicate the interruption.  If the
.B rmtp
argument is non-NULL, the
.B timespec
structure referenced by it contains the amount of time
remaining in the interval.
.PP
If any of the following conditions occur,
.I nanosleep
returns \-1 and sets
.I errno
to indicate the error:
.TP 15
.SM
\%[EFAULT]
An argument address referenced invalid memory.
.TP 15
.SM
\%[EINTR]
.I nanosleep
was interrupted by a signal.
.TP 15
.SM
\%[EINVAL]
The
.B rqtp
argument specified a nanosecond value less than zero or greater than
 or equal to 1000 million.
