calmsacibis995/irix-6517-src/irix/man/man1m/cached.1m
.TH cached 1M
.SH NAME
cached \- monitor single bit secondary cache errors.
.SH SYNOPSIS
.nf
\f3cached\f1 [\f3\-s\f1 size] [\f3-S\f1 delay] [\f3-fC\f1] [\f3-p\f1 priority]
.fi
.SH DESCRIPTION
.I cached
monitors the number of single bit errors in the secondary cache of
each cpu. It reports the number of single bit errors encountered on
any cpu each time it runs.
.PP
The
.BI \-s " size"
parameter determines the size of the cpu secondary cache in bytes.
If no value is specified, the default value of 4194304 (4 MB) is used.
.P
The 
.BI \-S " delay"
parameter indicates the amount of time to wait each time between examining
the secondary caches. This delay is in seconds and the default is 3600
seconds (one hour).  The -C option must be used for this option to
mean anything useful.
.P
The
.BI \-p " priority"
parameter indicates the priority cached will be run at.  The value can
be in the range -20 to 20 with -20 being the highest priority and 20
being the lowest.  The priority defaults to 10.
.P
The 
.BI \-f 
parameter indicates that cached should run on all enabled
cpus. Normally cached does not run on restricted cpus.
.P
The
.BI \-C
parameter indicates that cached should run continuously, sleeping and
running the check of secondary caches forever.  If this option is
not specified, the program runs once and then exits.

.SH OVERVIEW
.I cached
uses the R10000 performance registers at the user level to monitor the
number of single bit cache errors. Single bit errors are
automatically corrected by the hardware. If the secondary cache has
numerous single bit errors, there is a possibility that these could
turn into multi-bit errors which are fatal for the system. Monitoring
the number of single bit errors provides a means of warning the user
early enough so that the cpu module containing the cache may be
replaced. 

.I cached
runs at a very low priority by default so as not to interfere with the
normal usage of the machine.

.SH NOTES
.I cached 
is run as a cron job and can be turned off or controlled using the
.I diagsetup
script.

To avoid
disruptions to real-time usage, cached normally does not run on
isolated or restricted cpus. This can be overriden by using the -f flag.


.SH FILES
.PD 0
.TP 27
/usr/diags
the diag user's home directory
.TP
/usr/diags/bin/cached
location of cached executable
.TP
/usr/diags/bin/diagsetup
script to control the periodic running of testfpu and cached
.PD
.SH FILES


.SH SEE ALSO
testfpu(1M), diagsetup(1M)


.SH RESTRICTIONS
This command works only on MIPS R10000 systems. 


