calmsacibis995/irix-6517-src/irix/man/man1m/chkconfig.1m
.TH chkconfig 1M
.SH NAME
chkconfig \- configuration state checker
.SH SYNOPSIS
.nf
\f3chkconfig\f1 [ \f3\-s\f1 ]
\f3chkconfig\f1 \f2flag\f1
\f3chkconfig\f1 [ \f3\-f\f1 ] \f2flag\f1 [ \f3on\f1 | \f3off\f1 ]
.fi
.SH DESCRIPTION
.I chkconfig
with no arguments or with the
.B \-s
option prints the state (\f3on\f1 or \f3off\f1) of every
configuration flag found in the directory
.IR /var/config .
The flags normally are shown sorted by name; with the
.B \-s
option they are shown sorted by state.
.PP
A flag is considered
.B on
if its file contains the string ``on'' and
.B off
otherwise.
.PP
If
.I flag
is specified as the sole argument,
.I chkconfig
exits with status 0 if
.I flag
is
.B on
and with status 1 if
.I flag
is
.B off
or nonexistent.
The exit status can be used by shell scripts to test the state of a flag.
Here is an example using
.IR sh (1)
syntax:
.Ex
if /sbin/chkconfig verbose; then
	echo "Verbose is on"
else
	echo "Verbose is off"
fi
.Ee
The optional third argument allows the specified flag to be set.
The flag file must exist in order to change its state.
Use the
.B \-f
(``force'') option to create the file if necessary.
.PP
These flags are used for determining the configuration status
of the various available subsystems and daemons during system
startup and during system operation.
.PP
A daemon or subsystem is enabled if its
configuration flag in the
.I /var/config
directory is in the
.B on
state.
If the flag file is missing, the flag is considered
.BR off .
The following is a list of available flags and the
associated action if the flag is
.BR on .
Depending upon your configuration, they may not all be
available on your system.
.TP 16
.B 4DDN
Initialize 4DDN (DECnet connectivity) software.
.TP 16
.B acct
Start process accounting.
.TP 16
.B auto_ipaddress
Enable dynamic host configuration protocol (DHCP) as a client.
See \f2proclaim\fP(1M).
.TP 16
.B autofs
Start the NFS autofs daemon.
Only one of the pair
.B autofs and
.B automount
should normally be enabled.
.TP 16
.B automount
Start the NFS automounter daemon.
.if 0 .TP 16
.if 0 .B cserver
.if 0 Start zh_CN Chinese convert engine, if the optional product
.if 0 \f2Chinese Language Module\fP is installed.
.TP 16
.B desktop
If off, fewer of the IRIX Interactive Desktop(TM) user interface features are enabled,
and typically a different toolchest menu is used.
It is identical to
creating the file
.I $HOME/.disableDesktop
except that it applies to all accounts.
The specific effect is that the desktop version of Xsession
.RI ( /usr/lib/X11/xdm/Xsession.dt )
is not run upon login, and therefore programs started from
that file are not run or are run with different options.
.TP 16
.B fontserver
Start the X11R6 font server daemon.
See \f2xfs\fP(1).
.TP 16
.B gated
Start the Cornell routing daemon instead of the BSD routed.
.TP 16
.B hypernet
Initialize HyperNET controller and routes.
.TP 16
.B ipfilterd
Enable the Silicon Graphics IP Packet Filtering daemon.
.TP 16
.B jserver
Start Japanese convert engine if the optional product
\f2Japanese Language Module\fP is installed.
.if 0 .TP 16
.if 0 .B kserver
.if 0 Start Korean convert engine, if the optional product
.if 0 \f2Korean Language Module\fP is installed.
.TP 16
.B lockd
Start the NFS lock and status daemons.
.TP 16
.B mediad
Start the removable media daemon.
.TP 16
.B mrouted
Start the IP multicast routing daemon (useful only on gateways).
.TP 16
.B named
Start Internet domain name server.
.TP 16
.B network
Allow incoming and outgoing network traffic.
This flag can be
set off if you need to isolate the machine from the
network without removing cables.
.TP 16
.B nfs
Start the NFS daemons
.I nfsd
and
.IR biod .
Mount all NFS filesystems.
.TP 16
.B noiconlogin
Do not show user icons on the login screen.
.TP 16
.B nsr
Start up the IRIS NetWorker daemons.
See
.IR nsr (1M)
for more details.
.TP 16
.B nostickytmp
Do not turn the sticky bit on for the directories
.I /tmp
and
.IR /var/tmp .
.TP 16
.B pcnfsd
Start the PC-NFS server daemon.
.TP 16
.B pmcd
Start the Performance Metrics Collector Daemon.
See
.IR pmcd (1)
for more details.
.TP 16
.B pmie
Start the Performance Metrics Inference Engines.
See
.IR pmie (1)
and
.IR pmie_check (1)
for more details.
.TP 16
.B privileges
Enable privileges to be used on the system.  See
.IR runpriv (1M)
and
.IR privilege (4)
for more details.
.TP 16
.B quotacheck
Run
.IR quotacheck (1M)
on the filesystems that have quotas enabled.
See
.IR quotas (4)
for more details.
.TP 16
.B quotas
Enable quotas for local configured filesystems.
.TP 16
.B rarpd
Start the Reverse ARP daemon.
.TP 16
.B routed
Start the 4.3BSD RIP routing daemon.
See
.IR routed (1M)
for more details.
.TP 16
.B rsvpd
Start the RSVP daemon.
See
.IR rsvpd (1M)
for more details.
.TP 16
.B rtnetd
Initialize preemptable networking for real-time use.
.TP 16
.B rwhod
Start the 4.3BSD rwho daemon.
.TP 16
.B sar
Start the system activity reporter.
.TP 16
.B savecore
Enable the saving of kernel crash images.
Some information
is saved in \f3/var/adm/crash\fP even if saving is disabled.
See \f2savecore\fP(1M) and \f2icrash\fP(1M).
.TP 16
.B snmpd
Start the Simple Network Management Protocol daemon.
.TP 16
.B soundscheme
Start the IRIX Interactive Desktop audio cue daemon.
.TP 16
.B timed
Start the 4.3BSD time synchronization daemon.
.TP 16
.B timeslave
Start the Silicon Graphics time synchronization daemon.
.if 0 .TP 16
.if 0 .B tserver
.if 0 Start zh_TW Chinese convert engine, if the optional product
.if 0 \f2Chinese Language Module\fP is installed.
.TP 16
.B verbose
Print the names of daemons as they are started.
.TP 16
.B videod
Enable the video daemon.
Used by video devices such
as \f2vino\fP.
.TP 16
.B vswap
Add virtual swap.
See
.IR swap (1M)
for a discussion of virtual swap.
By default 80000 blocks are added.
You can increase or
decrease this amount by modifying the
.I /var/config/vswap.options
file.
.TP 16
.B visuallogin
Enable the visual login screen.
.TP 16
.B windowsystem
Start the X window system.
If
.B windowsystem
is
.BR off ,
it is necessary to modify
the
.IR inittab (4)
file to enable
.IR getty (1M)
on the textport window if you wish to use
graphics as a dumb terminal.
.IP
The recommended means of enabling and disabling the
window system are the commands
.IR startgfx (1G)
and
.IR stopgfx (1G).
.TP 16
.B xdm
Start the X display manager.
.TP 16
.B xlv
Start the daemons for \f2xlv\fP logical volumes optional features.
.TP 16
.B yp
Enable NIS, start the ypbind daemon.
.TP 16
.B ypmaster
If
.B yp
is
.BR on ,
become the NIS master and start the passwd server.
The
.B ypserv
flag should be on too.
.TP 16
.B ypserv
If
.B yp
is
.BR on ,
become a NIS server.
.SH FILES
/var/config	directory containing configuration flag files
.SH SEE ALSO
cron(1M),
rc0(1M),
rc2(1M).
