calmsacibis995/irix-6517-src/irix/man/man1m/clshmctl.1m
'\"macro stdmacro
.na
.TH CLSHMCTL 1M
.SH NAME
\f4clshmctl\fP \- Administration tool for CrayLink Shared Memory
.SH SYNOPSIS
.na
\f4clshmctl startup\fP
.br
\f4clshmctl shutdown\fP
.br
\f4clshmctl getcfg\fP
.br
\f4clshmctl maxpgs\fP <\f4num of pages\fP>
.br
\f4clshmctl maxdpgs\fP <\f4num daem pages\fP>
.br
\f4clshmctl timeout\fP <\f4daemon timeout\fP>

.in
.SH DESCRIPTION

\f4clshmctl\fP is a system-administrator's tool for controlling the
resources associated with CrayLink-shared-memory (clshm) -- a means of
cache-coherent, shared-memory communication between partitions on an
Origin-2000.  Each partition of an Origin-2000 has its own hostname, IP
address and operating-system, and behaves as a stand-alone host.  clshm
has a system V shared memory interface in the form of a user library
(\f4xp_func\fP(3p) and \f4part_func\fP(3p)) that can be used directly by
user-applications.

.PP

\f4clshmctl\fP performs various functions needed to administer the
software devices and daemon associated with clshm and returns
operational status information.

.PP 

\f4clshmctl\fP is invoked with one of the following function names, and
the associated parameters:

.TP 12
\f4startup\fP 
Configure clshm on the local partition, and start up the clshm devices
and \f4clshmd\fP(1m) daemon with default parameters. The value of the
defaults can be examined by using the \f4clshmctl getcfg\fP function, as
explained later. The startup step is performed at system boot-up by
\f4/etc/init.d/sn0start\fP and is required before any inter-partition
communication can be effected over CrayLink Shared Memory. This startup
at bootup time must be enabled using the \f4chkconfig\fP(1m) command for
\f4clshmd\fP(1m).  It also needs to be done if clshm has been reset by a
\f4clshmctl shutdown\fP command.  \f4clshmctl startup\fP also creates
and initializes the software devices through which shared-memory
communication is performed.

.TP 12
\f4shutdown\fP 
Forces a reset of the clshm software on the local
partition.  The \f4clshmd\fP(1m) daemon is made to exit and the
resources associated with the clshm software devices are released.
\f4clshmctl shutdown\fP should be used carefully since any user-program
using the clshm devices will be killed when this function is called.

.TP 12
\f4getcfg\fP 
Returns the configuration of clshm on the local partition.  The
parameters configurable through \f4clshmctl\fP are the maximum number of
16K pages of shared-memory that are supported, the number of 16K pages
shared between the daemon and the kernel driver, and the timeout time
before the \f4clshmd\fP(1m) daemon wakes up from sleeping and checks for
a message from the driver when there is no user activity going on.

.TP 12
\f4maxpgs\fP <\f4num of pages\fP> 
Sets the maximum number of pages of shared memory that can be associated
with any of the channels on the local partition.  \f4maxpgs\fP <\f4num
of pages\fP> will fail if it is called after \f4clshmctl startup\fP has
been called (without another \f4clshmctl shutdown\fP).  In order to set
this parameter, the \f4clshmd\fP(1m) daemon must be in the shutdown
state.

.TP 12
\f4clshmctl maxdpgs\fP <\f4num daem pages\fP>
Sets the maximum number of shared memory pages that the clshm driver can
use to communicate with the \f4clshmd\fP(1m) daemon.  Like \f4maxpgs\fP,
this call will fail if made after a \f4clshmctl startup\fP call has been
made.

.TP 12
\f4clshmctl timeout\fP <\f4daemon timeout\fP>
Sets the timeout value in milliseconds that the \f4clshmd\fP(1m) daemon
will sleep before checking for messages in the shared memory segment
from the driver.  If there are messages coming in on either other daemon
or user sockets, then the driver will not sleep the full amount of the
timeout, but will process all messages if fines on all sockets and in
the shared memory segment.


.SH WARNINGS
If the \f4clshmd\fP(1m) daemon aborts abnormally a \f4clshmctl
shutdown\fP must be called before a \f4clshmctl startup\fP can be called
again to restart the shared-memory mechanism.

.SH FILES
\f4/etc/init.d/sn0start\fP

.SH SEE ALSO

\f4clshmd\fP(1m), \f4chkconfig\fP(1m), \f4xp_func\fP(3p), \f4part_func\fP(3p),
\f4clshm_diag\fP(1m), \f4mkpart\fP(1m)
