calmsacibis995/irix-6517-src/irix/man/man1m/clshmd.1m
'\"macro stdmacro
.na
.TH CLSHMD 1M
.SH NAME
\f4clshmd\fP \- Daemon for inter-partition shared-memory communication 
over CrayLink.
.SH SYNOPSIS
.na
\f4clshmd\fP <\f4unit\fP>

.in
.SH DESCRIPTION

\f4clshmd\fP is a daemon which facilitates the setting up and tearing
down of shared-memory communication over CrayLink between different
partitions of a partitioned Origin-2000 machine.  \f4clshmd\fP should
not be started up directly from the command-line. Rather, the
\f4startup\fP function of \f4clshmctl\fP(1m) should be used to set up
this daemon.

.PP

Each partition of a partitioned Origin-2000 runs a distinct kernel.
CrayLink Shared-Memory allows low-latency shared-memory communication
between applications running on the distinct partitions. For such
communication to be effected, physical memory from one partition is
mapped to user buffers in a different partition. The different kernels
which are involved in such mappings have to exchange information for the
mapping to take place.  \f4clshmd\fP allows the kernels to communicate
over CrayLink using an RPC-like mechanism. It should be noted that the
kernels need to communicate only when the inter-partition-mapped buffers
are set up, torn down, when a new partition comes up dynamically, or
when an existing partition is brought down for administrative
maintainence or other reasons. Neither \f4clshmd\fP, nor the different
kernels are involved during steady-state inter-partition shared-memory
communication. The \f4clshmd\fP daemon contains some state necessary to
allow the \f4xp_func\fP(3p) user library to have a system V-like
interface which includes \f4part_func\fP(3p) helper functions.  It also
has a shared memory segment that is shared between it and the clshm
kernel driver.  It receives messages from the driver in this area and
sends messages to the driver through \f4ioctl\fP(2) calls.

.PP

\f4clshmd\fP takes only one parameter.  This parameter is the
<\f4unit\fP> number of the clshm driver.  This should always be \f3"0"\fP.
Other numbers are reserved for future expansion.  All other controlling
state of the daemon can be set with the different parameters of the
\f4clshmctl\fP(1m) command before the \f4clshmctl startup\fP command is
issued.

.PP

\f4clshmd\fP uses two hwgraph files.  \f3/hw/clshm/0/ctl\fP and
\f3/hw/clshm/0/shm\fP are used by the clshm.  The \f3"0"\fP in the paths
are the unit number of the clshm driver.  \f3ctl\fP stands for "control"
file which is used for setting up shared memory between the driver and
daemon and the \f3shm\fP stands for "shared memory" file which is used
by the user library to mmap shared memory segments into user processes.

.SH FILES
\f3/hw/clshm/\fP

.SH SEE ALSO
\f4clshmctl\fP(1m), \f4xp_func\fP(3p), \f4part_func\fP(3p), 
\f4clshm_diag\fP(1m), \f4mkpart\fP(1m)
