calmsacibis995/irix-6517-src/irix/man/man1m/diagsetup.1m
.TH diagsetup 1M
.SH NAME
diagsetup \- control the contents of the diag user's running of cached
and onlinediag
.SH SYNOPSIS
.nf
\f3diagsetup\f1 \f3\-x\f1 "cached <options>" [\f3-h\f1 | \f3-d\f1 hour | \f3-w\f1 wkday | 
	\f3-m\f1 monthday | \f3-n\f1] [\f3-t\f1 hour]
\f3diagsetup\f1 \f3\-x\f1 "onlinediag <options>" [\f3-h\f1 | \f3-d\f1 hour | \f3-w\f1 wkday
	| \f3-m\f1 monthday | \f3-n\f1] [\f3-t\f1 hour]
.fi
.SH DESCRIPTION
.I diagsetup
controls the running of 
.I cached 
and 
.I onlinediag 
by the diag user.  This command can be used to either turn off the
running of these diagnostic tests or to make them run more frequently or
less frequently then they do by default.
.PP
The
.BI \-x " cached <options> | onlinediag <options>"
parameter indicates which diagnostic testing program we are modifying
the behavior of.  We can modify the frequency of running one of these
programs.  The -x parameter must be present for this program to run.
.P
The 
.BI \-h
parameter indicates that the given program will be run once an hour on
the hour.  This parameter is the default for the cached diagnostic
program.
.P
The 
.BI \-d " hour"
parameter indicates that the given program will be run once a day on the
given hour.  This parameter with the "0" hour is the default for the
onlinediag diagnostic program.
.P
The 
.BI \-w " weekday"
parameter indicates that the given program will be run once a week on 
the given day of the week.
.P
The 
.BI \-m " monthday"
parameter indicates that the given program will be run once a month
on the given day of the month.
.P
The 
.BI \-n
parameter indicates that the given program should never be run.  It
turns off the periodic testing until someone turns it back on.
.P
The
.BI \-t " hour"
parameter indicates the hour on a given day of the month or day of a
week (used with the -w or -m parameters) that the program should be run.
If this is not specified, the default is the "0" hour (midnight).


.SH OVERVIEW
.I diagsetup
modifies the crontab file of the diag user.  The diag user is in charge
of running of the 
.I cached 
and 
.I onlinediag 
programs that run sanity checks during run time.  Because the diag user
has the same user id as the root user, the diagnositic tests run with
root permissions.  However, this means the crontab file of the diag user
cannot be modified using the
.I crontab
command (it will try to modify the root crontab instead).  diagsetup can
be used to easily modify the diag user's crontab file.  If the diag
crontab file is modified directly, diagsetup may no longer run
correctly.

.I diagsetup
overwrites the crontab file of the diag user every time that it runs and
also sends a SIGHUP to cron so that it will process the new crontab
file.


.SH FILES
.PD 0
.TP 27
/usr/diags
the diag user's home directory
.TP
/usr/diags/bin/diagsetup
location of diagsetup script
.TP
/var/spool/cron/crontabs/diag
crontab of the diag user
.PD


.SH SEE ALSO
cached(1M), onlinediag(1M)
