calmsacibis995/irix-6517-src/irix/man/man1m/egconfig.1m
.TH egconfig 1M
.SH NAME
egconfig \- configure gigabit ethernet interfaces
.SH SYNOPSIS
.nf
.\"\f3/usr/etc/egconfig\f1 [ \f3\-l\f1 ] [ \f3\-r\f1 \f2nRRBs\f1 ] \f3interface\f1
\f3/usr/etc/egconfig\f1 [ \f3\-l\f1 ] \f3interface\f1
.fi
.SH DESCRIPTION
.I egconfig
is executed at system startup time to download the firmware for
each gigabit Ethernet (''egN'') interface configured into the system.
After
.I egconfig
executes, it is still necessary to use
.IR ifconfig (1M)
to configure protocol addresses and other parameters.
.PP
.I egconfig
is run automatically at system startup.  It should not normally be necessary
to execute it, unless resetting the interface is required.
.SH OPTIONS
.TP
\-l
Disables auto-link-negotiation on the specified interface.  This should only
be used when attaching to other equipment that does not negotiate correctly.
.ig
.TP
\-r
Configures the interface to use
.I nRRBs
Read Response Buffers (RRBs)
in the Bridge interface chip.  This is used to improve performance in the cases
where there are fewer devices on the PCI bus.  The default number is 2.  Legal
values are 2-6.
XIO cards will normally be allocated 6 RRBs.  Cards in PCI cardcages or
in Origin 200 PCI busses will typically get 2 or 3, depending on how many other
devices share the PCI bus.  Since there are only 8 RRBs, which are shared among
all devices on the PCI bus, misconfiguration of this value can result in some
devices failing to operate correctly.
The startup script will compute the correct number
automatically.  Do not put this option into the
.B egN.options
file unless you have a very good reason for overriding the system's estimate.
..
.SH "SEE ALSO"
ifconfig(1M), network(1M), ethernet(7).
.SH FILES
/etc/config/eg\f2N\f1.options	per-interface options (for egconfig only)
