calmsacibis995/irix-6517-src/irix/man/man1m/flash.1m
.TH flash 1M
.SH NAME
flash \- reprogram the flash PROM hardware on Origin and OCTANE machines
.SH SYNOPSIS
.nf
\f3flash\f1 [ \f3\-a\f1 ] [ \f3\-c\f1 ] [ \f3\-d\f1 ] [ \f3\-D\f1 ] \c
[ \f3\-f\f1 ] [ \f3\-F\f1 ] [ \f3\-i\f1 ] [ \f3\-m\f1 \f2module_id\f1 ]
	[ \f3\-n\f1 ] [ \f3\-o\f1 ] [ \f3\-p\f1 \f2dir_name\f1 ] \c
[ \f3\-P\f1 \f2img_name\f1 ] [ \f3\-s\f1 \f2slot_name\f1 ] \c
[ \f3\-S\f1 ]
	[ \f3\-v\f1 ] [ \f3\-V\f1 ]
.PP
.nf
\f3flash\f1 \f3-L\f1
.fi
.SH DESCRIPTION
\f2flash\f1 allows a user to manage the flash
PROMs on the IO and node boards of Origin high-end and the
base system board on OCTANE systems.
Without options, the command flashes all appropriate boards
on the machine with the PROM images found in \f2/usr/cpu/firmware\f1.
Normally, \f2flash\f1 is executed
automatically during the installation of a new release of IRIX.
A customer should rarely need to use it directly.  You must have superuser
privilege to use this command.
.PP
By default on Origin systems, \f2flash\f1 takes the current 
configuration values
(such as processor speed and cache size) that are currently stored
in the PROM and uses these values when flashing the new images.
Without options, \f2flash\f1 proceeds in parallel in two phases.
Half the
boards are flashed in the first phase and half in the second.
Using options, it is possible to flash a subset of the boards.
Also, the user can specify a different image directory and different image
files.
.PP
By default on OCTANE systems, the single system flash PROM
is flashed with the specified image.
On OCTANE systems, options specifying multiple PROMs, 
types of PROMs, or PROM configuration
values will be silently ignored.
.PP
OCTANE systems have an additional feature of storing information
from diagnostics in the flash PROM for extraction at a later time.
The \f3-L\f1 option invokes this processing, and transfers the 
extracted information into syslog.  This processing will take place
automatically during each system boot.
.PP
Unless forced, \f2flash\f1 does not flash the PROM unless the
specified version is newer than what is currently in the PROM.
\f2flash\f1 can also be used to obtain information about the
current PROMs.
.PP
The options are:
.TP 13
.B \-a
Flash all PROMs at once, overriding the protection of flashing in two groups.
.TP 13
.B \-c
Flash only the node (CPU) PROMs on the machine.
.TP 13
.B \-d
Print out the PROM header information for the current PROMs.
.TP 13
.B \-D
Dump the entire contents of a PROM to a file.
.TP 13
.B \-f
Specify different (than currently in PROM) configurations values to be used
when the new images are flashed.
These values include the speed of the
CPU, hub, and size of the cache.
This option should be used with great
care as cause the machine to freeze and be rendered unusable if incorrect
values are given.
.TP 13
.B \-F
Similar to \f3\-f\f1 except more detailed information is required and no
checking is done in the input values.
This is more dangerous the
\f3\-f\f1 option and the same cautions apply.
.TP 13
.B \-i
Flash only the IO PROMs on the machine.
.TP 13
.B \-m \f2module_id\f1
Flash only PROMs in the module given by \f2module_id\f1.
.TP 13
.B \-n
Flash only the node (CPU) PROMs on the machine.
.TP 13
.B \-o
Override the version checking and flash the PROM even if it is not
newer than what is currently on the PROM.
.TP 13
.B \-p \f2dir_name\f1
Specify a directory other than the default of \f2/usr/cpu/firmware\f1 to look
for images.
Note that there are standard names that \f2flash\f1 looks
for and thus the files in this should follow the correct naming scheme.
.TP 13
.B \-P \f2img_name\f1
Specify the full pathname of the image desired to be flashed.
The options
specifying the type of PROM to be flashed should match the PROM specified in
\f2img_name\f1.
.TP 13
.B \-s \f2slot_name\f1
Flash only the PROMs in the slot given by \f2slot_name\f1.
.TP 13
.B \-S
Force all the flashes to occur sequentially (versus in two parallel phases).
.TP 13
.B \-v
Turn on verbose mode.
.TP 13
.B \-V
Print currently loaded flash PROM version and time flashed information.
.PP
OCTANE specific options
.TP 13
.B \-L
Extract information logged into the flash PROM by diagnostics from the
PROM and into syslog.
.SH FILES
.PD 0
.TP 35
/usr/cpu/firmware/io6prom.img
default file for flashing IO PROMs for Origin
.TP
/usr/cpu/firmware/ip27prom.img
default file for flashing node PROMs for Origin
.TP
/usr/cpu/firmware/IP30prom.bin
default file for flashing OCTANE PROMs
.PD
.SH WARNINGS
The \f2flash\f1 command is not intended for casual use.
If used
incorrectly, it can completely freeze a system and prevent it from even
booting the PROM.
Also, frequent flashing decreases the lifetime of the
system's boards.
Silicon Graphics strongly recommends that this command
only be used under the supervision of a support representative.
