calmsacibis995/irix-6517-src/irix/man/man1m/flashio.1m
.TH flashio 1M
.SH NAME
flashio \- reprogram the flash PROM hardware on Everest-based machines
.SH SYNOPSIS
.nf
\f3flashio\f1 [\f3\-s\f1 slot] [\f3\-q\f1] [\f3\-f\f1] promfile.bin
\f3flashio \-v\f1
.sp .8v
.fi
.SH DESCRIPTION
\f2flashio\f1 allows a user to manage the flash
PROMs on the IO4 board of Everest-based high-end systems (the
Challenge L/XL, PowerChallenge L/XL, Onyx L/XL, and PowerOnyx L/XL are
all based on the Everest architecture).
Normally, \f2flashio\f1 is executed
automatically during the installation of a new release of IRIX; as a
result, a customer should rarely need to use it directly.
.PP
\f2flashio\f1 can perform two major tasks: it can alter the contents of
the flash PROMs by transferring the contents of a file into them, and
it can display the revision of the firmware currently stored in the
flash PROMs.
When the \f3\-v\f1 switch is used, \f2flashio\f1 displays
the current firmware revisions contained in the flash PROMs of all the
IO4 boards in the system.
All the flash PROMs should contain the
same firmware revision as a rule.
.PP
By default, if no command-line switches are specified, \f2flashio\f1
tries to reprogram all of the IO4 flash PROMs in the system with
the contents of the binary file specified on the command line.
In
current versions of IRIX, the only valid IO4 PROM firmware binary
file is \f2/usr/cpu/firmware/io4prom.bin\f1.
Future versions of
IRIX may ship additional firmware binaries, however, and occasionally
the system's service provider might provide an optional file.
.PP
Firmware binary files contain a version number that \f2flashio\f1
uses to determine whether or not to load the binary into the flash
PROMs.
Normally, if a binary file's revision number is lower than or
equal to the
firmware revision that is currently in a flash PROM, \f2flashio\f1
displays a warning message and refuses to overwrite the newer
firmware.
To force \f2flashio\f1 to overwrite the
contents of the flash PROMs regardless of the firmware revisions,
use the \f3\-f\f1 (for force) command-line switch.
.PP
The following switches can be used to alter \f2flashio\f1's behavior:
.TP 10
.BI \-s " slot"
Limits flash PROM reprogramming to specific
boards.
If, for example, you want to only reprogram the flash
PROMs on board 3, you can type \f3flashio \-s 3 io4prom.bin\f1.
The \f3\-s\f1 switch can be specified multiple times, once for each
board that should be programmed.
In the absence of this switch,
\f2flashio\f1 reprograms the flash PROMs on all of the IO4 boards
in the system.
This switch has no meaning when specified in conjunction
with the \f3\-v\f1 switch.
.TP
.B \-f
Forces \f2flashio\f1 to reprogram the flash PROMs
regardless of the revision numbers.
Normally, you use this
switch only if you are reverting to a previous version of the operating
system and want to ensure that the firmware matches the operating
system being run.
Because the kernel/firmware interface rarely changes,
however, reverting the flash PROMs to a previous version should not be
necessary.
.TP
.B \-T
Obsolete.
.TP
.B \-v
Causes \f2flashio\f1 to display the revision numbers
of the firmware that is currently programmed in the flash PROMs.
.SH FILES
.TP 32
/usr/cpu/firmware/io4prom.bin
contains the binary image of the firmware currently installed
.SH WARNINGS
The \f2flashio\f1 command is not intended for casual use.
If used
incorrectly, it can render a system unbootable and greatly decrease
the lifetime of the system's IO4 boards.
Silicon Graphics strongly recommends that
this command only be used under the supervision of a support representative.
