calmsacibis995/irix-6517-src/irix/man/man1m/flashmmsc.1m
.TH flashmmsc 1M
.SH NAME
flashmmsc \- reprogram the MMSC on Origin2000 systems
.SH SYNOPSIS
.nf
\f3flashmmsc \f1[\f3\-a\f1] [\f3\-r\f1 \f2rack\f1] [\f3\-f\f1 \f2imagefile\f1]
\f3flashmmsc \-m\f1 [\f3\-f\f1 \f2imagefile\f1]
\f3flashmmsc \-d\f1 [\f3-l\f1 \f2serial-device\f1] [\f3\-f\f1 \f2imagefile\f1]
\f3flashmmsc \f3\-V\f1 [\f3\-f\f1 \f2imagefile\f1]
\f3flashmmsc \f3\-p\f1
.sp .8v
.fi
.SH DESCRIPTION
\f2flashmmsc\f1 allows a user to manage the firmware installed
on the multi-module system controller ("MMSC") of Origin2000 rack systems.
Ordinarily, an MMSC is shipped with firmware pre-installed.
The \f2flashmmsc\f1 command is only needed by a customer for
upgrades or emergency repairs of the MMSC firmware.
.PP
There are several ways to use the \f2flashmmsc\f1 command.
In the first form, the \f2flashmmsc\f1 command is assumed to be
issued from a terminal that has access to one of the MMSC's associated
with the system.
Such a terminal can access the MMSC itself by first typing the
\f2MMSC-escape character\f1, typically CONTROL-T.
In this arrangement, the \f2flashmmsc\f1 command will transfer the new
firmware image over the terminal's serial line.
.PP
If the \f3-a\f1 switch is specified, the \f2flashmmsc\f1 command
will automatically initiate the transfer to the MMSC specified by \f2rack\f1,
or to the MMSC directly attached to the terminal's serial line if 
\f2rack\f1 is not specified.
.PP
However, older MMSC's may not be capable of handling automatic
transfer initiation.
In these cases, it is necessary to invoke \f2flashmmsc\f1 with the
\f3-m\f1 switch.
Next, the MMSC \f3flash\f1 command is issued to the desired MMSC
by first typing the \f2MMSC-escape character\f1 then the appropriate
\f3flash\f1 command.
For example, to flash a new firmware image onto rack 2
of a system that uses CONTROL-T for its \f2MMSC-escape
character\f1, the sequence of events may look like this:
.sp .8v
.nf
    % flashmmsc -m

    Ready to transfer new image to full-feature system
    controller. To begin the transfer, type your MMSC
    escape character (normally CTRL-T) followed by the
    command:

        rack <rackid> flash

    where <rackid> is the identifier for the system
    controller you wish to upgrade.

[User types CONTROL-T]

     MMSC> rack 2 flash
    Waiting for MMSC to initiate transfer...
.sp .8v
.fi
.PP
The third form of the \f2flashmmsc\f1 command is used for disaster
recovery if an MMSC has no firmware loaded at all
(this may happen if a previous \f2flashmmsc\f1 command was interrupted
by a power failure or unexpected reset).
In this case, it is necessary to attach a null-modem cable from a
serial port on the machine that will be issuing the \f2flashmmsc\f1
command to the "ALTERNATE CONSOLE" port of the MMSC itself.
The \f2flashmmsc\f1 command is then issued with the \f3-d\f1 switch,
to indicate a direct download, and the \f3-l\f1 switch, to specify
the serial port that is being used.
.sp .8v
.fi
.PP
The final form of the \f2flashmmsc\f1 command is used to check what 
version of the firmware is actually contained in the binary file.  It
has no other effect besides reporting the firmware's version number.
.SH OPTIONS
.PP
The following switches can be used to alter \f2flashmmsc\f1's behavior:
.TP 10
\f3-a\f1
Indicates that an automatically initiated image transfer is to be
performed.
This is the default behavior.
.TP 10
\f3-d\f1
Indicates that the image is to be transferred directly to the MMSC's
ALTERNATE CONSOLE port over the serial port specified by the \f3-l\f1
option.
.TP
\f3-f\f1
Specifies the file name of the firmware image to be programmed into
the MMSC.
The default is \f4/usr/cpu/firmware/mmscfw.bin\f1.
.TP
\f3-l\f1
Specifies the file name of the serial device to be used for a direct
(\f3-d\f1) image transfer.
The default is \f4/dev/ttyd2\f1.
The serial device must be set up for a 19200 baud transfer rate.
.TP
\f3-m\f1
Indicates that a manually initiated image transfer (that is, one in which
the MMSC is manually told to accept a new firmware image) is to be performed.
.TP
\f3-p\f1
Probes connectivity to the MMSC via the the default console serial device.
Reports the versions of the MMSC and MSCs attached to the MMSC. When this
option is used no MMSC flashing occurs.
.TP
\f3-r\f1
Specifies the rack ID of the MMSC whose firmware is to be loaded.
If not specified, then the MMSC directly attached to the system console
will be selected.
This option is ignored with the \f3-m\f1 and \f-d\f1 options.
.TP
\f3-V\f1
Indicates that version number of the firmware contained in the image file 
should be reported.  When this option is used no MMSC flashing occurs.
.SH FILES
.TP 32
/usr/cpu/firmware/mmscfw.bin
contains the binary image of the firmware currently installed
.SH WARNINGS
The \f2flashmmsc\f1 command is not intended for casual use.
If used incorrectly, it can render a system unbootable.
Silicon Graphics strongly recommends that
this command only be used under the supervision of a support representative.
.PP
The \f2flashmmsc\f1 command can take as long as 20 minutes to complete,
depending on the speed of the connection between the system and the MMSC.
\f3It is important to avoid resetting the system until the \f2flashmmsc\fP
command has completed.\f1
If the system loses power before a \f2flashmmsc\f1 command completes,
the MMSC itself may be rendered unusable.
In this case it will be necessary to perform the disaster recovery
download (\f3-d\f1 option) mentioned above.
