calmsacibis995/irix-6517-src/irix/man/man1m/fru.1m
'\"macro stdmacro
.if n .pH g1.lp @(#)lp	30.2 of 12/25/85
.nr X
.if \nX=0 .ds x} FRU 1M "IRIX System Utilities" "\&"
.if \nX=1 .ds x} FRU 1M "IRIX System Utilities"
.if \nX=2 .ds x} FRU 1M "" "\&"
.if \nX=3 .ds x} FRU "" "" "\&"
.TH \*(x}
.SH NAME
fru \- Field replacement unit analyzer for Challenge/Onyx systems
.SH SYNOPSIS
.B fru
.RB [\-a]
namelist corefile
.br
.SH DESCRIPTION
.I fru
is a hardware state analyzer that provides board replacement
information based on system crash dumps.  The output provided by
.I fru
displays what system boards, if any, are the most likely suspects that
might have induced a hardware failure.
.P
.I fru
can be run on any \f2namelist\f1 and \f2corefile\f1 specified on the
command line.
\f2namelist\f1 contains symbol table information needed for symbolic
access to the system memory image being examined.  This will typically
be the \f2unix.N\f1 kernel copied into /var/adm/crash, where \f2N\f1
is the number of the crash dump you are analyzing.
\f2corefile\f1 is a file containing the system memory image.  This will
typically be the \f2vmcore.N.comp\f1 file copied into /var/adm/crash
by
.IR savecore (1)
when the machine reboots after a system panic.
If the memory image being analyzed is from a system core dump
(\f2vmcore.N.comp\f1), then \f2namelist\f1 must be a copy of the unix file
that was executing at the time (\f2unix.N\f1).
.P
Note that
.I fru
cannot be run against live systems, as there is no system board replacement
information available while the system is running properly. 
.P
The
.I fru
command has the following options listed below.
By default, all information will be sent to the standard output:
.TP 11
-a
Print the entirety of the error dump buffer, which might not
be complete in the kernel console buffer of the core dump.
.SH NOTES
If
.I fru
finds a hardware error state, it will try and report a confidence
level on each system board (and in some cases, the components on a board).
When
.I fru
reports a confidence level, it means that it has some measure of
confidence that the board reported has a problem.  Typically each board in
the system will be assigned a 10% confidence level if it reports anything
into a hardware error state.  Note that there are only a few levels of
confidence, and it is important to recognize what the percentages mean:
.P
    10%      The board was witnessed in the hardware error state only.
    30%      The board has a possible error, with a low likelihood.
    40%      The board has a possible error, with a medium likelihood.
    70%      The board has a *probable* error, with a high likelihood.
    90%      The board is a *definite* problem.
.P
Given that there is the possibility of multiple boards being
reported, care should be taken before when replacing a board on the
system. For example, if two boards are reported at 10%, that is not enough
confidence that the boards listed are bad. If there is one board at 70% or
better, however, there is a good likelihood that the board listed is a
problem, and should be replaced. Boards at 30% to 40% are questionable,
and should be reviewed based on the frequency of the failure of the
specific board (in the same slot) between system crashes.
.P
The objective is to catch real hardware problems, rather than just
replacing boards on systems where there isn't a problem.
.P
Here is some sample output from a
.I fru
analysis on a system crash dump:
.P
    # fru -a /var/adm/crash/unix.0 /var/adm/crash/vmcore.0.comp
    ---------------------------------------------------------------
        FRU ANALYZER (2.2):
        ++ MEMORY BANK: leaf 1 bank 0 (B)
        ++   on the MC3 board in slot 3: 90% confidence.
        ++ END OF ANALYSIS
    ---------------------------------------------------------------
    
    HARDWARE ERROR STATE:
    +  IP19 in slot 2 
    +    CC in IP19 Slot 2, cpu 3
    +      CC ERTOIP  Register: 0x10 
    +        4: Parity Error on Data from D-chip
    +  MC3 in slot 3 
    +      MA EBus Error register: 0x4
    +        2: My EBus Data Error
    +      MA Leaf 1 Error Status Register: 0x2
    +        1: Read Uncorrectable (Multiple Bit) Error
    +      MA Leaf 1 Bad Memory Address: 0x3fb27380
    +        Slot 3, leaf 1, bank 0 (B)
    +  IO4 board in slot 15 
    +      IA EBUS Error Register: 0x201
    +         0: Sticky Error
    +         9: DATA_ERROR Received
.P
In this example, it would be a good idea to have the memory in leaf 1,
bank 0 (B) changed, and have the MC3 examined (unless the memory and board
in that slot has been replaced before, in which case further analysis of
the hardware on the machine should be completed.)
.P
Please also note that it is possible the system problem being reported
might be something unknown to the version of
.I fru
you are currently running with.  There might also be some bugs within
.I fru
that SGI is unaware of that will keep field replacement unit analysis
from being completed.
