calmsacibis995/irix-6517-src/irix/man/man1m/IP30prom.1m
.TH IP30prom 1M
.SH NAME
IP30prom, IP30prom.bin \- OCTANE prom's for flash memory
.SH DESCRIPTION
OCTANE has a system flash memory which is non-volatile.
It is in "read-only" mode most of the time
functioning very much like a "prom". This memory
however can be erased and written over by software,
allowing the boot program, commonly known as the PROM,
to be easily upgraded during software installation.
.SS "PDS"
In addition to the boot programs a section of the flash
memory is reserved to extend the nvram capacity.
This section of the flash memory is called the
Permanent Data Storage.
This has increased the available system nvram storage
capacity for OCTANE from previous desktop systems,
allowing additional data types to be
stored in the nvram.
.SS "IP30prom.bin"
This is a special file which contains the binary image of
boot programs RPROM and FPROM. The text, data and a special
header for each program make up the contents.
This file is found in the volume header of the system disk and
the OCTANE CD, and the /usr/cpu/firmware/ directory.
In IRIX,
.IR flash (1M)
command is used
to program the new prom images to the flash memory.
This file is upgraded during
.IR inst (1M)
if a newer version is found in the software distribution.
.SS "FPROM"
This is the standard boot program, Full PROM, also
known as the PROM. On power up the
CPU does not start with the FPROM. Program execution
is "jumped" to FPROM from the RPROM.
.SS "RPROM"
This is the special boot program, Recovery PROM, which
the CPU starts executing from power up. Its main task
is to ensure that the FPROM in the flash memory is valid
before transferring control to it. Otherwise
it performs recovery of the invalid FPROM.
Invalid FPROM results from
incomplete programming, such as power failure during
flash programming. Users should be warned that power
failure during programming of the flash memory 
may damage the part. But this is a very rare case not encountered
in normal usage.
.P
While it is common for FPROM to be regularly upgraded, it is
be extremely rare for RPROM to be upgraded.
.SS "FPROM Recovery by RPROM"
RPROM looks for the IP30prom.bin file in the volume header of disks
connected to the built-in SCSI controllers 0 and 1, including the CD-ROM drive. 
Once a IP30prom.bin file is found the FPROM is programmed.
There is a small chance that the flash memory may have been permanently 
damaged, in which case the recovery is not possible and the
flash memory has to be replaced at the factory.
.P
During the recovery, graphics display is disabled. The recovery
process can be monitored by connecting a serial terminal device to
the console port, or with the front light bar. When the RPROM detects
an incorrectly programmed FPROM, the white light remains on
until all the disks are spun up, this may take from 30 seconds to
several minutes depending on the number of connected disks.
Once the RPROM has located the IP30prom.bin and the recovery
starts, there is a series of 12 to 14 red light pulses.
After which a series of 12 to 14 white light pulses follow.
Each of the light pulses is about half a second long.
If the recovery is successful the system
resets itself and reboots. Otherwise 2 second pulses
of red light indicate failure to recover. 
.SS "OCTANE PROM monitor commands"
In addition to the standard commands in
.IR prom (1M),
these additional commands are available on the OCTANE PROM.
.TP 10
\f3system\f1 [\f3\-d\f1]
Print the various chip revisions and board manufacturing information.
\f3\-d\f1 option prints the manufacturing
information in raw format.
.TP
\f3flash log\f1 [\f3inval\f1][\f2entry_offset\f1]
Display the PDS log entries.
\f3inval\f1 invalidates the log entries after they are
displayed.
\f2entry_offset\f1 is the offset from base of
PDS segment of the entry which the display
starts at. Default is to start from the first valid entry.
.TP
\f3flash resetpds\f1
Re-initialize the PDS. All PDS entries are discarded.
The PDS segment is erased and re-initialized.
.IP
The \f2resetenv\f1
.IR prom (1M)
command only invalidates the environment
variable PDS entries.
.TP
\f3flash info\f1
Display information regarding the OCTANE flash memory.
The headers of RPROM, FPROM and PDS sections are verified
along with the checksums for the RPROM and FPROM images.
.TP
\f3flash prom\f1 [\f3\-r\f1|\f3\-R\f1] \f2pathname\f3/IP30prom.bin\f1
Program the prom image in \f2pathname/IP30prom.bin\f1 to prom.
\f3\-r\f1 option is to flash the RPROM only with IP30prom.bin file
\f3\-R\f1 option is to flash BOTH RPROM and FPROM with IP30prom.bin file
Default mode is to flash FPROM only with IP30prom.bin.
.IP
More details about the \f2pathname\f1 may be found in the
.IR prom (1M)
command.
.PD
.SH WARNINGS
The \f2flash prom\f1 command is not intended for casual use.
If used
incorrectly, it can completely freeze a system and prevent it from even
booting the PROM.
Also, frequent flashing decreases the lifetime of the
system's flash memory.
Silicon Graphics strongly recommends that this command
only be used under the supervision of a support representative.
.SH SEE ALSO
flash(1M),
nvram(1M),
prom(1M),
