calmsacibis995/irix-6517-src/irix/man/man1m/makedev.1m
.TH MAKEDEV 1M
.SH NAME
.nolinks
MAKEDEV \- create device special files
.SH SYNOPSIS
.nf
\f3/dev/MAKEDEV\f1 [\f2target\f1] [\f2parameter\f1=\f2val\f1]
.fi
.SH DESCRIPTION
.I MAKEDEV
creates specified device files in the current directory;
it is primarily used for constructing the \f2/dev\f1 directory.
It is a "makefile" processed by the \f2make\fP(1) command.
Its arguments can be either targets in the file or assignments overriding
parameters defined in the file.
The \f2target\f1s
.B alldevs
and
.B owners
are assumed if no other targets are present (see below).
.PP
All devices are created relative to the current directory, so this
command is normally executed from \f2/dev\f1.
In order to create the devices successfully, you must be
the superuser.
.PP
The following are some of the \f2target\f1 arguments that are recognized by
.IR MAKEDEV .
For a complete list you may need to examine the script.
.TP 11
.B ttys
Creates
.I tty
(controlling terminal interface) files for CPU serial ports.
In addition, creates special files for
.IR console ,
.IR syscon ,
.IR systty ,
.IR keybd ,
.IR mouse ,
.IR dials ,
and
.IR tablet .
See
.IR duart (7),
.IR console (7),
.IR keyboard (7),
.IR mouse (7),
.IR pckeyboard (7),
and
.IR pcmouse (7)
for details.
.TP 11
.B cdsio
Creates additional
.I tty
files enabled by using the Central Data serial board.
.TP 11
.B pty
Creates special files to support "pseudo terminals."
This target makes a small number of files, with more created as needed
by programs using them.
Additional \f2pty\f1 files can be made
for older programs not using library functions to allocate \f2pty\f1s
by using the \f2parameter\f1 override \f2MAXPTY=100\fP, or any other number
between 1 and 199.
See
.IR pty (7M)
for details.
.TP 11
.B dks
Creates special files for SCSI disks.
See
.IR dks (7M)
for details.
.TP 11
.B rad
Creates special files for SCSI attached RAID disks.
See
.IR raid (1M)
and
.IR usraid (7M)
for details.
.TP 11
.B fds
Creates special files for SCSI floppy drives.
See
.IR smfd (7M)
for details.
.TP 11
.B usrvme
Creates special files for user level VME bus adapter interfaces.
See
.IR usrvme (7M)
for details.
.TP 11
.B usrdma
Creates special files for user level access to DMA engines.
See
.IR usrdma (7M)
for details.
.TP 11
.B tps
Creates special files for SCSI tape drives.
See
.IR tps (7M)
for details.
.TP 11
.B hl
Creates special files for the hardware spinlock driver to use in process
synchronization (IRIS-4D/GTX models only).
.TP 11
.B t3270
Creates the special files for the IBM 3270 interface controller.
.TP 11
.B gse
Creates the special files for the IBM 5080 interface controller.
.TP 11
.B dn_ll
Creates the special file for the 4DDN logical link driver.
.TP 11
.B dn_netman
Creates the special file for the 4DDN network management driver.
.TP 11
.B audio
Creates the special file for the bi-directional audio channel interface
for the IRIS-4D/20 series.
See
.IR audio (1)
for details.
.TP 11
.B plp
Creates the special file for the parallel printer interface for the
IRIS-4D/20 series.
See
.IR plp (7)
for details.
.TP 11
.B ei
Creates the special file for the Challenge/Onyx external interrupt interface.
See
.IR ei (7)
for details.
.TP 11
.B generic
Creates miscellaneous, commonly used devices:
.IR tty ,
the controlling terminal device;
.IR mem ,
.IR kmem ,
.IR mmem ,
and
.IR null ,
the memory devices;
.IR prf ,
the kernel profiling interface;
.IR tport ,
the texport interface;
.IR shmiq ,
the event queue interface;
.IR gfx ,
.IR graphics ,
the graphics device interfaces;
and
.IR zero ,
a source of zeroed unnamed memory.
See
.IR tty (7),
.IR mem (7),
.IR prf (7),
and
.IR zero (7)
for details concerning
some of these respective devices.
.TP 11
.B links
This option does both
.I disk
and
.I tape
.TP 11
.B disk
This option creates all the disk device special files for the
.I dks
drives,
and then creates links by which you can conveniently reference them
without knowing the configuration of the particular machine.
The links
.IR root ,
.IR rroot ,
.IR swap ,
.IR rswap ,
.IR usr ,
.IR rusr ,
.IR vh ,
and
.I rvh
are created to reference the current root, swap, usr and volume header
partitions.
.TP 11
.B tape
This option creates all the
.I tps
tape devices, then makes links
to
.IR tape ,
.IR nrtape ,
.IR tapens ,
and
.I nrtapens
for the first tape drive found, if one exists.
It checks for SCSI in descending target ID order, and ascending
SCSI bus number.
.TP 11
.B mindevs
This option is shorthand for creating the
.IR generic ,
.IR links ,
.IR pty ,
.IR ttys ,
device files.
.TP 11
.B alldevs
This option creates all of the device special files listed above.
.TP 11
.B owners
This option changes the owner and group of the files in the current directory
to the desired default state.
.TP 11
.B onlylinks
This option does only the link portion of
.I disk
and
.I tape
above, in case a different disk is used as root, or a different tape drive
is used.
.SH "ADDING LOCAL DEVICES"
For some types of devices (currently disk, tape, and generic scsi), shell
scripts in \f2/dev/MAKEDEV.d\fP are run to create devices.  These scripts
are of the form \f3DKS_\f2anything\f1, where \f2anything\fP can be anything
other than \f2base\fP, as that is the name of the scripts shipped with the
system.  This allows site specific customization, without risk of losing the
customization when the operating system is upgraded or re-installed.  See the
existing scripts in that directory for examples.  The scripts are run in 
lexical order.  The other two currently supported prefixes are \f3TPS_\fP,
and \f3SCSI_\fP.
.SH BUGS
The links made for \f2/dev/usr\f1 and \f2/dev/rusr\f1
always point to partition 6 of the
root drive.
While this is the most common convention, it is not invariable.
.PP
If a system has been reconfigured with the \f2/usr\f1 filesystem in some place
other than this default, by specifying the device in \f2/etc/fstab\f1 (see
.IR fstab (4)),
the \f2/dev/usr\f1 and \f2/dev/rusr\f1 devices will NOT point to the
device holding the real \f2/usr\f1 filesystem.
.SH "SEE ALSO"
install(1),
make(1),
mknod(1M),
ioconfig(1M).
