calmsacibis995/irix-6517-src/irix/man/man1m/mkpart.1m
.TH mkpart 1M
.SH NAME
mkpart \- Partition Configuration Tool for Origin
.SH SYNOPSIS
.nf
\f3mkpart\f1 [ \f3\-f <cfgfile>\f1 ] \c
.nf
\f3mkpart\f1 [ \f3\-F\f1 ] [ \f3\-p <partid>\f1 ] [ \f3\-m <modid> ...\f1 ]
              [ \f3\-p <partid>\f1 ] [ \f3\-m <modid> ...\f1 ] \c
.nf
\f3mkpart\f1 [ \f3\-F\f1 ] [ \f3\-l\f1 ] [ \f3\-init\f1 ]
.nf
\f3mkpart\f1 [ \f3\-a\f1 ] [ \f3\-d <partid>\f1 ]
.PP
.fi
.SH DESCRIPTION
\f3mkpart\f1 is the partition administration tool for Origin Systems. 
It provides the System Administrator with capabilities to list current 
partitions, re-configure the system into multiple partitions, re-initialize 
all partition ids, and to re-activate or de-activate partitions.
.PP
You must have superuser privilege to use this command. If the system is
configured as CAP_NO_SUPERUSER, you must have effective capabilities of
CAP_SHUTDOWN, CAP_DEVICE_MGT and CAP_SYSINFO_MGT. 
.PP
All the affected partitions have to be rebooted in order to change the
system to the new partition scheme. 
.PP
A multi module Origin System can be divided into multiple independent units
for the purposes of booting different kernels on them. These systems can
be power cycled independently eventhough they are connected by the craylink
interconnect. The kernels can detect the presence of other partitions by
using low level hardware support. A partition is identified by its 
partition id, \f3partid\f1 and a module is identified by its module id, 
\f3modid\f1. A partition consists of a set of modules that satisfy 
the following conditions:
.PP
The route between any 2 nodes within a partition must be fully within
that partition and not route through any other partition.
.PP
There is a direct route between any 2 partitions and does not route 
through any other partition.
.PP
The partition should encompass the entire machine or is a power of 2
modules.
.PP
For example, in a 4 module system, with each rack having consequtive
module ids,
.PP
Partition 1 = Module 1 and Module 2
.PP
Partition 2 = Module 3 and Module 4
.PP
Modules 1 and 3 cannot be in the same partition due to the first
restriction. This system cannot be divided into 4 partitions of
1 module each without \f3Xpress links\f1.
.PP
After \f3mkpart\f1 has successfully set up the system for the
new partition config, it asks the user for permission to shutdown
all the affected partitions. The command automatically shuts down
all the affected partitions if permission is given by the user.
If not, the new partition setup is effective after the next reboot.
After reboot, the system comes back to the system maintenence menu
with the new partition config.
.PP
The mkpart command options are:
.TP 13
.B \-l
List all the active partition configurations to standard out. 
The format of the command output looks like the contents of the
\f3cfg_file\f1 associated with the \f3-f\f1 option. The active
partitions are those that have XPC configured and running on them.
.TP 13
.B \-f \f2cfg_file\f1
The new config info is taken from the file \f3cfg_file\f1. This file consists
of a set of lines with each line representing a partition. The format of 
this line is:
.TP 13
\f3partition: <partid> = module: <modid> [<modid> ...]\f1
.T 13
The \f3\-f\f1 option should not be used if partition id and module id is
specified on the command line.
.TP 13
.B \-p \f2partid\f1
Specifies the partition id for the new configuration. This is complementary
to the \f3\-f\f1 option. The \f3\-p\f1 option should not be used 
if the \f3-f\f1 option is chosen.
.TP 13
.B \-m \f2modid ...\f1
Specifies the module ids that make up the partition. The \f3\-m\f1
option should be specified after a \f3-p\f1 option. All the module ids 
should be separated by spaces.
.TP 13
.B \-d
De-activate partition \f3<partid>\f1. The kernel deletes all internal 
information about this partition. This option does not need a re-boot 
of the system.
.TP 13
.B \-a
Re-discover all partitions. Detect new partitions that have been
powered on or previously de-activated partitions. This option does not
need a re-boot of the system.
.TP 13
.B \-init
Set the partition id of all modules to \f30\f1. On the next reboot the 
system will be coalsced to include all modules.
.TP 13
.B \-help
prints a usage message.
.TP 13
.B \-F
Forces override of all sanity checks. The command sets up partitioning
as given and tries to reboot the system. This option should be used with
caution. The user of the command should know about the consequences of
wrong usage of this option.
.PP
.SH EXAMPLES
To partition a 4 module system into 2 partitions of 2 modules each:
.TP 13
\f3mkpart -p 1 -m 1 2 -p 2 -m 3 4\f1
.PP
or edit a file, \f3part.cfg\f1 with the following lines:
.P
partition: 1 module: 1 2 
.P
partition: 2 module: 3 4 
.P
and run
.TP 13
\f3mkpart -f part.cfg\f1
.SH FILES
.PD 0
.TP 35
/etc/config/mkpart.config
stores info about permitted configs in a format that \f3mkpart\f1 
can understand. This file is cannot be edited by the user.
.PD
.SH NOTES
The \f3mkpart\f1 command needs the \f3partition\f1, \f3xpc\f1 
and \f3cl\f1 modules to be configured into the OS.
.P
The \f3partition id\f1 of \f30\f1 has a special meaning
in the OS. The system administrator should avoid the use 
of \f3partition id 0\f1 when partitioning the
system. The \f3partition id\f1 can be any number between \f31\f1
and \f363\f1, both included.
.PD
.SH DIAGNOSTICS
The \f3mkpart\f1 command does not respond to the interrupt key.
This is because the partitioning information may be in a 
inconsistent state which may cause problems on a reboot.
.PP
The \f3mkpart\f1 command performs certain sanity checks on the
partition config required by the user. It uses the partitioning
information currently available to do this. Under certain conditions, 
these checks cannot proceed without input from the user.
These are in addition to the three checks mentioned previously.
.PP
All the modules must be included in any command line. If a set
of modules are left out because they will not be affected, the
\f3mkpart\f1 command automatically includes them and asks the user if
it is OK.
.PP
The partition id should be in the range 0 to 63.
.PP
Partition ids must be unique and a module can be included in
1 partition only.
.PP
Systems with meta routers need a different set of checks compared
to the normal systems. The \f3mkpart\f1 command warns the user of this.
.PP
Partitioning needs the ASIC HUB to be of REV 5 or more. If all HUBs
are not at the required level, the user is warned of this.
.PP
The \f3mkpd\f1 daemon must be running on all partitions for \f3mkpart\f1
to work. If this is not the case, the \f3mkpart\f1 command may terminate
with a message to the user to check the router connectivity manually.
The user should manually check if all the required conditions for 
partitioning is satisfied and use the \f3-F\f1 option to force partitioning.
The command appears to take a while for executing. This is because
it needs to communicate with every daemon in the system many times.
The \f3mkpd\f1 daemon records some of its messages in the SYSLOG file.
.PP
The \f3mkpbe\f1 is a backend utility used by \f3mkpart\f1. It should
not be used by the user from the command line.
.PP
The \f3mkpart\f1 command uses the \f3rexec\f1 facilities of the
systems to set up partitions. The system should have atleast 1 network
interface configured between the partitions. If there is no external
network available, \f3if_cl\f3, the craylink TCP driver, should be
configured.
.PP
The list of partition configs supported by IRIX array software is
stored in an encoded form in \f3/etc/config/mkpart.config\f1. If
the required config does not look like a supported config a warning
message is printed. 
.PD
.SH "SEE ALSO"
clshmctl(1),
clshmd(1).
.PD
.SH WARNINGS
The \f3mkpart\f1 command is not intended for casual use.
If used incorrectly, it can completely freeze all partitions 
in the system and prevent it from even booting the PROM.
Silicon Graphics strongly recommends that this command
be used with the co-ordination of the System Administrators
of all the current partitions.
