calmsacibis995/irix-6517-src/irix/man/man1m/mmscd.1m
.nr X
.if \nX=0 .ds x} mmscd 1M ""  "\&"
.TH \*(x}
.SH NAME
mmscd \- communicates with MMSC (including front panel display) on Origin2000 and Onyx2 rack systems
.SH SYNOPSIS
.nf
\f3/usr/etc/mmscd \f1 \c
[ \f3\-f sdev\f1 ] [ \f3\-c cdev\f1 ]
                [ \f3\-b baud\f1 ] \c
[ \f3\-u freq\f1 ]
                [ \f3\-t "title"\f1 ] \c
[ \f3\-N cpus\f1 ] \c
[ \f3\-D fctr\f1 ]
                [ \f3\-gdlmnGM\f1 ] \f3
.fi
.SH DESCRIPTION
.I mmscd
is a daemon run by
.IR /etc/rc2.d/S33sn0start .
It handles all necessary communications with an Origin2000 system's
Multi-Module System Controller (MMSC).
An MMSC is usually connected
to systems composed of more than one module (one or more racks).
.PP
The MMSC controls power sequencing and fan speed, monitors system sensors,
and drives the LCD front panel.
.I mmscd
works with the MMSC to run the CPU activity meter on the front panel,
perform controlled normal or emergency system shutdowns,
and handle warning and alarm messages from the system controller.
.PP
Only one
.I mmscd
can run as a daemon at a time, and it must be run as root.  After
.I mmscd
is started, it probes the console device to determine if an MMSC is
present, and if not, it exits.
.PP
The options are:
.TP
.B \-f sdev
Specifies the name of a non-console serial device to which the
MMSC is attached, in the case where it is not connected directly
to the console port
.I /dev/ttyd1.
This can be used to test the graph display without multiplexing
MMSC control through the console.
.TP
.B \-c cdev
Specifies the name of a console serial device to which the MMSC
is attached.  This defaults to /dev/console on non-graphics
systems, but must be /dev/ttyd1 on graphics systems.
.TP
.B \-b baud
Specifies a baud rate to use other than the default, whether the MMSC
is attached to the console or to a different serial device.
.TP
.B \-g
Graceful powerdown mode causes
.I mmscd
to handle shutdowns by
sending a hang-up signal to all processes, waiting two seconds,
sending a kill
signal to all processes, syncing all disks,
and then powering the system down.
.TP
.B \-d
Debug mode
.I mmscd
displays debugging information relating to transactions with the MMSC.
.TP
.B \-l
Display per node averages of cpu utilization. Each bar represents the
average of the cpu activity for all cpus on that node.
This option is provided for use with 256 processor systems and is
the default on those systems.
.TP
.B \-m
CPU meter mode causes performance information
to be displayed on a bar graph on
the MMSC LCD panel.  When the default console device is used for MMSC
communications, this data may have an impact on console performance,
depending on the amount of data and meter update rate.
.TP
.B \-M
The display will show memory utilization information for each node. Each
bar will display the amount of free, in use, and kernel memory for each node.
.TP
.B \-u freq
Sets CPU meter update frequency in Hz.  The default is chosen so as to
use at most 25% of available console bandwidth.
.TP
.B \-D fctr
Sets CPU meter bar decay (smoothing) factor as a multiplier per second.
The default is 0.25.
.TP
.B \-t "title"
Sets the title string at the top of the CPU meter display.  The default
is "Origin2000 System Activity."
.TP
.B \-N cpus
Causes
.I mmscd
to pretend there are a different number of CPUs than there actually
are when drawing the CPU meter.  This is used to test the CPU meter.
.TP
.B \-n
Prevents
.I mmscd
from forking into the background when it starts, which is useful for
debugging.
.TP
.B \-G
Include graphics information in CPU meter.
Causes systems which have graphics support to include an additional
bar graph color to indicate the amount of time the CPUs are spending
waiting on graphics.
.SH CABLING
The multi-module rack system must be cabled according to the
instructions in the user guide.  If the cabling is incorrect,
.I mmscd
exits within 3 seconds of being started because the MMSC
cannot be contacted.
.PP
Briefly, the ttyd1 serial port is connected to the
MMSC BaseIO port (COM 4) using a DB-9 to DIN-8 cable.
The ttyd1 port
is the right-most BaseIO serial port on the master module.
The master module is the one whose four-character LED display has
a "c" next to the module number.
.PP
The system console is accessed by connecting a terminal to the
Console port (COM 1) on the MMSC.  If connected properly,
the MMSC will respond with the prompt "MMSC>" when
Control-T is typed on the terminal.
.PP
On systems with MMSC firmware earlier than version 1.1,
it may be necessary to enable the MMSC to talk.
On the MMSC console, type Control-T to get the MMSC prompt,
and enter
.I com 4
to list port settings.  Check the output
for
.I oob y.
If you see
.I oob n,
then type Control-T and enter
.I com 4 oob y.
.PP
To try starting
.I mmscd
again, run
.I /etc/init.d/sn0start start.
.SH DIAGNOSTICS
.I mmscd
writes messages into
.I /var/adm/syslog
to indicate abnormal conditions, such as when the connection to
the MMSC is lost, or
.I mmscd
is killed.
.PP
If
.I mmscd
exits within 3 seconds of being started, there is a problem
with the communications path (refer to CABLING above).
.SH "SEE ALSO"
syslog(3C).
