calmsacibis995/irix-6517-src/irix/man/man1m/onlinediag.1m
.TH onlinediag 1M
.SH NAME
onlinediag \- run diagnostic tests on cpus to test floating point units.
.SH SYNOPSIS
.nf
\f3onlinediag\f1 [\f3\-p\f1 procnum] [\f3-c\f1 config] [\f3-l\f1 logfile] [\f3-rdkf\f1]
	[\f3-P\f1 priority]
.fi
.SH DESCRIPTION
.I onlinediag
runs diagnostic tests on cpus to test floating point units.  It reads
the full path names of binaries out of a config file (default of
/etc/config/onlinediag.config) and reports failures of these tests in the
/var/adm/SYSLOG.  The output of the test binaries are saved in the log
file (default of /var/adm/onlinediag.logfile) if there are any failures or
the tests fail to run for some reason.
.PP
The
.BI \-p " procnum"
parameter indicates what processor the test will run on.  If no value is
specified, the program will run the test binaries on each processor in
turn.
.P
The 
.BI \-c " config"
parameter indicates the config file that lists the binaries to run.  The
config file must have the full path name of the test binaries.  All
characters after a '#' in a line are ignored.  The parsing is very
simple and cannot deal with quotes.  The maximum number of test binaries
allowed is 64.  The default config file is /etc/config/onlinediag.config.
.P
The 
.BI \-l " logfile"
parameter indicates the logfile name that the output of binaries should
be placed.  The default logfile is /var/adm/onlinediag.logfile.
.P
The 
.BI \-r 
parameter indicates that onlinediag should restrict any cpu that fails the
test binaries.  Normally onlinediag simply logs the failure in
/var/adm/SYSLOG and does not restrict the cpu.
.P
The 
.BI \-d 
parameter indicates that onlinediag should disable on the next reboot any
cpu that fails the test binaries.  Normally onlinediag simply logs the
failure in /var/adm/SYSLOG and does not disable the cpu.
.P
The 
.BI \-k 
parameter indicates that onlinediag should keep the logfile regardless of
failures of the test binaries.  Normally onlinediag throws out the logfile
if nothing goes wrong.
.P
The
.BI \-f
parameter indicates that onlinediag should run on all enabled cpus,
including those that are restricted or isolated.  Normally onlinediag does
not run on restricted or isolated cpus.
.P
The
.BI \-P " proirity"
parameter indicates the priority onlinediag will be run at.  The value
can be in the range -20 to 20 with -20 being the highest priority and 20
being the lowest.  The priority defaults to 10.


.SH OVERVIEW
.I onlinediag
runs test binaries on different processors.  The test binaries
specifically test the floating point unit.  The kernel uses only the
integer unit and therefore, a malfunctioning floating point unit can go
undetected, perhaps giving incorrect results, for long periods of time.
onlinediag provides a means of detecting a malfunctioning floating point
unit in a timely fashion so it can be replaced.

.I onlinediag
runs as a cron job of the diag user at very low priority by default.
The crontab of the diag user should be changed using the
.I diagsetup 
script.  Use this script to turn off onlinediag as well as to control when
it is run.  This script also controls the turning on and off of
.I cached. 
cached also runs as a cron job of the diag user.


.SH FILES
.PD 0
.TP 27
/usr/diags
the diag user's home directory
.TP
/usr/diags/bin/onlinediag
location of onlinediag executable
.TP
/etc/config/onlinediag.config
default config file
.TP
/var/adm/onlinediag.logfile
default logfile
.TP
/usr/diags/bin/diagsetup
script to control the periodic running of onlinediag and cached
.PD


.SH NOTES
To avoid disruptions to real-time usage, onlinediag normally does not run on
isolated or restricted cpus. This can be overriden by using the -f flag.


.SH SEE ALSO
cached(1M), diagsetup(1M)
