calmsacibis995/irix-6517-src/irix/man/man1m/prom.1m
.TH prom 1M ""
.SH NAME
prom \- \&PROM monitor
.SH DESCRIPTION
The PROM monitor is a program that resides in permanently programmed
read-only memory, which controls the startup of the system.
The PROM
is started whenever the system is first powered on, reset with the
reset button, or shutdown by the administrator.
.P
The PROM contains
features that vary from system to system.
Description of various
commands, options, and interfaces below may not apply to the PROM
in your system and may vary between systems.
Furthermore, because PROMs are not normally changed after the manufacture
of the system, newly added features are not present in older systems.
.P
Systems such as the Indigo R4000, Indigo\u2\d, Indy, O2, Onyx, and
CHALLENGE contain an ARCS PROM.
Machines that contain an MIPS R8000 or R10000 such as the POWER CHALLENGE,
POWER Onyx, POWER Indigo\u2\d, Indigo\u2\d 10000, and OCTANE use a 64-bit
version of the ARCS PROM.
The ARCS PROM offers the same functionality as previous PROMs, but
in some cases with a different interface.
Refer to the ARCS PROM section below for details.
.P
When the system is first powered on, the PROM runs a series of tests
on the core components of the system.
It then performs certain hardware
initialization functions such as starting up SCSI hard disks, initializing
graphics hardware and clearing memory.
Upon successful completion of
these tasks, the PROM indirectly starts the operating system by invoking
a bootstrap loader program called \f2sash\f1, which in turn reads the IRIX
kernel from disk and transfers control to it.
.SS "Menu Commands"
By default, the PROM attempts to boot the operating system kernel when
the system is powered on or reset.
Before doing so, however, the opportunity
to press the <Escape> key is given.
If the <Escape> key is pressed within
approximately ten seconds, the PROM displays a menu of alternate boot
up options.
These other choices allow various types of system maintenance
to be performed:
.TP
\f31.\ Start System\fP
This option causes the system to boot in the default way.
It is the
same as if the system had been allowed to boot on its
own.
.TP
\f32.\ Install System Software\fP
This option is used when system software needs to be installed or upgraded.
The PROM first attempts to find a tape drive on the system and if one
is found, it prompts the user to insert the installation tape in it.
If a tape device
is not found, then installation is expected to take place by Ethernet.
In this case, the PROM prompts the user for the name of the system
that will be used as the server.
.IP
Systems with an ARCS PROM uses a menu to select the
installation device.
See ARCS PROM section below for details.
.TP
\f33.\ Run Diagnostics\fP
This option invokes the extended hardware diagnostic program, which
performs a thorough test of the CPU board and any graphics boards present.
It reports a summary.
.TP
\f34.\ Recover System\fP
This option can be used to perform special system administration tasks
such as restoring a system disk from backup tapes.
It follows a
sequence similar to installing system software, but instead of starting
the installation program, it invokes an interactive restoration tool.
.TP
\f35.\ Enter Command Monitor\fP
Additional functions can be performed from an interactive command monitor.
This option puts the PROM into a manual mode of operation.
.TP
\f36.\ Select Keyboard Layout\fP
Some systems display a sixth option when the console is on the graphics
display which allows the keyboard map to be interactively selected for SGI
supported international keyboards.
.SS "Manual Mode"
The PROM command monitor allows the user to customize certain features of the
boot process for one-time only needs or longer term changes.
The command
monitor has some features that are similar to an IRIX shell such as command
line options and environment variables.
Some of the environment variables
used in the PROM are stored in nonvolatile RAM, which means that their
values are preserved even after the power to the system is turned off.
.P
The command monitor has a different method of specifying disks and files
than is used under IRIX.
A pathname is formed by prefixing the filename
with a device name as shown:
.Ex
\f2devicename\f1(\f2controller\f1,\f2unit\f1,\f2partition\f1)\f2filename\f1
.Ee
Valid device names include:
.Ex
\f3tpsc\fP		SCSI tape drive
\f3dksc\fP		SCSI disk drive
\f3bootp\fP	network by BOOTP and TFTP protocols (ethernet only)
.Ee
The \f2controller\fP designates which hardware controller to use if multiple
controllers for the same type of device exist.
Controllers are numbered
starting at zero.
The \f2unit\fP designates which drive to use when a single
controller is used with multiple drives.
When used with a SCSI device, the
unit number is the same as the SCSI target number for the drive.
The \f2partition\fP designates
which disk partition is to be used.
Partitions are numbered 0, 1, 2, 3, 4,
5, 6, 7, 8, 9, a, b, c, d, e, f.
The controller, unit, and partion all default to zero.
.P
The devices supported by the PROM varies from system to system.
.SS "Manual Mode Commands"
.TP 10
\f3auto\fP
Attempts to boot the system into normal operation.
This is the
equivalent of the \f3Start System\f1 menu command.
.TP
\f3boot\f1 [\f3\-f\f1] [\f3\-n\f1] \f2pathname\fP
Starts an arbitrary standalone program or kernel as specified by its
arguments.
The \f3\-f\fP option suppresses the invocation of the
bootstrap loader program.
The \f3\-n\fP option causes the named program
to be loaded, but not started.
.TP
\f3eaddr\fP
Prints the Ethernet address of the built-in Ethernet controller.
This
address is set at the factory and cannot be changed.
.TP
\f3date\f1 [\f2mmddhhmm\f1[\f2ccyy\f1|\f2yy\f1][\f3.\f1\f2ss\f1]]
Prints the date or sets the date when given an argument.
The PROM does not understand time zones, so times should
be given relative to GMT.
.TP
\f3exit\fP
Exits manual mode and returns to the PROM menu.
.TP
\f3help\fP
Displays a short summary of the commands available in manual mode.
.TP
\f3init\fP
Causes a partial restart of the PROM.
This command can be used to
change the default console immediately.
See the \f3console\f1 environment
variable.
.TP
\f3hinv\fP
Lists the hardware present in the system.
This list includes any disk
or tape drives, memory, and graphics options.
It lists only those
devices known to the PROM and may not include all optional boards.
.TP
\f3ls\fP \f2device\fP
List files contained on the device specified.
This can be used to
examine devices whose layout is known by the PROM such as the disk
volume header.
It cannot be used to list directories on disk partitions
containing IRIX filesystems.
.TP
\f3off\fP
Turns off the power.
Supported only on a subset of systems with
software power control.
.TP
\f3passwd\fP
Set the PROM password.
The PROM password can be set to restrict operation
of certain PROM modes.
With a password set, any attempt to do anything
other than a standard system boot requires that the password be reentered.
The password is remembered after the system is powered off.
.IP
If the password is forgotten, some systems allow the superuser to
reset it while running IRIX.
Use the \f2nvram\fP command to set the \f3passwd_key\f1 variable to a
null string (\f3nvram passwd_key ""\f1).
Other systems also have a jumper on the system board that can be
removed to disable the PROM password.
In addition some systems force the \f3console\f1 environment variable
to \f3g\f1 while the jumper is removed.
This jumper should only be removed temporarily in order to reset
the password or fix the \f3console\f1 environment variable.
Indy, Indigo\u2\d and OCTANE have this feature.
.TP
\f3printenv\fP
List the current state of the PROM environment variables.
Some of the
variables listed retain their value after the system is powered off.
.TP
\f3resetenv\fP
Set all of the PROM nonvolatile environment variables to their factory
defaults.
This does not affect the PROM password.
.TP
\f3resetpw\fP
Remove the PROM password.
With no PROM password set, all commands and
menu options function without restriction.
.TP
\f3setenv [\-p]\fP \f2variable value\fP
Set the specified environment variable to a particular value.
Environment
variables that are stored in nonvolatile RAM are changed there as well.
The \f3\-p\fP option specifies that this variable should be saved as a
\f2persistent\fP variable by means of adding the variable to
nonvolatile RAM.
This is particularly useful for setting frequently
used options when starting up the system.
Note that a fixed
nonvolatile RAM variable is not superseded by this option,
but the command behaves as if the \f3\-p\fP flag is not present.
Currently this option is available only on some system types.
Among them are the Indy, the O2, OCTANE and the Origin series.
.TP
\f3single\fP
Start the system in single user mode.
The system is booted as in the
\f3auto\f1 command described above, except that it enters initstate \f3s\f1
instead of initstate \f32\f1.
See
.IR init (1M)
for more information on initialization states.
.TP
\f3unsetenv\fP \f2variable\fP
Disassociates any value with the named environment variable.
.TP
\f3version\fP
Prints a message containing information about the PROM.
.P
In addition to the commands above, a pathname can be entered directly, which
the PROM attempts to load and execute.
.SS "PROM Environment Variables"
.TP 10
\f3netaddr\fP
Used when booting or installing software from a remote system by Ethernet.
This variable should be set to contain the Internet address of the system.
It is stored in nonvolatile RAM.
.TP
\f3dbaud\fP
Diagnostic baud rate.
It can be used to specify a baud rate
other than the default when a terminal connected to serial port #1 is to
be used as the console.
This variable is stored in nonvolatile RAM.
.TP
\f3bootfile\fP
This variable controls two aspects of the automatic boot up process.
First,
it names the standalone loader that is used as an intermediary when booting
from disk.
Second, the device portion of the filename is used to determine
the default boot disk.
The PROM assumes that the disk specified as part of
the standalone loader pathname is the disk where the IRIX root filesystem
exists.
Furthermore, during software installation, the PROM uses that disk's
swap partition for the miniroot.
The actual partitions assumed by
the PROM to contain the root filesystem and swap area are determined by
reading the volume header.
See
.IR vh (7M)
for more information.
This variable is stored in nonvolatile RAM.
.TP
\f3bootmode\fP
The default mode of operation after you turn on power to the system is
determined by the \f3bootmode\f1 variable.
If the \f3bootmode\f1 is set to \f3c\f1, then the system
is automatically booted whenever it is reset or power is
turned on to the system.
If the \f3bootmode\f1
is set to \f3m\f1, the PROM displays the menu and waits for a command
instead.
Setting \f3bootmode\f1 to \f3d\f1 has the same affect as \f3m\f1,
with the addition of more verbose power-on diagnostics.
This variable is stored in nonvolatile RAM.
.TP
\f3boottune\fP
Selects among the available boot tunes.
It is specified as a small
integer such as \f31\f1, which is the default tune.
A setting of \f30\f1 selects a random tune.
Currently only the POWER Indigo\u2\d and the Indigo\u2\d 10000 support
this variable.
This variable is stored in nonvolatile RAM.
.TP
\f3autopower\fP
On systems with software power control, a setting of \f3y\f1 allows
the system to automatically power back on after an AC power failure.
The default setting of \f3n\f1 requires the power switch to be pressed
to restart the system.
This variable is stored in nonvolatile RAM.
.TP
\f3console\fP
The system console can be set with the \f3console\f1 variable.
If \f3console\f1 is
set to \f3g\f1 or \f3G\f1, the console is assumed to be the graphics display.
On some systems with multiple graphics adapters, setting \f3console\f1 to
\f3g0\f1 (identical to \f3g\f1), \f3g1\f1, or \f3g2\f1 can be used to select
alternate graphics displays.
If \f3console\f1 is set to \f3d\f1, the console is assumed to be a terminal
connected to the first serial port.
In addition, some systems also accept \f3d2\f1 for a terminal connected to
second serial port.
Lastly, this can be overridden on some systems by removing the password
jumper and forcing the console to \f3g\f1, which is useful for
for recovering from setting \f3console\f1 to \f3d\f1 when a terminal is
not available.
This variable is stored in nonvolatile RAM.
.TP
\f3diskless\fP
If set to \f31\f1, the kernel assumes that the system is to be
started up as a diskless node.
This variable is stored in nonvolatile RAM.
.TP
\f3monitor\fP
Overrides the default monitor setting when an unrecognized monitor is
attached to an Indy system.
Specifying \f3h\f1 or \f3H\f1 indicates the attached
monitor supports high resolution mode (1280x1024 @ 60Hz).
Otherwise the
default resolution is low resolution (1024x768 @ 60Hz).
This variable is
usable only on an Indy system and is stored in nonvolatile RAM.
.TP
\f3nogfxkbd\fP
If set to \f31\f1, the system does not require the keyboard to be plugged
in.
By default, if the console is the graphics display and the keyboard
is not plugged in or is otherwise unresponsive to commands, it is assumed
to be broken.
The system switches to the serial terminal console
and waits for a command.
This variable is stored in nonvolatile RAM.
.TP
\f3notape\fP
If set to \f31\f1, the PROM assumes that the Ethernet is to be used
for software installation or system recovery even if a tape drive is
present on the system.
By default, if the PROM sees a tape drive in
the hardware inventory, it assumes that it will be used for software
installation; setting \f3notape\f1 allows that assumption to be overruled.
.TP
\f3volume\fP
Sets the speaker volume during boot up.
This controls the volume of the
startup, shutdown, and bad graphics tunes generated on systems with
integral audio hardware.
This variable is stored in nonvolatile RAM.
.TP
\f3pagecolor\fP
Sets the background color of the textport set with a six character
string of hex RGB values.
This variable is stored in nonvolatile RAM.
.TP
\f3path\fP
The \f3path\f1 variable is used with some commands to provide a default
device name.
It is derived from the \f3bootfile\f1 variable.
.TP
\f3prompoweroff\fP
If set to \f3y\f1, the IRIX operating system returns to the PROM to do the
actual powering off of the system.
Powering off the system by the PROM is preceded by the playing of the
"shutdown" tune that is normally played when returning to the PROM
monitor via the \f2shutdown\fP or \f2halt\fP commands.
This variable is available only on Indy systems and must be set
with the command \f3setenv \-p prompoweroff y\f1 command to retain the
setting after power is turned off.
.TP
\f3rebound\fP
If set to \f3y\f1, the system attempts to automatically reboot in the
event of a kernel panic overriding the value of the \f3reboot_on_panic\f1
systune parameter.
This variable is stored in nonvolatile RAM.
.TP
\f3sgilogo\fP
If set to \f3y\f1, the SGI logo and other product information is shown
on systems that support the standalone GUI.
This variable is stored in nonvolatile RAM.
.TP
\f3ef0mode\fP
If the user wants to disable autonegotiation and select prom ethernet mode
manually, this variable needs to be set to one of \f3{10, H10, F10, 100,
H100, F100}\f1, where H means half duplex, F means full duplex, and
numbers mean either 10Mb/sec or 100Mb/sec.
This variable exists for OCTANE prom only.
.SS ARCS PROM
Machines with the ARCS PROM behave similar to what is described above.
Changes were made to support the Advanced Computing Environment's (ACE)
Advanced Risc Computing Standard (ARCS), provide a graphical user interface,
and clean up various loopholes in older PROMs.
In many cases efforts were made to maintain old syntax and conventions.
.P
The ARCS document describes system requirements, which includes minimum
system function, procedure entry points, environment variables, hardware
inventory, and other system conventions.
Programmatic interfaces and other hardware requirements are outside the
scope of this reference page.
.P
ARCS pathnames are tied directly to the hardware inventory, which
is stored in a tree that represents the system's device architecture.
It is rooted with a system entry and grows to peripheral devices such
as a disk drive.
ARCS pathnames are written as a series of \f2type(unit)\f1 components that
parallel the inventory tree.
.P
Old-style pathnames are automatically converted to new-style pathnames,
so the old names can still be used.
The PROM matches the first device described by the pathname, so
full pathnames are not always required.
The \f3\-p\f1 option to \f3hinv\f1 prints the pathnames to all user accessible
devices.
Some examples of common pathnames are:
.Ex
\f3scsi(\&0)disk(\&1)partition(\&1)\fP	dksc(0,1,1)
\f3disk(\&1)part(\&1)\fP				same as above
\f3scsi(\&0)cdrom(\&5)partition(\&7)\fP	dksc(0,5,7)
\f3network(0)bootp()host:file\fP	bootp()host:file
\f3serial(0)\fP					first serial port
\f3keyboard()\fP				graphics keyboard
\f3video()\fP					graphics display
.Ee
.LI
On Origin systems, one more type of device-naming is supported. 
The ARCS device naming scheme has been extended to allow the use
of full hardware
graph names to specify devices not residing in the master module.
Refer to the \f2hwgraph\f1(4) manual page for more information about
device naming. For example, in the kernel, the path

.Ex
/hw/module/1/slot/io1/baseio/pci/1/scsi_ctlr/0/
        target/1/lun/0/disk/partition/0

.Ee

refers to partition 0 of a disk in module 1, slot io1,
controller 0 scsi target id of 1, scsi lun 0.

.Ee
The old device naming scheme:
.Ex
devicename(controller,unit,partition)filename
.Ee
has been retained, but cannot reference devices outside the master BASEIO
board. The master BASEIO board is the board that has the system
console connected to it.
.LI
The old device naming scheme is not implemented for non-disk devices
like tty. For example:
.Ex
tty(0), serial(0)
.Ee
are not implemented in the Origin BASEIO prom.
.LI



ARCS defines environment variables that provide the same
function as in older PROMs, but with different names and values:
.TP 10
\f3ConsoleIn/ConsoleOut\fP
These two variables are set at system startup automatically from the
\f3console\fP variable.
They are maintained for ARCS compatibility only.
.TP
\f3OSLoadPartition\f1
The device partition where the core operating system is found.
For IRIX, this variable is used as the root partition when the \f3root\f1
variable is unused or not available and the device configured in the
.IR system (4)
file with the \f3ROOTDEV\f1 directive is not available.
This variable is stored in nonvolatile RAM, but is normally left unset,
which allows the PROM to automatically configure it at system power-on.
.TP
\f3OSLoader\fP
The operating system loader.
For IRIX, this is \f2sash\f1.
This variable is stored in nonvolatile RAM, but is normally left unset,
which allows the PROM to automatically configure it at system power-on.
.TP
\f3SystemPartition\fP
The device where the operating system loader is found.
This variable is stored in nonvolatile RAM, but is normally left unset,
which allows the PROM to automatically configure it at system power-on.
.TP
\f3OSLoadFilename\fP
The filename of the operating system kernel.
For IRIX this is \f2/unix\f1.
This variable is stored in nonvolatile RAM, but is normally left unset,
which allows the PROM to automatically configure it at system power-on.
.TP
\f3OSLoadOptions\fP
The contents of this variable are appended to the \f3boot\f1 command constructed
when autobooting the system.
This variable is stored in nonvolatile RAM.
.TP
\f3AutoLoad\fP
Controls if the system boots automatically on reset/power cycle.
Can be set to \f3Yes\f1 or \f3No\f1.
Previously this function was controlled by setting \f3bootmode\f1 to
\f3c\f1 or \f3m\f1.
This variable is stored in nonvolatile RAM.
.P
To try and improve the looks and usability of the PROM, the ARCS
PROM uses a graphical interface when \f3console=g\f1.
In all cases the keyboard can be used instead of the mouse, and
in most cases the familiar keystrokes from previous PROMs work.
.P
For example, the traditional five item menu consists of a list of buttons
containing one icon each.
To make a selection, either click any mouse button with the button,
or press the corresponding 1 through 5 key.
.P
The only major user interface changes are for \f3Install Software\fP
and \f3Recover System\fP (menu items 2 and 4).
The interface allows interactive selection of a device type
and then selection among devices of that type.
This makes it easier than previous PROMS to install from
local drives or remote directories without hacks like \f3notape\f1 and
\f3tapedevice\f1.
.P
The set of commands available from the command monitor is relatively
unchanged:
.TP 10
\f3hinv\fP
By default \f3hinv\fP prints a formatted abbreviated list similar to
the old-style PROM.
A \f3\-t\f1 option has been added to print the ARCS configuration tree
directly.
A secondary option \f3\-p\f1, valid only with \f3\-t\f1, prints the
corresponding ARCS pathnames for peripheral devices.
.P
There has also been some changes/additions to the SGI-defined
environment variables:
.TP 10
\f3diskless\fP
This controls if the system is run as a diskless system.
Since some of the other environment variables are changed for
ARCS compliance, diskless setup is slightly different.
The environment should be set as follows.
.sp .8v
.nf
	diskless=1
	SystemPartition=bootp()host:/path
	OSLoader=kernelname
.fi
.TP
\f3keybd\fP
Normally this variable is left unset and the system automatically
configures the keyboard to use its native key map.
To override the default, \f3keybd\f1 should be set to a three to five character
string.
The following strings are recognized, depending on the PROM revision:
USA, DEU, FRA, ITA, DNK, ESP, CHE-D, SWE, FIN, GBR, BEL, NOR, PRT, CHE-F or
US, DE, FR, IT, DK, ES, de_CH, SE, FI, GB, BE, NO, PT, fr_CH on systems
with the keyboard layout selector.
On newer systems, JP is also acceptable.
.IP
Alternatively you can select between swiss french and swiss german by
setting \f3keybd\fP to \f3d\f1 or \f3D\f1 for the german map.
On systems with PC keyboards, a string not matching one of the above
is passed to the X server and used as the name of the keyboard map
to load.
This variable is stored in nonvolatile RAM.
.TP
\f3diagmode\fP
If set to \f3v\f1, power-on diagnostics are verbose.
In addition, more diagnostics are run.
This is similar to \f3bootmode=d\f1, however it does not affect the behavior
of AutoLoad.
This variable is stored in nonvolatile RAM.
.P
The ARCS standard specifies different error numbers than IRIX:
.Ex
ESUCCESS			0
E2BIG			1
EACCES			2
EAGAIN			3
EBADF			4
EBUSY			5
EFAULT			6
EINVAL			7
EIO				8
EISDIR			9
EMFILE			10
EMLINK			11
ENAMETOOLONG		12
ENODEV			13
ENOENT			14
ENOEXEC			15
ENOMEM			16
ENOSPC			17
ENOTDIR			18
ENOTTY			19
ENXIO			20
EROFS			21
EADDRNOTAVAIL		31
ETIMEDOUT			32
ECONNABORTED		33
ENOCONNECT		34
.Ee
.SS Examples
To boot the disk formatter,
.IR fx (1M),
from a local tape containing the installation tools:
.TP 4
1.
Get into the command monitor by choosing option \f35\f1 from the menu.
.TP
2.
Determine the type of CPU board in your system with the \f2hinv\fP command.
The board type is listed as the letters \f3IP\f1 followed by a number.
Also,
look for the item that lists the tape drive to determine the format of the
device name.
For instance, a SCSI tape addressed as device 7 might be
listed as \f3SCSI tape: tpsc(0,7)\f1 in which
case the device is \f3tpsc(0,7)\f1.
.TP
3.
With the installation tools tape in the drive, boot \f2fx\f1 as follows:
.sp .8v
	\f4boot -f tpsc(0,7)fx.IP6\f1
.sp .8v
where \f3tpsc(0,7)\f1 is the device name and \f3IP6\f1 is the CPU board type.
.P
To change the system console from the graphics display to a terminal
connected to serial port #1:
.TP 4
1.
Get into the command monitor by choosing option \f35\f1 from the menu.
.TP
2.
Change the \f3console\f1 variable to \f3d\f1 as follows:
.sp .8v
	\f4setenv console d\f1
.TP
3.
Reinitialize the PROM with the \f3init\fP command:
.sp .8v
	\f4init\f1
.SH SEE ALSO
bootp(1M),
fx(1M),
inst(1M),
nvram(1M),
tftpd(1M).
