calmsacibis995/irix-6517-src/irix/man/man1m/sn0msc.1m
.\" by Curt McDowell, Silicon Graphics, Inc. (csm@sgi.com)
.nr X
.if \nX=0 .ds x} sn0msc 1M ""  "\&"
.TH \*(x}
.SH NAME
sn0msc \- Perform Origin and Onyx2 system controller operations
.SH SYNOPSIS
.nf
\f3/usr/etc/sn0msc \c
\-r\f1 [ \f3\-x\f1 ] \f3elsc_nvram_dev addr\f1 [ \f3count\f1 ]
\f3/usr/etc/sn0msc \c
\-w\f1 \f3elsc_nvram_dev addr value\f1 [ \f3count\f1 ]
\f3/usr/etc/sn0msc \c
\-c\f1 \f3elsc_controller_dev command\f1
.fi
.SH DESCRIPTION
.I sn0msc
performs operations on the Origin and Onyx2
Module System Controllers (MSCs).
.PP
.I WARNING:
If used improperly, this command may cause system malfunction
that is not fixed by system reset or power cycling.  See below
for more information.
.P
There are three basic operations controlled by the flags given:
.TP
.B \-r
Reads the MSC NVRAM contents of a specific MSC device
(\f3elsc_nvram_dev\f1)
at a specific address
(\f3addr\f1)
for a specific number of bytes
(\f3count\f1, default 1).
Output is in hex if the
.B \-x
flag is given, decimal otherwise.
.TP
.B \-w
Writes the MSC NVRAM contents of a specific MSC device
(\f3elsc_nvram_dev\f1)
at a specific address
(\f3addr\f1)
with a specific value
(\f3value\f1)
for a specific number of bytes
(\f3count\f1, default 1).
.TP
.B \-c
Executes an MSC command on a specific MSC device
(\f3elsc_controller_dev\f1) and displays the output from the MSC.
Certain commands may cause the system to function incorrectly.
Commands that include white space must be quoted from the shell.
.PP
The NVRAM contains 2048 bytes.
.PP
A corrupted MSC NVRAM can be repaired by writing zeroes over the
entire contents of the NVRAM, power-cycling the MSC
from the main breaker or power plug, and setting the module number
back to the correct value.
.SH "FILES"
.nf
.ta \w'/hw/module/\f4N\f1/elsc/controllerxxxx'u
/hw/module/\f4N\f1/elsc/controller	elsc controller devices
/hw/module/\f4N\f1/elsc/nvram	elsc NVRAM devices
.fi
.SH "SEE ALSO"
mmscd(1M), sn0log(1M)
