calmsacibis995/irix-6517-src/irix/man/man1m/sysctlrd.1m
.nr X
.if \nX=0 .ds x} sysctlrd 1M ""  "\&"
.TH \*(x}
.SH NAME
sysctlrd \- communicates with the system controller and LCD front panel on Onyx/Challenge L/XL systems
.SH SYNOPSIS
.nf
\f3/usr/etc/sysctlrd \-d\f1 [ \f3\-g\f1 ] [ \f3\-n\f1 ] [ \f3\-v\f1 ] | \c
\f3\-p\f1
.fi
.SH DESCRIPTION
.I sysctlrd
can be run as a user command or as a daemon run by
.IR /etc/rc2.d/S33sysctlr .
It handles all necessary communications with an Onyx or
Challenge L/XL system's
system controller,
which controls power sequencing and fan speed, monitors system sensors,
and drives the LCD front panel.
.I sysctlrd
runs the cpu activity histogram on the front panel, retrieves environmental
sensor data, and handles warning and alarm messages from the
system controller.
.I sysctlrd
also logs configuration error messages from the PROM in
.I /var/adm/SYSLOG
(see
.IR syslog (3C)).
.PP
The options are:
.TP
.B \-d
Daemon mode.
Only one
.I sysctlrd
can run as a daemon at a time, and it must be run as root.
.TP
.B \-g
Graceful powerdown mode (only works with
.BR \-d ).
.I sysctlrd
sends a hang-up signal to all processes, waits two seconds, sends a kill
signal to all processes, syncs all disks, and then powers the system down.
.TP
.B \-n
No CPU meter mode (only works with
.BR \-d ).
Keeps
.I sysctlrd
from sending CPU performance information to the LCD front panel.
.TP
.B \-v
Give more verbose output.
.TP
.B \-l
Logging of VDC extrema changes from all of the power supplies when run in VDC variance logging mode. (e.g. the "-l" option is passed to sysctlrd from /etc/init.d/sysctlr). This is useful if you are collecting lots of information to debug and/or analyze a problem which you believe may be related to power surges and/or hardware failures. Please contact SGI technical support in the event that there is some problem which you believe needs their attention.
.TP
.B \-p
Print sensor information (does not work with
.BR \-d ).
This option causes
.I sysctlrd
to query the daemon for
system controller
sensor information and print it in a human-readable format.
.SH DIAGNOSTICS
"*** ..." messages are PROM configuration messages logged by
.IR sysctlrd .
.PP
Messages of the form "Event: date time: ..." are retrieved directly from
system controller
log RAM.
These may hold information about when and why the system was shut down
previously.
Note that the times listed are from the
system controller's internal clock.  This clock is set at each invocation of
.I sysctlrd
with the
.B \-d
option, and it runs freely from then on.
The clock has no concept of
alternate timezones.
Some examples of informational messages that may be
logged are:
.TP 16
.B SCLR DETECTED
The system was reset from the front panel or rebooted via
a UNIX command.
.TP
.B SYSTEM OFF
The system was powered-off from the front panel.
.TP
.B SYSTEM ON
The system was powered-on from the front panel.
.TP
.B NMI
Someone selected NMI (nonmaskable interrupt) from the front panel.
.PP
"Couldn't open /dev/sysctlr. Exiting" is printed to standard error if the
daemon cannot open the system controller device driver.
It usually means
that a daemon is already running.
.PP
"Get env info failed" is logged if
.I sysctlrd
is unable to get the sensor information after retries.
.PP
"Get scale failed!  Assuming small panel" is logged if
.I sysctlrd
cannot get the LCD panel size.
On Onyx/Challenge XL systems, this
results in very short CPU performance bars since they are improperly
scaled.
.PP
"Get log failed!" is logged if
.I sysctlrd
cannot retrieve the
system controller
event log containing such events as system resets, power fails, voltage
problems, overheating, and so on.
.PP
"Can't contact daemon. Exiting" is printed to standard error if a
non-daemon invocation of
.I sysctlrd
cannot contact the daemon to retrieve information.
The daemon may have
died or may not have been able to set up its IPC.
.PP
"Giving up on fetching environmental information" is logged if
.I sysctlrd
fails to retrieve environment information 20 times in succession.
Non-daemon invocations cannot retrieve information after this happens.
.PP
"Overtemp alarm!" is printed to standard error when the
system controller
sends an overtemp message.
This system is shut down automatically at this
point, syncing disks if graceful powerdown is active.
.PP
"Keyswitch off!" is printed to standard error when the key is switched off with
.I sysctlrd
running.
This system is shut down, syncing disks if graceful powerdown is
active.
.PP
"Blower failure!" is printed to standard error if the
system controller
detects a failure in one of the system's fans.
The system is powered-down
immediately.
.PP
"Voltage out of tolerance!" is logged if the
system controller
detects a voltage that is out of tolerance but not yet dangerous to the
system.
.PP
"Firmware compensating for blower RPM problem" is logged if the
system controller
must compensate for a blower speed problem by requesting a higher blower speed.
.PP
"System controller firmware reset" is logged if the
system controller
firmware detects an internal error and resets itself.
This message is only
indicative of a problem if it is logged repeatedly.
.PP
"COP timer reset error!" is logged if the
system controller
internal timer detects hung firmware.
Again, this message is only indicative
of a problem if it is logged repeatedly.
.PP
"System controller crystal oscillator failed!" is logged if the
system controller
detects a problem with its own oscillator.

.PP 
The system controller will send a warning message when it measures
a RPM higher then the upper tolerance.  Normally this message is sent
immediately after the system controller powers up (this is only for
the systems that have the 2700 RPM blower installed).  Sometimes, the
blower sends out bad RPM data.  The measurement data shows RPM values
> 28000 RPM.  In cases such as these, it has been determined that the
tach pulse from the blower has noise on it, which causes these
incorrect high readings.  Some blower(s) checked were actually
spinning near 1400 RPM when they were reporting an RPM value of 27K.
Now, the system controller monitors for this condition and if a
reading is posted by the system controller > 3000 RPM, a notification
message will be posted as a warning in both the SYSLOG and on the
console at the first occurence of such an event and at intervals of
one hour thereafter (if the condition persists). Please contact SGI
technical support in the event that you constantly receive such a
message from the system controller.  
.PP 
Note: running the system controller daemon with verbose mode on (-v)
will generate a large amount of output in the system logfile and
should only be used when debugging hardware configurations.



.SH "SEE ALSO"
syslog(3C),
sysctlr(7M).
