calmsacibis995/irix-6517-src/irix/man/man1m/wakeupat.1m
.nr X
.if \nX=0 .ds x} wakeupat 1M "User Environment Utilities" "\&"
.TH \*(x}
.SH NAME
wakeupat \- request that system power back on at a future time
.SH SYNOPSIS
.nf
\f3wakeupat\f1 time [ date ] [ \f3+\f1increment ]
.fi
.SH DESCRIPTION
.I wakeupat
allows you to specify a time at which the system will power on
by itself.
Currently only Indy, Indigo\u2\d, OCTANE and Challenge M support this feature.
The syntax for specifying the time is identical to that
of the
.IR at (1)
command.
.P
If the system is rebooted after this command is used, the
.I wakeupat
time is cleared and must be reissued.
If the system is not powered
off before the given time, the command has no effect (that is, the system
will not
power back on as soon as powered off).
.P
Systems may have a limited range for which power up requests are valid.
For Indy and Indigo\u2\d, the time must be within one week from the
current date.
On OCTANE the time must be within one month of the current date.
Note that
the requested date is programmed into the poweron circuitry at the
time the system is shutdown or powered off, and will not take effect
if the system shuts down abnormally.
If the date at the time of system
shutdown has been changed so as to be later than the requested power on
time, the system will not power back on automatically.
.P
The
.I time
can be specified as 1, 2, or 4 digits.
One and two digit numbers are taken to be hours,
four digits
to be hours and minutes.
The time can alternately be specified as two numbers
separated by a colon, meaning
.IR hour : minute .
A suffix
.B am
or
.B pm
can be appended;
otherwise a 24-hour clock time is understood.
The suffix
.B zulu
may be used to indicate GMT.
The special names
.BR noon ,
.BR midnight ,
.BR now ,
and
.B next
are also recognized.
.P
An optional \f2date\fP can be specified as either
a month name followed by a day number
(and possibly year number preceded by an optional comma)
or
a day of the week (fully spelled or abbreviated to three characters).
Two special ``days'',
.B today
and
.B tomorrow
are recognized.
If no
.I date
is given,
.B today
is assumed if the given hour is greater than the current hour
and
.B tomorrow
is assumed if it is less.
If the given month is less than the current month (and no year is
given), next year is assumed.
.P
The optional
.I increment
is simply
a number
suffixed by one of the following:
.BR minutes ,
.BR hours ,
.BR days ,
.BR weeks ,
.BR months ,
or
.BR years .
(The singular form is also accepted.)
.P
Thus legitimate commands include:
.RS
.TS
l.
\f4wakeupat 0815am Jan 24
wakeupat 8:15am Jan 24
wakeupat now + 1 day
wakeupat 5 pm Friday
wakeupat 1900 thursday next week\f1
.TE
.RE
.SH SEE ALSO
shutdown(1M),
syssgi(2).
.SH DIAGNOSTICS
Complains about various syntax errors and times out of range.
