calmsacibis995/irix-6517-src/irix/man/man1m/xbstat.1m
.TH xbstat 1M
.SH NAME
xbstat \- monitor Crossbow (Xbow) traffic
.SH SYNOPSIS
.nf
\f3xbstat\f1 [\f3\-d\f1 devname] [\f3\-t\f1 sec]
.fi
.SH DESCRIPTION
.I xbstat
monitors the traffic from and to each of the active slots
of the Crossbow (Xbow) i/o interconnect.
It reports the total number
of micropackets sent from and received at each link.
It also reports
the LLP retries at each link.
.PP
The
.BI \-d " devname"
option specifies which Crossbow to monitor in a multi-Crossbow system.
\f2devname\fP should be a valid Xtalk monitor point under the /hw graph.
If the \f2devname\fP is not explicitly specified, xbstat monitors /dev/xbmon by default.
.PP
The
.BI \-t " sec"
option determines the duration of time in units of seconds
that the Xbow traffic will be monitored.
If this option is not is selected,
the monitoring continues until the user terminates it with a CTRL-C (or intr).
.SH OVERVIEW
.I xbstat
gets its information from the two hardware performance counters and the Link
Auxiliary Status Registers in
the Xbow.
It uses a multiplexing technique to sample and report the
SRC and DST link traffic at each XBow slot.
Cumulative counts
since the beginning of the monitoring period are reported in units
of micropackets.
.PP
.I xbstat
is capable of monitoring any selected Xbow in a multi-Xbow system.
Use \f3find /hw -name mon -print | grep xtalk\f1 to find all possible Xbow monitor
points. A specific Xbow can be selected in two ways: explicitly, as a \f2devname\fP  with the
.BI \-d
option, or implicitly, as a soft link to /dev/xbmon.

.PP
When specifying the Xbow implicitly, first create a symbolic link between the
selected Xbow monitor point and /dev/xbmon before invoking this command. See examples below.
.PP
Multiple instances of the command selecting different Xbows can be executed at a time.
However, one Xbow can be specified at a time with each instance of the command.

.PP
The monitor data is statistical since the traffic over many links and
slots is sampled or scanned during any given monitoring period.
All live
links are monitored for the same amount of time during any monitoring cycle.
.PP
Note that each slot consists of two links: SRC (Source) and DST(Destination).
.TP 14
\f3Slot\f1
Physical slot being monitored.
I/O slots will be labelled as IO1 through IO12, node slots will have labels
N1 through N4. Devices connected to each slot vary and are
platform and configuration dependent.
.TP
\f3Flags\f1
Selected flags from the Link(x) Auxiliary Status register.
.IP
Currently only the "Widget Present" flag is shown to indicate
an active/live slot.
.TP
\f3Source\f1
Number of micropackets sent from the SRC link of this slot.
.TP
\f3Destination\f1
Number of micropackets received at the DST link of this slot.
.TP
\f3RcRtry\f1
Number of LLP receive retries.
.TP
\f3TxRtry\f1
Number of LLP transmit retries.
.SH EXAMPLES
.Ex
\f4xbstat -d /hw/module/1/slot/n1/node/xtalk/0/mon -t 60\f1
.Ee
Monitors for 60 seconds the traffic at the Xbow specified.
.Ex
\f4ln -s /hw/node/xtalk/0/mon /dev/xbmon;\f1
.PP
\f4xbstat -t 60\f1
.Ee
Monitors for 60 seconds the traffic at the Xbow associated with /dev/xbmon.
.Ex
\f4xbstat\f1
.Ee
Monitors traffic until terminated by CTRL-C at the Xbow associated with /dev/xbmon.
.SH FILES
/dev/xbmon
.SH RESTRICTIONS
The command requires root privilege to run.
.SH NOTES
When a Xbow is not explicitly specified, make sure that \f2/dev/xbmon\f1
points to an existing Xbow in the system.
