calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/data/netaccount.1m
'\"macro stdmacro
.TH NETACCOUNT 1M local "Silicon Graphics, Inc."
.SH NAME
netaccount \- generate a report from a network traffic data file
.SH SYNOPSIS
\f3/usr/sbin/netaccount\fP [\f3\-p\fP \f2proto\fP] [\f3\-r\fP \f2rank\fP]
[\f3\-s\fP \f2percent\fP] [\f3\-tvy\fP] \f2file\fP
.SH DESCRIPTION
\f2Netaccount\fP generates a report from a network traffic data file obtained
using \f2netcollect\fP(1M) or \f2netpack\fP(1M).  \f2Netaccount\fP reads the
data file given in the argument list and produces a report on the standard
output.
.PP
The report potentially contains 5 sections; a total section, a source ranking
section, a source summary section, a destination ranking section, and a
destination summary section.  For a detailed description of the reports
generated, see the \f2NetVisualyzer User's Guide\fP.
.SS Options
.PP
The default report is equivalent to options of "\-r 5 \-s 25 \-t".
.PP
.TP 16
\-p \f2proto\fP
Limit the report to only cover the protocol given.  Many \-p options many
be specified to \f2netaccount\fP.  For example, to limit the report produced
to TCP, UDP, and NFS, use:
.sp 0.25
\f7netaccount -p tcp -p udp -p nfs\fP
.TP 16
\-r \f2rank\fP
By protocol, rank in order of most packets and most bytes as many as
\f2rank\fP hosts.  The default is to rank the top 5 hosts.
.TP 16
\-s \f2percent\fP
Produce a detailed summary for any host accounting for more than \f2percent\fP
percent of packets or bytes of any protocol.  The default is to summarize
any host over 25 percent.
.TP 16
\-t
Produce a count of total bytes and total packets by protocol.
.TP 16
\-v
Produce more verbose output.  This flag is additive, so \-vv will produce
more output than \-v.
.TP 16
\-y
Use name service to resolve addresses to host names.
.SH SEE ALSO
netcollect(1M), netpack(1M), \f2NetVisualyzer User's Guide\fP
.\".SH AUTHOR
.\"Ronald Jacoby
.\".so /pubs/tools/origin.sgi
