calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/data/netcollect.1m
'\"macro stdmacro
.TH NETCOLLECT 1M local "Silicon Graphics, Inc."
.SH NAME
netcollect \- collect network traffic statistics
.SH SYNOPSIS
\f3/usr/sbin/netcollect\fP [\f3\-h\fP \f2hashsize\fP] [\f3\-i\fP
\f2interface\fP] [\f3\-p\fP \f2path\fP] [\f3\-t\fP \f2interval\fP]
[\f2filter\fP]
.SH DESCRIPTION
\f2Netcollect\fP is used to collect network traffic statistics over an
extended period of time.  The data files produced can be coalesced
using \f2netpack\fP(1M) and reviewed using \f2netaccount\fP(1M).
.P
\f2Netcollect\fP uses \f2snoopd\fP(1M) to capture network traffic.  In
order to subscribe to \f2snoopd\fP, the user must be authorized.  See
\f2snoopd\fP(1M) and the \f2NetVisualyzer User's Guide\fP for details.
.P
\f2Netcollect\fP stores its data files under \f2path\fP.  A directory
structure is created with year at the top, month under year, and day
under month.  In the day directories are the actual data files named by
start and end time of the sample in the form \f2hh:mm-hh:mm\fP.  The
first sampling interval is adjusted such that the end time will create
an even alignment, meaning that if the interval is 1 hour and
\f2netcollect\fP is started at 10:14, the first interval will be
10:14-10:59, and the next will be 11:00-11:59.
.SS Options
.TP 16
\-h \f2hashsize\fP Change the size of the hash table used internally to
store the data.  The default is 1024 entries.
.TP 16
\-i \f2interface\fP Collect the data from the host interface specified
by \f2interface\fP.  The default is to use the default interface on the
local system.
.TP 16
\-p \f2path\fP Store collected data directories under \f2path\fP.  The
default is the current directory.
.TP 16
\-t \f2interval\fP Change the sample interval to \f2interval\fP
minutes.  The sampling interval controls the amount of time for which
traffic is collected and written into data files.  The default is 60
minutes.  The maximum is 1440 minutes or 24 hours.
.P
A \f2filter\fP may also be given on the command line.
This is a standard \f2NetVisualyzer\fP filter expression.
Filter expressions are used to limit the captured network packets only
to those which match the expression.

.SH SEE ALSO
netaccount(1M), netpack(1M), \f2NetVisualyzer User's Guide\fP
.\".SH AUTHOR
.\"Ronald Jacoby
.\".so /pubs/tools/origin.sgi
