calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/data/netpack.1m
'\"macro stdmacro
.TH NETPACK 1M local "Silicon Graphics, Inc."
.SH NAME
netpack \- coalesce network traffic data files
.SH SYNOPSIS
\f3/usr/sbin/netpack\fP [\f3\-p\fP \f2path\fP] [\f3\-rv\fP]
\f2file1\fP \f2file2\fP ...
.SH DESCRIPTION
\f2Netpack\fP is used to coalesce network traffic data files obtained from
\f2netcollect\fP(1M).  The resulting file can then be reviewed using
\f2netaccount\fP(1M).
.P
\f2Netpack\fP reads each data file given in the argument list and creates
a single file which is the result of merging all the data.  The result file
is written into the directory structure used by \f2netcollect\fP(1M) under
\f2path\fP with the year being at the top, month below year, and day below
month.  If the result file spans two days, it will be placed in the month
directory and named in the form:
.Ex
DD@hh:mm-DD@hh:mm
.Ee
.PP
For example:
.Ex
04@17:00-05@08:59
.Ee
.PP
If the result file spans months, it will be
written in the year directory named in the form:
.Ex
MM.DD@hh:mm-MM.DD@hh:mm
.Ee
.PP
For example:
.Ex
01.01@00:00-12.31@23:59
.Ee
.PP
If the result file spans years, it will be written in the top level directory
and named in the form:
.Ex
YYYY.MM.DD@hh:mm-YYYY.MM.DD@hh:mm
.Ee
.PP
For example:
.Ex
1990.01.01@00:00-1991.12.31@23:59
.Ee
.ne 20
.SS Options
.TP 16
\-p \f2path\fP
Store result file in directory structure under \f2path\fP.  By default, the
current path is checked to see if it contains a data directory structure.
If it does, it is used, otherwise a directory structure is created in 
the current directory.
.TP 16
\-r
Remove the original argument data files after merging.
.TP 16
\-v
Produce more verbose output while merging.
.SH SEE ALSO
netaccount(1M), netcollect(1M), \f2NetVisualyzer User's Guide\fP
.\".SH AUTHOR
.\"Ronald Jacoby
.\".so /pubs/tools/origin.sgi
