calmsacibis995/irix-6517-src/irix/cmd/netman/man/man1m/data/snoopd.1m
'\"macro stdmacro
.TH SNOOPD 1M local "Silicon Graphics, Inc."
.SH NAME
snoopd \- network traffic monitoring daemon
.SH SYNOPSIS
.B /usr/etc/rpc.snoopd
.RB [ \-d ]
.RB [ \-p\0 \f2packetbuf\fP]
.RB [ \-q\0 \f2queuelimit\fP]
.RB [ \-t\0 \f2lingertime\fP]
.RB [ \-y ]
.SH DESCRIPTION
.I Snoopd
is an
.IR rpc (4)
server that returns network traffic data of various types to subscribing
clients.
It is invoked on demand by
.IR inetd (1M)
and logs diagnostics to
.IR syslog (3B).
.PP
To subscribe to a
.I snoopd
service, a client must be authorized in the
.I /etc/rpc.snoopd.auth
file.
This file's syntax allows the specification of groups of service users
on sets of hosts to accept and reject.
Entries have the form:
.Ex 2
accept hostname:user.group1+group2+...+groupN/service ...
reject hostname:user.group1+group2+...+groupN/service ...
.Ee
.if n .sp
where the wildcard character
.B \s-1*\s0
can stand for all hosts, all users, etc.
.PP
For example, suppose
.I snoopd
were to accept all users from the
host
.BR \s-1iris1\s0 ,
just users
.B \s-1root\s0
and
.B \s-1netop\s0
from the hosts
.B \s-1iris2\s0
and
.BR \s-1iris3\s0 ,
and the user
.B \s-1netmgr\s0
with group
.B \s-1network\s0
from any host.
The
.I rpc.snoopd.auth
entries would be:
.Ex 3
accept iris1:*
accept iris2,iris3:root,netop
accept *:netmgr.network
.Ee
.if n .sp
or equivalently, on one line and without unnecessary wildcards:
.Ex 1
accept iris1 iris2,iris3:root,netop *:netmgr.network
.Ee
.SS Options
.TP 16
\-d
Increase debugging information.  The default logging level is
.B \s-1LOG_ERR\s0
and above.
Each occurence of
.B \-d
increments the level.
See
.IR syslog (3B).
.TP 16
\-p \f2packetbuf\fP
Set the internal packet buffer to a maximum of
.I packetbuf
packets.
The default is 128 packets.
.TP 16
\-q \f2queuelimit\fP
Set the kernel input queue for
.IR snoopd 's
packet buffering to
.I queuelimit
bytes.
The default is 60000 bytes.
.TP 16
\-t \f2lingertime\fP
Set the time that
.I snoopd
will wait for a connection after its last client has gone to
.I lingertime
seconds.
The default is 30 seconds.
.TP 16
\-y
Use NIS name service to resolve addresses to host names.
.PP
.SH SEE ALSO
analyzer(1M), netcollect(1M), inetd(1M), netgraph(1M), netlook(1M),
netsnoop(1M), snoop(7P), \f2NetVisualyzer User's Guide\fP
.\".SH AUTHOR
.\"Ronald Jacoby
.\".so /pubs/tools/origin.sgi
